struct typedef __va_list_tag __va_list_tag {
	unsigned int               gp_offset;            /*     0     4 */
	unsigned int               fp_offset;            /*     4     4 */
	void *                     overflow_arg_area;    /*     8     8 */
	void *                     reg_save_area;        /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
struct _G_fpos64_t {
	__off64_t                  __pos;                /*     0     8 */
	__mbstate_t                __state;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct _IO_FILE {
	int                        _flags;               /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	char *                     _IO_read_ptr;         /*     8     8 */
	char *                     _IO_read_end;         /*    16     8 */
	char *                     _IO_read_base;        /*    24     8 */
	char *                     _IO_write_base;       /*    32     8 */
	char *                     _IO_write_ptr;        /*    40     8 */
	char *                     _IO_write_end;        /*    48     8 */
	char *                     _IO_buf_base;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     _IO_buf_end;          /*    64     8 */
	char *                     _IO_save_base;        /*    72     8 */
	char *                     _IO_backup_base;      /*    80     8 */
	char *                     _IO_save_end;         /*    88     8 */
	class _IO_marker *         _markers;             /*    96     8 */
	class _IO_FILE *           _chain;               /*   104     8 */
	int                        _fileno;              /*   112     4 */
	int                        _flags2;              /*   116     4 */
	__off_t                    _old_offset;          /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	short unsigned int         _cur_column;          /*   128     2 */
	signed char                _vtable_offset;       /*   130     1 */
	char                       _shortbuf[1];         /*   131     1 */

	/* XXX 4 bytes hole, try to pack */

	_IO_lock_t *               _lock;                /*   136     8 */
	__off64_t                  _offset;              /*   144     8 */
	class _IO_codecvt *        _codecvt;             /*   152     8 */
	class _IO_wide_data *      _wide_data;           /*   160     8 */
	class _IO_FILE *           _freeres_list;        /*   168     8 */
	void *                     _freeres_buf;         /*   176     8 */
	size_t                     __pad5;               /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        _mode;                /*   192     4 */
	char                       _unused2[20];         /*   196    20 */

	/* size: 216, cachelines: 4, members: 29 */
	/* sum members: 208, holes: 2, sum holes: 8 */
	/* last cacheline: 24 bytes */
};
struct timeval {
	__time_t                   tv_sec;               /*     0     8 */
	__suseconds_t              tv_usec;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct timespec {
	__time_t                   tv_sec;               /*     0     8 */
	__syscall_slong_t          tv_nsec;              /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct __pthread_internal_list {
	class __pthread_internal_list * __prev;          /*     0     8 */
	class __pthread_internal_list * __next;          /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct __pthread_mutex_s {
	int                        __lock;               /*     0     4 */
	unsigned int               __count;              /*     4     4 */
	int                        __owner;              /*     8     4 */
	unsigned int               __nusers;             /*    12     4 */
	int                        __kind;               /*    16     4 */
	short int                  __spins;              /*    20     2 */
	short int                  __elision;            /*    22     2 */
	__pthread_list_t           __list;               /*    24    16 */

	/* size: 40, cachelines: 1, members: 8 */
	/* last cacheline: 40 bytes */
};
struct __pthread_rwlock_arch_t {
	unsigned int               __readers;            /*     0     4 */
	unsigned int               __writers;            /*     4     4 */
	unsigned int               __wrphase_futex;      /*     8     4 */
	unsigned int               __writers_futex;      /*    12     4 */
	unsigned int               __pad3;               /*    16     4 */
	unsigned int               __pad4;               /*    20     4 */
	int                        __cur_writer;         /*    24     4 */
	int                        __shared;             /*    28     4 */
	signed char                __rwelision;          /*    32     1 */
	unsigned char              __pad1[7];            /*    33     7 */
	long unsigned int          __pad2;               /*    40     8 */
	unsigned int               __flags;              /*    48     4 */

	/* size: 56, cachelines: 1, members: 12 */
	/* padding: 4 */
	/* last cacheline: 56 bytes */
};
struct __pthread_cond_s {
	union {
		long long unsigned int     __wseq;               /*     0     8 */
		struct {
			unsigned int       __low;                /*     0     4 */
			unsigned int       __high;               /*     4     4 */
		} __wseq32;                                      /*     0     8 */
	};

	union {
		long long unsigned int     __g1_start;           /*     0     8 */
		struct {
			unsigned int       __low;                /*     0     4 */
			unsigned int       __high;               /*     4     4 */
		} __g1_start32;                                  /*     0     8 */
	};

	union {
		long long unsigned int __wseq;           /*     0     8 */
		struct {
			unsigned int __low;              /*     0     4 */
			unsigned int __high;             /*     4     4 */
		} __wseq32;                              /*     0     8 */
	};                                               /*     0     8 */
	union {
		long long unsigned int __g1_start;       /*     8     8 */
		struct {
			unsigned int __low;              /*     8     4 */
			unsigned int __high;             /*    12     4 */
		} __g1_start32;                          /*     8     8 */
	};                                               /*     8     8 */
	unsigned int               __g_refs[2];          /*    16     8 */
	unsigned int               __g_size[2];          /*    24     8 */
	unsigned int               __g1_orig_size;       /*    32     4 */
	unsigned int               __wrefs;              /*    36     4 */
	unsigned int               __g_signals[2];       /*    40     8 */

	/* size: 48, cachelines: 1, members: 7 */
	/* last cacheline: 48 bytes */
};
union pthread_attr_t {
	char                       __size[56];         /*     0    56 */
	long int                   __align;            /*     0     8 */
};
struct tm {
	int                        tm_sec;               /*     0     4 */
	int                        tm_min;               /*     4     4 */
	int                        tm_hour;              /*     8     4 */
	int                        tm_mday;              /*    12     4 */
	int                        tm_mon;               /*    16     4 */
	int                        tm_year;              /*    20     4 */
	int                        tm_wday;              /*    24     4 */
	int                        tm_yday;              /*    28     4 */
	int                        tm_isdst;             /*    32     4 */

	/* XXX 4 bytes hole, try to pack */

	long int                   tm_gmtoff;            /*    40     8 */
	const char  *              tm_zone;              /*    48     8 */

	/* size: 56, cachelines: 1, members: 11 */
	/* sum members: 52, holes: 1, sum holes: 4 */
	/* last cacheline: 56 bytes */
};
struct lconv {
	char *                     decimal_point;        /*     0     8 */
	char *                     thousands_sep;        /*     8     8 */
	char *                     grouping;             /*    16     8 */
	char *                     int_curr_symbol;      /*    24     8 */
	char *                     currency_symbol;      /*    32     8 */
	char *                     mon_decimal_point;    /*    40     8 */
	char *                     mon_thousands_sep;    /*    48     8 */
	char *                     mon_grouping;         /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     positive_sign;        /*    64     8 */
	char *                     negative_sign;        /*    72     8 */
	char                       int_frac_digits;      /*    80     1 */
	char                       frac_digits;          /*    81     1 */
	char                       p_cs_precedes;        /*    82     1 */
	char                       p_sep_by_space;       /*    83     1 */
	char                       n_cs_precedes;        /*    84     1 */
	char                       n_sep_by_space;       /*    85     1 */
	char                       p_sign_posn;          /*    86     1 */
	char                       n_sign_posn;          /*    87     1 */
	char                       int_p_cs_precedes;    /*    88     1 */
	char                       int_p_sep_by_space;   /*    89     1 */
	char                       int_n_cs_precedes;    /*    90     1 */
	char                       int_n_sep_by_space;   /*    91     1 */
	char                       int_p_sign_posn;      /*    92     1 */
	char                       int_n_sign_posn;      /*    93     1 */

	/* size: 96, cachelines: 2, members: 24 */
	/* padding: 2 */
	/* last cacheline: 32 bytes */
};
struct MYSQL_LEX_STRING {
	char *                     str;                  /*     0     8 */
	size_t                     length;               /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct MYSQL_LEX_CSTRING {
	const char  *              str;                  /*     0     8 */
	size_t                     length;               /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct MY_UNICASE_CHARACTER {
	uint32                     toupper;              /*     0     4 */
	uint32                     tolower;              /*     4     4 */
	uint32                     sort;                 /*     8     4 */

	/* size: 12, cachelines: 1, members: 3 */
	/* last cacheline: 12 bytes */
};
struct MY_UNICASE_INFO {
	my_wc_t                    maxchar;              /*     0     8 */
	const MY_UNICASE_CHARACTER  * * page;            /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct MY_UNI_CTYPE {
	uchar                      pctype;               /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	uchar *                    ctype;                /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* sum members: 9, holes: 1, sum holes: 7 */
	/* last cacheline: 16 bytes */
};
struct MY_UNI_IDX {
	uint16                     from;                 /*     0     2 */
	uint16                     to;                   /*     2     2 */

	/* XXX 4 bytes hole, try to pack */

	const uchar  *             tab;                  /*     8     8 */

	/* size: 16, cachelines: 1, members: 3 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
struct CHARSET_INFO {
	uint                       number;               /*     0     4 */
	uint                       primary_number;       /*     4     4 */
	uint                       binary_number;        /*     8     4 */
	uint                       state;                /*    12     4 */
	const char  *              csname;               /*    16     8 */
	const char  *              name;                 /*    24     8 */
	const char  *              comment;              /*    32     8 */
	const char  *              tailoring;            /*    40     8 */
	class Coll_param *         coll_param;           /*    48     8 */
	const uchar  *             ctype;                /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	const uchar  *             to_lower;             /*    64     8 */
	const uchar  *             to_upper;             /*    72     8 */
	const uchar  *             sort_order;           /*    80     8 */
	class MY_UCA_INFO *        uca;                  /*    88     8 */
	const uint16  *            tab_to_uni;           /*    96     8 */
	const MY_UNI_IDX  *        tab_from_uni;         /*   104     8 */
	const MY_UNICASE_INFO  *   caseinfo;             /*   112     8 */
	const class lex_state_maps_st  * state_maps;     /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	const uchar  *             ident_map;            /*   128     8 */
	uint                       strxfrm_multiply;     /*   136     4 */
	uchar                      caseup_multiply;      /*   140     1 */
	uchar                      casedn_multiply;      /*   141     1 */

	/* XXX 2 bytes hole, try to pack */

	uint                       mbminlen;             /*   144     4 */
	uint                       mbmaxlen;             /*   148     4 */
	uint                       mbmaxlenlen;          /*   152     4 */

	/* XXX 4 bytes hole, try to pack */

	my_wc_t                    min_sort_char;        /*   160     8 */
	my_wc_t                    max_sort_char;        /*   168     8 */
	uchar                      pad_char;             /*   176     1 */
	bool                       escape_with_backslash_is_dangerous; /*   177     1 */
	uchar                      levels_for_compare;   /*   178     1 */

	/* XXX 5 bytes hole, try to pack */

	MY_CHARSET_HANDLER *       cset;                 /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	MY_COLLATION_HANDLER *     coll;                 /*   192     8 */
	enum Pad_attribute         pad_attribute;        /*   200     4 */

	/* size: 208, cachelines: 4, members: 33 */
	/* sum members: 193, holes: 3, sum holes: 11 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct MY_CHARSET_LOADER {
	uint                       errcode;              /*     0     4 */
	char                       errarg[192];          /*     4   192 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 3 boundary (192 bytes) was 8 bytes ago --- */
	void *                     (*once_alloc)(size_t); /*   200     8 */
	void *                     (*mem_malloc)(size_t); /*   208     8 */
	void *                     (*mem_realloc)(void *, size_t); /*   216     8 */
	void                       (*mem_free)(void *);  /*   224     8 */
	void                       (*reporter)(enum loglevel, uint, ...); /*   232     8 */
	int                        (*add_collation)(class CHARSET_INFO *); /*   240     8 */

	/* size: 248, cachelines: 4, members: 8 */
	/* sum members: 244, holes: 1, sum holes: 4 */
	/* last cacheline: 56 bytes */
};
struct MY_COLLATION_HANDLER {
	bool                       (*init)(class CHARSET_INFO *, MY_CHARSET_LOADER *); /*     0     8 */
	void                       (*uninit)(class CHARSET_INFO *); /*     8     8 */
	int                        (*strnncoll)(const class CHARSET_INFO  *, const uchar  *, size_t, const uchar  *, size_t, bool); /*    16     8 */
	int                        (*strnncollsp)(const class CHARSET_INFO  *, const uchar  *, size_t, const uchar  *, size_t); /*    24     8 */
	size_t                     (*strnxfrm)(const class CHARSET_INFO  *, uchar *, size_t, uint, const uchar  *, size_t, uint); /*    32     8 */
	size_t                     (*strnxfrmlen)(const class CHARSET_INFO  *, size_t); /*    40     8 */
	bool                       (*like_range)(const class CHARSET_INFO  *, const char  *, size_t, char, char, char, size_t, char *, char *, size_t *, size_t *); /*    48     8 */
	int                        (*wildcmp)(const class CHARSET_INFO  *, const char  *, const char  *, const char  *, const char  *, int, int, int); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        (*strcasecmp)(const class CHARSET_INFO  *, const char  *, const char  *); /*    64     8 */
	uint                       (*strstr)(const class CHARSET_INFO  *, const char  *, size_t, const char  *, size_t, my_match_t *, uint); /*    72     8 */
	void                       (*hash_sort)(const class CHARSET_INFO  *, const uchar  *, size_t, uint64 *, uint64 *); /*    80     8 */
	bool                       (*propagate)(const class CHARSET_INFO  *, const uchar  *, size_t); /*    88     8 */

	/* size: 96, cachelines: 2, members: 12 */
	/* last cacheline: 32 bytes */
};
struct MY_CHARSET_HANDLER {
	bool                       (*init)(class CHARSET_INFO *, MY_CHARSET_LOADER *); /*     0     8 */
	uint                       (*ismbchar)(const class CHARSET_INFO  *, const char  *, const char  *); /*     8     8 */
	uint                       (*mbcharlen)(const class CHARSET_INFO  *, uint); /*    16     8 */
	size_t                     (*numchars)(const class CHARSET_INFO  *, const char  *, const char  *); /*    24     8 */
	size_t                     (*charpos)(const class CHARSET_INFO  *, const char  *, const char  *, size_t); /*    32     8 */
	size_t                     (*well_formed_len)(const class CHARSET_INFO  *, const char  *, const char  *, size_t, int *); /*    40     8 */
	size_t                     (*lengthsp)(const class CHARSET_INFO  *, const char  *, size_t); /*    48     8 */
	size_t                     (*numcells)(const class CHARSET_INFO  *, const char  *, const char  *); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	my_charset_conv_mb_wc      mb_wc;                /*    64     8 */
	my_charset_conv_wc_mb      wc_mb;                /*    72     8 */
	int                        (*ctype)(const class CHARSET_INFO  *, int *, const uchar  *, const uchar  *); /*    80     8 */
	size_t                     (*caseup_str)(const class CHARSET_INFO  *, char *); /*    88     8 */
	size_t                     (*casedn_str)(const class CHARSET_INFO  *, char *); /*    96     8 */
	my_charset_conv_case       caseup;               /*   104     8 */
	my_charset_conv_case       casedn;               /*   112     8 */
	size_t                     (*snprintf)(const class CHARSET_INFO  *, char *, size_t, const char  *, ...); /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	size_t                     (*long10_to_str)(const class CHARSET_INFO  *, char *, size_t, int, long int); /*   128     8 */
	size_t                     (*longlong10_to_str)(const class CHARSET_INFO  *, char *, size_t, int, longlong); /*   136     8 */
	void                       (*fill)(const class CHARSET_INFO  *, char *, size_t, int); /*   144     8 */
	long int                   (*strntol)(const class CHARSET_INFO  *, const char  *, size_t, int, const char  * *, int *); /*   152     8 */
	ulong                      (*strntoul)(const class CHARSET_INFO  *, const char  *, size_t, int, const char  * *, int *); /*   160     8 */
	longlong                   (*strntoll)(const class CHARSET_INFO  *, const char  *, size_t, int, const char  * *, int *); /*   168     8 */
	ulonglong                  (*strntoull)(const class CHARSET_INFO  *, const char  *, size_t, int, const char  * *, int *); /*   176     8 */
	double                     (*strntod)(const class CHARSET_INFO  *, const char  *, size_t, const char  * *, int *); /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	longlong                   (*strtoll10)(const class CHARSET_INFO  *, const char  *, const char  * *, int *); /*   192     8 */
	ulonglong                  (*strntoull10rnd)(const class CHARSET_INFO  *, const char  *, size_t, int, const char  * *, int *); /*   200     8 */
	size_t                     (*scan)(const class CHARSET_INFO  *, const char  *, const char  *, int); /*   208     8 */

	/* size: 216, cachelines: 4, members: 27 */
	/* last cacheline: 24 bytes */
};
struct lex_state_maps_st {
	enum my_lex_states         main_map[256];        /*     0   256 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	enum hint_lex_char_classes hint_map[256];        /*   256   256 */

	/* size: 512, cachelines: 8, members: 2 */
};
struct decimal_t {
	int                        intg;                 /*     0     4 */
	int                        frac;                 /*     4     4 */
	int                        len;                  /*     8     4 */
	bool                       sign;                 /*    12     1 */

	/* XXX 3 bytes hole, try to pack */

	decimal_digit_t *          buf;                  /*    16     8 */

	/* size: 24, cachelines: 1, members: 5 */
	/* sum members: 21, holes: 1, sum holes: 3 */
	/* last cacheline: 24 bytes */
};
struct mysql_zlib_compress_context {
	unsigned int               compression_level;    /*     0     4 */

	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
struct mysql_zstd_compress_context {
	ZSTD_CCtx *                cctx;                 /*     0     8 */
	ZSTD_DCtx *                dctx;                 /*     8     8 */
	unsigned int               compression_level;    /*    16     4 */

	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct mysql_compress_context {
	union {
		mysql_zlib_compress_context zlib_ctx;            /*     0     4 */
		mysql_zstd_compress_context zstd_ctx;            /*     0    24 */
	};

	enum enum_compression_algorithm algorithm;       /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	union {
		mysql_zlib_compress_context zlib_ctx;    /*     8     4 */
		mysql_zstd_compress_context zstd_ctx;    /*     8    24 */
	} u;                                             /*     8    24 */

	/* size: 32, cachelines: 1, members: 2 */
	/* sum members: 28, holes: 1, sum holes: 4 */
	/* last cacheline: 32 bytes */
};
struct PSI_instr {
	bool                       m_enabled;            /*     0     1 */

	/* size: 1, cachelines: 1, members: 1 */
	/* last cacheline: 1 bytes */
};
struct sockaddr {
	sa_family_t                sa_family;            /*     0     2 */
	char                       sa_data[14];          /*     2    14 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct sockaddr_storage {
	sa_family_t                ss_family;            /*     0     2 */
	char                       __ss_padding[118];    /*     2   118 */
	/* --- cacheline 1 boundary (64 bytes) was 56 bytes ago --- */
	long unsigned int          __ss_align;           /*   120     8 */

	/* size: 128, cachelines: 2, members: 3 */
};
struct mysql_cond_t {
	native_cond_t              m_cond;               /*     0    48 */
	class PSI_cond *           m_psi;                /*    48     8 */

	/* size: 56, cachelines: 1, members: 2 */
	/* last cacheline: 56 bytes */
};
struct PSI_cond : PSI_instr {
	/* struct PSI_instr           <ancestor>; */     /*     0     1 */

	/* size: 1, cachelines: 1, members: 1 */
	/* last cacheline: 1 bytes */

	/* BRAIN FART ALERT! 1 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 8 bits */
};
struct my_mutex_t {
	union u {
		native_mutex_t             m_native;             /*     0    40 */
		class safe_mutex_t *       m_safe_ptr;           /*     0     8 */
	};

	union u                    m_u;                  /*     0    40 */

	/* size: 40, cachelines: 1, members: 1 */
	/* last cacheline: 40 bytes */
};
struct mysql_mutex_t {
	my_mutex_t                 m_mutex;              /*     0    40 */
	class PSI_mutex *          m_psi;                /*    40     8 */
	void mysql_mutex_t(class mysql_mutex_t *);


	/* size: 48, cachelines: 1, members: 2 */
	/* last cacheline: 48 bytes */
};
struct PSI_mutex : PSI_instr {
	/* struct PSI_instr           <ancestor>; */     /*     0     1 */

	/* size: 1, cachelines: 1, members: 1 */
	/* last cacheline: 1 bytes */

	/* BRAIN FART ALERT! 1 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 8 bits */
};
struct PSI_file_info_v1 {
	PSI_file_key *             m_key;                /*     0     8 */
	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */
	int                        m_volatility;         /*    20     4 */
	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct PSI_file_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */
	enum PSI_file_operation    m_operation;          /*     4     4 */
	class PSI_file *           m_file;               /*     8     8 */
	const char  *              m_name;               /*    16     8 */
	void *                     m_class;              /*    24     8 */
	class PSI_thread *         m_thread;             /*    32     8 */
	size_t                     m_number_of_bytes;    /*    40     8 */
	long long unsigned int     m_timer_start;        /*    48     8 */
	long long unsigned int     (*m_timer)(void);     /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	void *                     m_wait;               /*    64     8 */

	/* size: 72, cachelines: 2, members: 10 */
	/* last cacheline: 8 bytes */
};
struct PSI_memory_info_v1 {
	PSI_memory_key *           m_key;                /*     0     8 */
	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */
	int                        m_volatility;         /*    20     4 */
	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct PSI_stage_progress_v1 {
	long long unsigned int     m_work_completed;     /*     0     8 */
	long long unsigned int     m_work_estimated;     /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct PSI_stage_info_v1 {
	PSI_stage_key              m_key;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 24, holes: 2, sum holes: 8 */
	/* last cacheline: 32 bytes */
};
struct MY_TMPDIR {
	char * *                   list;                 /*     0     8 */
	uint                       cur;                  /*     8     4 */
	uint                       max;                  /*    12     4 */
	struct mysql_mutex_t       mutex;                /*    16    48 */

	/* size: 64, cachelines: 1, members: 4 */
};
struct IO_CACHE {
	my_off_t                   pos_in_file;          /*     0     8 */
	my_off_t                   end_of_file;          /*     8     8 */
	uchar *                    read_pos;             /*    16     8 */
	uchar *                    read_end;             /*    24     8 */
	uchar *                    buffer;               /*    32     8 */
	uchar *                    request_pos;          /*    40     8 */
	uchar *                    write_buffer;         /*    48     8 */
	uchar *                    append_read_pos;      /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	uchar *                    write_pos;            /*    64     8 */
	uchar *                    write_end;            /*    72     8 */
	uchar * *                  current_pos;          /*    80     8 */
	uchar * *                  current_end;          /*    88     8 */
	struct mysql_mutex_t       append_buffer_lock;   /*    96    48 */
	/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
	class IO_CACHE_SHARE *     share;                /*   144     8 */
	int                        (*read_function)(class IO_CACHE *, uchar *, size_t); /*   152     8 */
	int                        (*write_function)(class IO_CACHE *, const uchar  *, size_t); /*   160     8 */
	enum cache_type            type;                 /*   168     4 */

	/* XXX 4 bytes hole, try to pack */

	IO_CACHE_CALLBACK          pre_read;             /*   176     8 */
	IO_CACHE_CALLBACK          post_read;            /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	IO_CACHE_CALLBACK          pre_close;            /*   192     8 */
	ulong                      disk_writes;          /*   200     8 */
	void *                     arg;                  /*   208     8 */
	char *                     file_name;            /*   216     8 */
	char *                     dir;                  /*   224     8 */
	char *                     prefix;               /*   232     8 */
	File                       file;                 /*   240     4 */
	PSI_file_key               file_key;             /*   244     4 */
	bool                       seek_not_done;        /*   248     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        error;                /*   252     4 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	size_t                     buffer_length;        /*   256     8 */
	size_t                     read_length;          /*   264     8 */
	myf                        myflags;              /*   272     4 */
	bool                       alloced_buffer;       /*   276     1 */

	/* XXX 3 bytes hole, try to pack */

	class Stream_cipher *      m_encryptor;          /*   280     8 */
	class Stream_cipher *      m_decryptor;          /*   288     8 */
	bool                       disk_sync;            /*   296     1 */

	/* XXX 3 bytes hole, try to pack */

	uint                       disk_sync_delay;      /*   300     4 */

	/* size: 304, cachelines: 5, members: 37 */
	/* sum members: 291, holes: 4, sum holes: 13 */
	/* last cacheline: 48 bytes */
};
struct IO_CACHE_SHARE {
	struct mysql_mutex_t       mutex;                /*     0    48 */
	struct mysql_cond_t        cond;                 /*    48    56 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	struct mysql_cond_t        cond_writer;          /*   104    56 */
	/* --- cacheline 2 boundary (128 bytes) was 32 bytes ago --- */
	my_off_t                   pos_in_file;          /*   160     8 */
	class IO_CACHE *           source_cache;         /*   168     8 */
	uchar *                    buffer;               /*   176     8 */
	uchar *                    read_end;             /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	int                        running_threads;      /*   192     4 */
	int                        total_threads;        /*   196     4 */
	int                        error;                /*   200     4 */

	/* size: 208, cachelines: 4, members: 10 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct PSI_cond_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_data_lock_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_error_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_file_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_idle_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_mdl_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_memory_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_mutex_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_rwlock_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_socket_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_stage_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_statement_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_system_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_table_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_thread_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_transaction_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct PSI_tls_channel_bootstrap {
	void *                     (*get_interface)(int); /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct mysql_malloc_service_st {
	mysql_malloc_t             mysql_malloc;         /*     0     8 */
	mysql_realloc_t            mysql_realloc;        /*     8     8 */
	mysql_claim_t              mysql_claim;          /*    16     8 */
	mysql_free_t               mysql_free;           /*    24     8 */
	my_memdup_t                my_memdup;            /*    32     8 */
	my_strdup_t                my_strdup;            /*    40     8 */
	my_strndup_t               my_strndup;           /*    48     8 */

	/* size: 56, cachelines: 1, members: 7 */
	/* last cacheline: 56 bytes */
};
struct PSI_memory_service_v2 {
	register_memory_v1_t       register_memory;      /*     0     8 */
	memory_alloc_v1_t          memory_alloc;         /*     8     8 */
	memory_realloc_v1_t        memory_realloc;       /*    16     8 */
	memory_claim_v2_t          memory_claim;         /*    24     8 */
	memory_free_v1_t           memory_free;          /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct MEM_ROOT {
	struct Block {
		class Block *              prev;                 /*     0     8 */

		/* size: 8, cachelines: 1, members: 1 */
		/* last cacheline: 8 bytes */
	};

	void MEM_ROOT(class MEM_ROOT *);

	void MEM_ROOT(class MEM_ROOT *, PSI_memory_key, size_t);

	void MEM_ROOT(class MEM_ROOT *, const class MEM_ROOT  &);

	void MEM_ROOT(class MEM_ROOT *, );

	class MEM_ROOT & operator=(class MEM_ROOT *, const class MEM_ROOT  &);

	class MEM_ROOT & operator=(class MEM_ROOT *, );

	void ~MEM_ROOT(class MEM_ROOT *, int);

	void * Alloc(class MEM_ROOT *, size_t);

	void * Alloc_aligned(class MEM_ROOT *, size_t, size_t);

	void Claim(class MEM_ROOT *, bool);

	void Clear(class MEM_ROOT *);

	void ClearForReuse(class MEM_ROOT *);

	bool inited(const class MEM_ROOT  *);

	void set_max_capacity(class MEM_ROOT *, size_t);

	size_t get_max_capacity(const class MEM_ROOT  *);

	void set_error_for_capacity_exceeded(class MEM_ROOT *, bool);

	bool get_error_for_capacity_exceeded(const class MEM_ROOT  *);

	void set_error_handler(class MEM_ROOT *, void (*)(void));

	size_t allocated_size(const class MEM_ROOT  *);

	void set_block_size(class MEM_ROOT *, size_t);

	class pair<char*, char*> Peek(const class MEM_ROOT  *);

	bool ForceNewBlock(class MEM_ROOT *, size_t);

	void RawCommit(class MEM_ROOT *, size_t);

private:

	static char                       s_dummy_target; /*     0     0 */
	class pair<MEM_ROOT::Block*, long unsigned int> AllocBlock(class MEM_ROOT *, size_t, size_t);

	void * AllocSlow(class MEM_ROOT *, size_t);

	void FreeBlocks(class Block *);

	class Block *              m_current_block;      /*     0     8 */
	char *                     m_current_free_start; /*     8     8 */
	char *                     m_current_free_end;   /*    16     8 */
	size_t                     m_block_size;         /*    24     8 */
	size_t                     m_orig_block_size;    /*    32     8 */
	size_t                     m_max_capacity;       /*    40     8 */
	size_t                     m_allocated_size;     /*    48     8 */
	bool                       m_error_for_capacity_exceeded; /*    56     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 1 boundary (64 bytes) --- */
	void                       (*m_error_handler)(void); /*    64     8 */
	PSI_memory_key             m_psi_key;            /*    72     4 */
	class Block * ArrayAlloc<mem_root_deque<Item*>::Block>(class MEM_ROOT *, size_t);


	/* size: 80, cachelines: 2, members: 10, static members: 1 */
	/* sum members: 69, holes: 1, sum holes: 7 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct My_free_deleter {
	void operator()(const class My_free_deleter  *, void *);


	/* size: 1, cachelines: 0, members: 0 */
	/* padding: 1 */
	/* last cacheline: 1 bytes */
};
class Collation_hasher {
public:

	void Collation_hasher(class Collation_hasher *, const class CHARSET_INFO  *);

	size_t operator()(const class Collation_hasher  *, const string  &);

	const class CHARSET_INFO  * cs;                  /*     0     8 */
	void                       (*hash_sort)(const class CHARSET_INFO  *, const uchar  *, size_t, uint64 *, uint64 *); /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
class Collation_key_equal {
public:

	void Collation_key_equal(class Collation_key_equal *, const class CHARSET_INFO  *);

	size_t operator()(const class Collation_key_equal  *, const string  &, const string  &);

	const class CHARSET_INFO  * cs;                  /*     0     8 */
	int                        (*strnncollsp)(const class CHARSET_INFO  *, const uchar  *, size_t, const uchar  *, size_t); /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct PSI_mutex_info_v1 {
	PSI_mutex_key *            m_key;                /*     0     8 */
	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */
	int                        m_volatility;         /*    20     4 */
	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct PSI_mutex_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */
	enum PSI_mutex_operation   m_operation;          /*     4     4 */
	class PSI_mutex *          m_mutex;              /*     8     8 */
	class PSI_thread *         m_thread;             /*    16     8 */
	long long unsigned int     m_timer_start;        /*    24     8 */
	long long unsigned int     (*m_timer)(void);     /*    32     8 */
	void *                     m_wait;               /*    40     8 */
	void PSI_mutex_locker_state_v1(class PSI_mutex_locker_state_v1 *);


	/* size: 48, cachelines: 1, members: 7 */
	/* last cacheline: 48 bytes */
};
struct PSI_mutex_service_v1 {
	register_mutex_v1_t        register_mutex;       /*     0     8 */
	init_mutex_v1_t            init_mutex;           /*     8     8 */
	destroy_mutex_v1_t         destroy_mutex;        /*    16     8 */
	start_mutex_wait_v1_t      start_mutex_wait;     /*    24     8 */
	end_mutex_wait_v1_t        end_mutex_wait;       /*    32     8 */
	unlock_mutex_v1_t          unlock_mutex;         /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* last cacheline: 48 bytes */
};
struct my_thread_handle {
	my_thread_t                thread;               /*     0     8 */

	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
class Mutex_lock {
public:

	void Mutex_lock(class Mutex_lock *, class mysql_mutex_t *, const char  *, int);

	void ~Mutex_lock(class Mutex_lock *, int);

	class mysql_mutex_t *      m_mutex;              /*     0     8 */
	const char  *              m_src_file;           /*     8     8 */
	int                        m_src_line;           /*    16     4 */
	void Mutex_lock(class Mutex_lock *, const class Mutex_lock  &);

	void operator=(class Mutex_lock *, const class Mutex_lock  &);


	/* size: 24, cachelines: 1, members: 3 */
	/* padding: 4 */
	/* last cacheline: 24 bytes */
};
struct PSI_idle_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	class PSI_thread *         m_thread;             /*     8     8 */
	long long unsigned int     m_timer_start;        /*    16     8 */
	long long unsigned int     (*m_timer)(void);     /*    24     8 */
	void *                     m_wait;               /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct PSI_statement_info_v1 {
	PSI_statement_key          m_key;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* sum members: 24, holes: 2, sum holes: 8 */
	/* last cacheline: 32 bytes */
};
struct PSI_statement_locker_state_v1 {
	bool                       m_discarded;          /*     0     1 */
	bool                       m_in_prepare;         /*     1     1 */
	unsigned char              m_no_index_used;      /*     2     1 */
	unsigned char              m_no_good_index_used; /*     3     1 */
	unsigned int               m_flags;              /*     4     4 */
	void *                     m_class;              /*     8     8 */
	class PSI_thread *         m_thread;             /*    16     8 */
	long long unsigned int     m_timer_start;        /*    24     8 */
	long long unsigned int     (*m_timer)(void);     /*    32     8 */
	void *                     m_statement;          /*    40     8 */
	long long unsigned int     m_lock_time;          /*    48     8 */
	long long unsigned int     m_rows_sent;          /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	long long unsigned int     m_rows_examined;      /*    64     8 */
	long unsigned int          m_created_tmp_disk_tables; /*    72     8 */
	long unsigned int          m_created_tmp_tables; /*    80     8 */
	long unsigned int          m_select_full_join;   /*    88     8 */
	long unsigned int          m_select_full_range_join; /*    96     8 */
	long unsigned int          m_select_range;       /*   104     8 */
	long unsigned int          m_select_range_check; /*   112     8 */
	long unsigned int          m_select_scan;        /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	long unsigned int          m_sort_merge_passes;  /*   128     8 */
	long unsigned int          m_sort_range;         /*   136     8 */
	long unsigned int          m_sort_rows;          /*   144     8 */
	long unsigned int          m_sort_scan;          /*   152     8 */
	const class sql_digest_storage  * m_digest;      /*   160     8 */
	char                       m_schema_name[192];   /*   168   192 */
	/* --- cacheline 5 boundary (320 bytes) was 40 bytes ago --- */
	unsigned int               m_schema_name_length; /*   360     4 */
	unsigned int               m_cs_number;          /*   364     4 */
	const char  *              m_query_sample;       /*   368     8 */
	unsigned int               m_query_sample_length; /*   376     4 */
	bool                       m_query_sample_truncated; /*   380     1 */

	/* XXX 3 bytes hole, try to pack */

	/* --- cacheline 6 boundary (384 bytes) --- */
	PSI_sp_share *             m_parent_sp_share;    /*   384     8 */
	PSI_prepared_stmt *        m_parent_prepared_stmt; /*   392     8 */

	/* size: 400, cachelines: 7, members: 33 */
	/* sum members: 397, holes: 1, sum holes: 3 */
	/* last cacheline: 16 bytes */
};
struct sql_digest_storage {
	bool                       m_full;               /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	size_t                     m_byte_count;         /*     8     8 */
	unsigned char              m_hash[32];           /*    16    32 */
	uint                       m_charset_number;     /*    48     4 */

	/* XXX 4 bytes hole, try to pack */

	unsigned char *            m_token_array;        /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	size_t                     m_token_array_length; /*    64     8 */
	void sql_digest_storage(class sql_digest_storage *);

	void reset(class sql_digest_storage *, unsigned char *, size_t);

	void reset(class sql_digest_storage *);

	bool is_empty(class sql_digest_storage *);

	void copy(class sql_digest_storage *, const class sql_digest_storage  *);


	/* size: 72, cachelines: 2, members: 6 */
	/* sum members: 61, holes: 2, sum holes: 11 */
	/* last cacheline: 8 bytes */
};
struct PSI_sp_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	class PSI_thread *         m_thread;             /*     8     8 */
	long long unsigned int     m_timer_start;        /*    16     8 */
	long long unsigned int     (*m_timer)(void);     /*    24     8 */
	PSI_sp_share *             m_sp_share;           /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* sum members: 36, holes: 1, sum holes: 4 */
	/* last cacheline: 40 bytes */
};
struct PSI_thread_info_v1 {
	PSI_thread_key *           m_key;                /*     0     8 */
	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */
	int                        m_volatility;         /*    20     4 */
	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
class THD : public MDL_context_owner, public Query_arena, public Open_tables_state {
	class Query_plan {
		const class THD *          thd;                  /*     0     8 */
		enum enum_sql_command      sql_command;          /*     8     4 */

		/* XXX 4 bytes hole, try to pack */

		class LEX *                lex;                  /*    16     8 */
		const class Modification_plan  * modification_plan; /*    24     8 */
		bool                       is_ps;                /*    32     1 */
		void Query_plan(class Query_plan *, const class Query_plan  &);

		class Query_plan & operator=(class Query_plan *, const class Query_plan  &);

	public:

		void assert_plan_is_locked_if_other(const class Query_plan  *);

		void Query_plan(class Query_plan *, class THD *);

		void set_query_plan(class Query_plan *, enum enum_sql_command, class LEX *, bool);

		enum enum_sql_command get_command(const class Query_plan  *);

		class LEX * get_lex(const class Query_plan  *);

		const class Modification_plan  * get_modification_plan(const class Query_plan  *);

		bool is_ps_query(const class Query_plan  *);

		bool is_single_table_plan(const class Query_plan  *);

		void set_modification_plan(class Query_plan *, class Modification_plan *);


		/* size: 40, cachelines: 1, members: 5 */
		/* sum members: 29, holes: 1, sum holes: 4 */
		/* padding: 7 */
		/* last cacheline: 40 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	enum binlog_filter_state {
		BINLOG_FILTER_UNKNOWN = 0,
		BINLOG_FILTER_CLEAR   = 1,
		BINLOG_FILTER_SET     = 2,
	};

	struct Transaction_state {
		void Transaction_state(class Transaction_state *);

		void ~Transaction_state(class Transaction_state *, int);

		void backup(class Transaction_state *, class THD *);

		void restore(class Transaction_state *, class THD *);

		enum enum_sql_command      m_sql_command;        /*     0     4 */

		/* XXX 4 bytes hole, try to pack */

		class Query_tables_list *  m_query_tables_list;  /*     8     8 */
		class Open_tables_backup  m_open_tables_state;   /*    16    96 */
		/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
		sql_mode_t                 m_sql_mode;           /*   112     8 */
		enum enum_tx_isolation     m_tx_isolation;       /*   120     4 */

		/* XXX 4 bytes hole, try to pack */

		/* --- cacheline 2 boundary (128 bytes) --- */
		class Prealloced_array<Ha_data, 15> m_ha_data;   /*   128  1088 */
		/* --- cacheline 19 boundary (1216 bytes) --- */
		class Transaction_ctx *    m_trx;                /*  1216     8 */
		bool                       m_tx_read_only;       /*  1224     1 */

		/* XXX 7 bytes hole, try to pack */

		ulonglong                  m_thd_option_bits;    /*  1232     8 */
		PSI_transaction_locker *   m_transaction_psi;    /*  1240     8 */
		uint                       m_server_status;      /*  1248     4 */
		bool                       m_in_lock_tables;     /*  1252     1 */
		bool                       m_time_zone_used;     /*  1253     1 */
		bool                       m_transaction_rollback_request; /*  1254     1 */

		/* size: 1256, cachelines: 20, members: 14 */
		/* sum members: 1240, holes: 3, sum holes: 15 */
		/* padding: 1 */
		/* last cacheline: 40 bytes */
	};

	enum enum_reset_lex {
		RESET_LEX        = 0,
		DO_NOT_RESET_LEX = 1,
	};

	enum Commit_error {
		CE_NONE                      = 0,
		CE_FLUSH_ERROR               = 1,
		CE_FLUSH_GNO_EXHAUSTED_ERROR = 2,
		CE_SYNC_ERROR                = 3,
		CE_COMMIT_ERROR              = 4,
		CE_ERROR_COUNT               = 5,
	};

	enum killed_state {
		NOT_KILLED      = 0,
		KILL_CONNECTION = 1053,
		KILL_QUERY      = 1317,
		KILL_TIMEOUT    = 3024,
		KILLED_NO_VALUE = 3025,
	};

	/* tag__fprintf: const_type tag not supported! */;

	union {
		bool                       bool_value;           /*     0     1 */
		long int                   long_value;           /*     0     8 */
		ulong                      ulong_value;          /*     0     8 */
		ulonglong                  ulonglong_value;      /*     0     8 */
		double                     double_value;         /*     0     8 */
	};

	struct {
		bool                       do_union;             /*     0     1 */
		bool                       unioned_events;       /*     1     1 */
		bool                       unioned_events_trans; /*     2     1 */

		/* XXX 5 bytes hole, try to pack */

		query_id_t                 first_query_id;       /*     8     8 */

		/* size: 16, cachelines: 1, members: 4 */
		/* sum members: 11, holes: 1, sum holes: 5 */
		/* last cacheline: 16 bytes */
	};

	enum enum_binlog_query_type {
		ROW_QUERY_TYPE   = 0,
		STMT_QUERY_TYPE  = 1,
		QUERY_TYPE_COUNT = 2,
	};

	enum Se_GTID_flag {
		SE_GTID_PIN              = 0,
		SE_GTID_CLEANUP          = 1,
		SE_GTID_PERSIST          = 2,
		SE_GTID_RESET_LOG        = 3,
		SE_GTID_PERSIST_EXPLICIT = 4,
		SE_GTID_MAX              = 5,
	} __attribute__((__packed__));

public:

	/* class MDL_context_owner   <ancestor>; */      /*     0     8 */
	/* class Query_arena         <ancestor>; */      /*     8    32 */
	/* class Open_tables_state   <ancestor>; */      /*    40    80 */
	void THD(class THD *, const class THD  &);

	bool is_stmt_prepare(const class THD  *);

	bool is_stmt_prepare_or_first_sp_execute(const class THD  *);

	bool is_stmt_prepare_or_first_stmt_execute(const class THD  *);

	bool is_regular(const class THD  *);

	class MDL_context         mdl_context;           /*   120   352 */

	/* XXX last struct has 4 bytes of padding */

	enum enum_mark_columns     mark_used_columns;    /*   472     4 */

	/* XXX 4 bytes hole, try to pack */

	ulong                      want_privilege;       /*   480     8 */
	class unique_ptr<LEX, std::default_delete<LEX> > main_lex; /*   488     8 */
	class LEX *                lex;                  /*   496     8 */
	class Dictionary_client * dd_client(const class THD  *);

	class unique_ptr<dd::cache::Dictionary_client, std::default_delete<dd::cache::Dictionary_client> > m_dd_client; /*   504     8 */
	LEX_CSTRING                m_query_string;       /*   512    16 */
	class String              m_normalized_query;    /*   528    32 */

	/* XXX last struct has 3 bytes of padding */

	struct atomic<bool>        m_safe_to_display __attribute__((__aligned__(1))); /*   560     1 */

	/* XXX 7 bytes hole, try to pack */

	LEX_CSTRING                m_catalog;            /*   568    16 */
	LEX_CSTRING                m_db;                 /*   584    16 */
	struct Resource_group_ctx  m_resource_group_ctx; /*   600    80 */
	class String              m_rewritten_query;     /*   680    32 */

	/* XXX last struct has 3 bytes of padding */

	class Relay_log_info *     rli_fake;             /*   712     8 */
	class Relay_log_info *     rli_slave;            /*   720     8 */
	bool                       tx_commit_pending;    /*   728     1 */

	/* XXX 7 bytes hole, try to pack */
	bool is_binlog_applier(const class THD  *);

	void rpl_detach_engine_ha_data(class THD *);

	void rpl_reattach_engine_ha_data(class THD *);

	bool is_engine_ha_data_detached(const class THD  *);

	void reset_for_next_command(class THD *);

	/* Bitfield combined with previous fields */

	static const const char  *        DEFAULT_WHERE; /*     0     0 */
	NET_SERVER                 m_net_server_extension; /*   736   112 */
	class THD_event_functions * scheduler;           /*   848     8 */
	class collation_unordered_map<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::unique_ptr<user_var_entry, void (*)(user_var_entry*)> > user_vars; /*   856    96 */
	struct rand_struct         rand;                 /*   952    32 */
	struct rand_struct         slog_rand;            /*   984    32 */
	struct System_variables    variables;            /*  1016  1008 */
	/* --- cacheline 31 boundary (1984 bytes) was 40 bytes ago --- */
	struct System_status_var   status_var;           /*  2024  1800 */
	/* --- cacheline 59 boundary (3776 bytes) was 48 bytes ago --- */
	class System_status_var *  initial_status_var;   /*  3824     8 */
	bool                       status_var_aggregated; /*  3832     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 60 boundary (3840 bytes) --- */
	class vector<char, std::allocator<char> > m_connection_attributes; /*  3840    24 */
	double                     m_current_query_cost; /*  3864     8 */
	ulonglong                  m_current_query_partial_plans; /*  3872     8 */
	void clear_current_query_costs(class THD *);

	void save_current_query_costs(class THD *);

	struct THR_LOCK_INFO       lock_info;            /*  3880    16 */
	struct mysql_mutex_t       LOCK_thd_data;        /*  3896    48 */
	/* --- cacheline 61 boundary (3904 bytes) was 40 bytes ago --- */
	struct mysql_mutex_t       LOCK_thd_query;       /*  3944    48 */
	/* --- cacheline 62 boundary (3968 bytes) was 24 bytes ago --- */
	struct mysql_mutex_t       LOCK_temporary_tables; /*  3992    48 */
	/* --- cacheline 63 boundary (4032 bytes) was 8 bytes ago --- */
	struct mysql_mutex_t       LOCK_thd_sysvar;      /*  4040    48 */
	struct mysql_mutex_t       LOCK_thd_protocol;    /*  4088    48 */
	/* --- cacheline 64 boundary (4096 bytes) was 40 bytes ago --- */
	struct mysql_mutex_t       LOCK_query_plan;      /*  4136    48 */
	void lock_query_plan(class THD *);

	void unlock_query_plan(class THD *);

	/* --- cacheline 65 boundary (4160 bytes) was 24 bytes ago --- */
	class Prepared_statement_map stmt_map;           /*  4184   168 */
	/* --- cacheline 68 boundary (4352 bytes) --- */
	const char  *              thread_stack;         /*  4352     8 */
	class Security_context    m_main_security_ctx;   /*  4360  1040 */
	/* --- cacheline 84 boundary (5376 bytes) was 24 bytes ago --- */
	class Security_context *   m_security_ctx;       /*  5400     8 */
	class Security_context * security_context(const class THD  *);

	void set_security_context(class THD *, class Security_context *);

	class List<Security_context> m_view_ctx_list;    /*  5408    24 */
	bool                       m_disable_password_validation; /*  5432     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 85 boundary (5440 bytes) --- */
	class unique_ptr<Protocol_text, std::default_delete<Protocol_text> > protocol_text; /*  5440     8 */
	class unique_ptr<Protocol_binary, std::default_delete<Protocol_binary> > protocol_binary; /*  5448     8 */
	const class Protocol  * get_protocol(const class THD  *);

	class Protocol * get_protocol(class THD *);

	SSL * get_ssl(const class THD  *);

	bool is_ssl(const class THD  *);

	const class Protocol_classic  * get_protocol_classic(const class THD  *);

	class Protocol_classic * get_protocol_classic(class THD *);

	class Protocol *           m_protocol;           /*  5456     8 */
	SSL *                      m_SSL;                /*  5464     8 */
	class Query_plan          query_plan;            /*  5472    40 */

	/* XXX last struct has 7 bytes of padding */
	const LEX_CSTRING  & catalog(const class THD  *);

	void set_catalog(class THD *, const LEX_CSTRING  &);


	/* --- cacheline 86 boundary (5504 bytes) was 8 bytes ago --- */
	PSI_stage_key              m_current_stage_key;  /*  5512     4 */

	/* XXX 4 bytes hole, try to pack */

	const char  *              m_proc_info;          /*  5520     8 */
	const char  * proc_info(const class THD  *, const class System_variables  &);

	void enter_stage(class THD *, const PSI_stage_info  *, PSI_stage_info *, const char  *, const char  *, unsigned int);

	const char  * proc_info(const class THD  *);

	const char  * proc_info_session(const class THD  *, class THD *);

	void set_proc_info(class THD *, const char  *);

	PSI_stage_key get_current_stage_key(const class THD  *);

	const char  *              where;                /*  5528     8 */
	ulong                      max_client_packet_length; /*  5536     8 */
	class collation_unordered_map<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::unique_ptr<TABLE_LIST, My_free_deleter> > handler_tables_hash; /*  5544    96 */
	/* --- cacheline 88 boundary (5632 bytes) was 8 bytes ago --- */
	class malloc_unordered_map<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, User_level_lock*, std::hash<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > >, std::equal_to<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> > > > ull_hash; /*  5640    64 */
	/* --- cacheline 89 boundary (5696 bytes) was 8 bytes ago --- */
	bool                       is_killable;          /*  5704     1 */

	/* XXX 7 bytes hole, try to pack */

	struct mysql_mutex_t       LOCK_current_cond;    /*  5712    48 */
	/* --- cacheline 90 boundary (5760 bytes) --- */
	struct atomic<mysql_mutex_t*> current_mutex;     /*  5760     8 */
	struct atomic<mysql_cond_t*> current_cond;       /*  5768     8 */
	struct mysql_cond_t        COND_thr_lock;        /*  5776    56 */
	/* --- cacheline 91 boundary (5824 bytes) was 8 bytes ago --- */
	enum enum_server_command   m_command;            /*  5832     4 */
	bool                       m_is_admin_conn;      /*  5836     1 */

	/* XXX 3 bytes hole, try to pack */
	void set_admin_connection(class THD *, bool);

	bool is_admin_connection(const class THD  *);


	uint32                     unmasked_server_id;   /*  5840     4 */
	uint32                     server_id;            /*  5844     4 */
	uint32                     file_id;              /*  5848     4 */
	uint16                     peer_port;            /*  5852     2 */

	/* XXX 2 bytes hole, try to pack */

	struct timeval             start_time;           /*  5856    16 */
	struct timeval             user_time;            /*  5872    16 */
	/* --- cacheline 92 boundary (5888 bytes) --- */
	ulonglong                  start_utime;          /*  5888     8 */
	ulonglong                  utime_after_lock;     /*  5896     8 */
	ulonglong                  utime_after_query;    /*  5904     8 */
	enum thr_lock_type         update_lock_default;  /*  5912     4 */
	enum thr_lock_type         insert_lock_default;  /*  5916     4 */
	ulonglong                  bytes_sent_old;       /*  5920     8 */
	ulong                      tmp_tables_used;      /*  5928     8 */
	ulong                      tmp_tables_disk_used; /*  5936     8 */
	ulonglong                  tmp_tables_size;      /*  5944     8 */
	/* --- cacheline 93 boundary (5952 bytes) --- */
	ulonglong                  innodb_trx_id;        /*  5952     8 */
	ulong                      innodb_io_reads;      /*  5960     8 */
	ulonglong                  innodb_io_read;       /*  5968     8 */
	uint64_t                   innodb_io_reads_wait_timer; /*  5976     8 */
	uint64_t                   innodb_lock_que_wait_timer; /*  5984     8 */
	uint64_t                   innodb_innodb_que_wait_timer; /*  5992     8 */
	bool                       innodb_was_used;      /*  6000     1 */

	/* XXX 7 bytes hole, try to pack */

	class Bloom_filter        approx_distinct_pages; /*  6008    56 */
	/* --- cacheline 94 boundary (6016 bytes) was 48 bytes ago --- */
	ulong                      innodb_page_access;   /*  6064     8 */
	void mark_innodb_used(class THD *, ulonglong);

	void access_distinct_page(class THD *, ulong);

	bool innodb_slow_log_enabled(const class THD  *);

	bool innodb_slow_log_data_logged(const class THD  *);

	ulong                      query_plan_flags;     /*  6072     8 */
	/* --- cacheline 95 boundary (6080 bytes) --- */
	ulong                      query_plan_fsort_passes; /*  6080     8 */
	uint                       last_errno;           /*  6088     4 */
	void set_slow_log_for_admin_command(class THD *);

	void clear_slow_extended(class THD *);

	void reset_sub_statement_state_slow_extended(class THD *, class Sub_statement_state *);

	void restore_sub_statement_state_slow_extended(class THD *, const class Sub_statement_state  &);

	uint                       in_sub_stmt;          /*  6092     4 */
	bool                       skip_wait_timeout;    /*  6096     1 */

	/* XXX 3 bytes hole, try to pack */
	ulong get_wait_timeout(const class THD  *);


	uint                       fill_status_recursion_level; /*  6100     4 */
	uint                       fill_variables_recursion_level; /*  6104     4 */

	/* XXX 4 bytes hole, try to pack */

	class Prealloced_array<Ha_data, 15> ha_data;     /*  6112  1088 */
	class Ha_data * get_ha_data(class THD *, int);

	void backup_ha_data(class THD *, class Prealloced_array<Ha_data, 15> *);

	void restore_ha_data(class THD *, const class Prealloced_array<Ha_data, 15>  &);

	/* --- cacheline 112 boundary (7168 bytes) was 32 bytes ago --- */
	bool                       order_deterministic;  /*  7200     1 */

	/* XXX 7 bytes hole, try to pack */

	struct rpl_event_coordinates binlog_next_event_pos; /*  7208    16 */
	void set_next_event_pos(class THD *, const char  *, ulonglong);

	void clear_next_event_pos(class THD *);

	uchar *                    binlog_row_event_extra_data; /*  7224     8 */
	int binlog_setup_trx_data(class THD *);

	int binlog_write_table_map(class THD *, class TABLE *, bool, bool);

	int binlog_write_row(class THD *, class TABLE *, bool, const uchar  *, const unsigned char  *);

	int binlog_delete_row(class THD *, class TABLE *, bool, const uchar  *, const unsigned char  *);

	int binlog_update_row(class THD *, class TABLE *, bool, const uchar  *, const uchar  *, const uchar  *);

	void set_server_id(class THD *, uint32);

	class Rows_log_event * binlog_get_pending_rows_event(const class THD  *, bool);

	int binlog_flush_pending_rows_event(class THD *, bool);

	int binlog_flush_pending_rows_event(class THD *, bool, bool);

	int is_current_stmt_binlog_format_row(const class THD  *);

	bool is_current_stmt_binlog_disabled(const class THD  *);

	bool is_current_stmt_binlog_log_replica_updates_disabled(const class THD  *);

	bool is_current_stmt_binlog_row_enabled_with_write_set_extraction(const class THD  *);

	bool optimizer_switch_flag(const class THD  *, ulonglong);

	void reset_binlog_local_stmt_filter(class THD *);

	void clear_binlog_local_stmt_filter(class THD *);

	void set_binlog_local_stmt_filter(class THD *);

	enum binlog_filter_state get_binlog_local_stmt_filter(const class THD  *);

	/* --- cacheline 113 boundary (7232 bytes) --- */
	class THD_timer_info *     timer;                /*  7232     8 */
	class THD_timer_info *     timer_cache;          /*  7240     8 */
	bool                       skip_readonly_check;  /*  7248     1 */

	/* XXX 3 bytes hole, try to pack */

	enum binlog_filter_state   m_binlog_filter_state; /*  7252     4 */
	enum enum_binlog_format    current_stmt_binlog_format; /*  7256     4 */
	uint32                     binlog_unsafe_warning_flags; /*  7260     4 */
	uint                       binlog_table_maps;    /*  7264     4 */

	/* XXX 4 bytes hole, try to pack */

	class List<char> *         binlog_accessed_db_names; /*  7272     8 */
	const char  *              m_trans_log_file;     /*  7280     8 */
	char *                     m_trans_fixed_log_file; /*  7288     8 */
	/* --- cacheline 114 boundary (7296 bytes) --- */
	my_off_t                   m_trans_end_pos;      /*  7296     8 */
	NET                        net;                  /*  7304   664 */
	/* --- cacheline 124 boundary (7936 bytes) was 32 bytes ago --- */
	class String              packet;                /*  7968    32 */

	/* XXX last struct has 3 bytes of padding */
	void set_skip_readonly_check(class THD *);

	bool is_cmd_skip_readonly(const class THD  *);

	void reset_skip_readonly_check(class THD *);

	void issue_unsafe_warnings(class THD *);

	uint get_binlog_table_maps(const class THD  *);

	void clear_binlog_table_maps(class THD *);

	class List<char> * get_binlog_accessed_db_names(const class THD  *);

	void add_to_binlog_accessed_dbs(class THD *, const char  *);


	/* --- cacheline 125 boundary (8000 bytes) --- */
	class unique_ptr<Transaction_ctx, std::default_delete<Transaction_ctx> > m_transaction; /*  8000     8 */
	class Attachable_trx {
	public:

		int ()(void) * *           _vptr.Attachable_trx; /*     0     8 */
		void Attachable_trx(class Attachable_trx *, class THD *, class Attachable_trx *);

		virtual void ~Attachable_trx(class Attachable_trx *, int);

		class Attachable_trx * get_prev_attachable_trx(const class Attachable_trx  *);

		virtual bool is_read_only(const class Attachable_trx  *);

	protected:

		class THD *                m_thd;                /*     8     8 */
		enum enum_reset_lex        m_reset_lex;          /*    16     4 */

		/* XXX 4 bytes hole, try to pack */

		class Attachable_trx *     m_prev_attachable_trx; /*    24     8 */
		struct Transaction_state   m_trx_state;          /*    32  1256 */

		/* XXX last struct has 1 byte of padding */
		void Attachable_trx(class Attachable_trx *, const class Attachable_trx  &);

		class Attachable_trx & operator=(class Attachable_trx *, const class Attachable_trx  &);

		/* vtable has 1 entries: {
		   [2] = is_read_only((null)), 
		} */
		/* size: 1288, cachelines: 21, members: 5 */
		/* sum members: 1284, holes: 1, sum holes: 4 */
		/* paddings: 1, sum paddings: 1 */
		/* last cacheline: 8 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	class Attachable_trx *     m_attachable_trx;     /*  8008     8 */
	class Transaction_ctx * get_transaction(class THD *);

	const class Transaction_ctx  * get_transaction(const class THD  *);

	void set_transaction(class THD *, class Transaction_ctx *);

	class Global_read_lock    global_read_lock;      /*  8016    24 */
	class Global_backup_lock  backup_tables_lock;    /*  8040    16 */
	class Vio *                active_vio;           /*  8056     8 */
	/* --- cacheline 126 boundary (8064 bytes) --- */
	class Vio *                clone_vio;            /*  8064     8 */
	Item_change_list           change_list;          /*  8072    24 */
	class Query_arena *        stmt_arena;           /*  8096     8 */
	table_map                  table_map_for_update; /*  8104     8 */
	bool                       arg_of_last_insert_id_function; /*  8112     1 */

	/* XXX 7 bytes hole, try to pack */

	ulonglong                  first_successful_insert_id_in_prev_stmt; /*  8120     8 */
	/* --- cacheline 127 boundary (8128 bytes) --- */
	ulonglong                  first_successful_insert_id_in_prev_stmt_for_binlog; /*  8128     8 */
	ulonglong                  first_successful_insert_id_in_cur_stmt; /*  8136     8 */
	bool                       stmt_depends_on_first_successful_insert_id_in_prev_stmt; /*  8144     1 */

	/* XXX 7 bytes hole, try to pack */

	class Discrete_intervals_list auto_inc_intervals_in_cur_stmt_for_binlog; /*  8152    64 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 128 boundary (8192 bytes) was 24 bytes ago --- */
	class Discrete_intervals_list auto_inc_intervals_forced; /*  8216    64 */

	/* XXX last struct has 4 bytes of padding */
	void record_first_successful_insert_id_in_cur_stmt(class THD *, ulonglong);

	ulonglong read_first_successful_insert_id_in_prev_stmt(class THD *);

	void reset_first_successful_insert_id(class THD *);

	void force_one_auto_inc_interval(class THD *, ulonglong);


	/* --- cacheline 129 boundary (8256 bytes) was 24 bytes ago --- */
	ulonglong                  previous_found_rows;  /*  8280     8 */
	ulonglong                  current_found_rows;   /*  8288     8 */
	bool                       is_operating_gtid_table_implicitly; /*  8296     1 */
	bool                       is_operating_substatement_implicitly; /*  8297     1 */

	/* XXX 6 bytes hole, try to pack */

	longlong                   m_row_count_func;     /*  8304     8 */
	longlong get_row_count_func(const class THD  *);

	void set_row_count_func(class THD *, longlong);

	ha_rows                    num_truncated_fields; /*  8312     8 */
	/* --- cacheline 130 boundary (8320 bytes) --- */
	ha_rows                    m_sent_row_count;     /*  8320     8 */
	ha_rows                    m_examined_row_count; /*  8328     8 */
	USER_CONN *                m_user_connect;       /*  8336     8 */
	void set_user_connect(class THD *, USER_CONN *);

	const USER_CONN  * get_user_connect(const class THD  *);

	void increment_user_connections_counter(class THD *);

	void decrement_user_connections_counter(class THD *);

	void increment_con_per_hour_counter(class THD *);

	void increment_updates_counter(class THD *);

	void increment_questions_counter(class THD *);

	void time_out_user_resource_limits(class THD *);

	ha_rows get_sent_row_count(const class THD  *);

	ha_rows get_examined_row_count(const class THD  *);

	void set_sent_row_count(class THD *, ha_rows);

	void inc_sent_row_count(class THD *, ha_rows);

	void inc_examined_row_count(class THD *, ha_rows);

	void inc_status_created_tmp_disk_tables(class THD *);

	void inc_status_created_tmp_tables(class THD *);

	void inc_status_select_full_join(class THD *);

	void inc_status_select_full_range_join(class THD *);

	void inc_status_select_range(class THD *);

	void inc_status_select_range_check(class THD *);

	void inc_status_select_scan(class THD *);

	void inc_status_sort_merge_passes(class THD *);

	void inc_status_sort_range(class THD *);

	void inc_status_sort_rows(class THD *, ha_rows);

	void inc_status_sort_scan(class THD *);

	void set_status_no_index_used(class THD *);

	void set_status_no_good_index_used(class THD *);

	const class CHARSET_INFO  * db_charset;          /*  8344     8 */
	class unique_ptr<PROFILING, std::default_delete<PROFILING> > profiling; /*  8352     8 */
	PSI_stage_progress *       m_stage_progress_psi; /*  8360     8 */
	sql_digest_state *         m_digest;             /*  8368     8 */
	unsigned char *            m_token_array;        /*  8376     8 */
	/* --- cacheline 131 boundary (8384 bytes) --- */
	sql_digest_state           m_digest_state;       /*  8384    80 */
	/* --- cacheline 132 boundary (8448 bytes) was 16 bytes ago --- */
	PSI_statement_locker *     m_statement_psi;      /*  8464     8 */
	PSI_statement_locker_state m_statement_state;    /*  8472   400 */
	/* --- cacheline 138 boundary (8832 bytes) was 40 bytes ago --- */
	PSI_transaction_locker *   m_transaction_psi;    /*  8872     8 */
	PSI_transaction_locker_state m_transaction_state; /*  8880    88 */
	/* --- cacheline 140 boundary (8960 bytes) was 8 bytes ago --- */
	PSI_idle_locker *          m_idle_psi;           /*  8968     8 */
	PSI_idle_locker_state      m_idle_state;         /*  8976    40 */
	bool                       m_server_idle;        /*  9016     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 141 boundary (9024 bytes) --- */
	query_id_t                 query_id;             /*  9024     8 */
	ulong                      statement_id_counter; /*  9032     8 */
	ulong                      rand_saved_seed1;     /*  9040     8 */
	ulong                      rand_saved_seed2;     /*  9048     8 */
	my_thread_t                real_id;              /*  9056     8 */
	my_thread_id               m_thread_id;          /*  9064     4 */
	void set_new_thread_id(class THD *);

	my_thread_id thread_id(const class THD  *);

	uint                       tmp_table;            /*  9068     4 */
	uint                       server_status;        /*  9072     4 */
	uint                       open_options;         /*  9076     4 */
	enum enum_thread_type      system_thread;        /*  9080     4 */
	bool is_system_thread(const class THD  *);

	bool is_dd_system_thread(const class THD  *);

	bool is_initialize_system_thread(const class THD  *);

	bool is_init_file_system_thread(const class THD  *);

	bool is_bootstrap_system_thread(const class THD  *);

	bool is_server_upgrade_thread(const class THD  *);

	enum enum_tx_isolation     tx_isolation;         /*  9084     4 */
	/* --- cacheline 142 boundary (9088 bytes) --- */
	bool                       tx_read_only;         /*  9088     1 */

	/* XXX 3 bytes hole, try to pack */

	int                        tx_priority;          /*  9092     4 */
	int                        thd_tx_priority;      /*  9096     4 */
	enum enum_check_fields     check_for_truncated_fields; /*  9100     4 */
	ha_rows                    updated_row_count;    /*  9104     8 */
	ha_rows                    sent_row_count_2;     /*  9112     8 */
	class Prealloced_array<Binlog_user_var_event*, 2> user_var_events; /*  9120    32 */
	/* --- cacheline 143 boundary (9152 bytes) --- */
	class MEM_ROOT *           user_var_events_alloc; /*  9152     8 */
	class THD *                next_to_commit;       /*  9160     8 */
	bool                       binlog_need_explicit_defaults_ts; /*  9168     1 */

	/* XXX 3 bytes hole, try to pack */
	void set_trans_pos(class THD *, const char  *, my_off_t);

	void get_trans_pos(const class THD  *, const char  * *, my_off_t *);

	void get_trans_fixed_pos(const class THD  *, const char  * *, my_off_t *);


	enum Commit_error          commit_error;         /*  9172     4 */
	enum durability_properties durability_property;  /*  9176     4 */
	struct atomic<THD::killed_state> killed __attribute__((__aligned__(4))); /*  9180     4 */
	bool                       running_explain_analyze; /*  9184     1 */

	/* XXX 7 bytes hole, try to pack */

	class DD_kill_immunizer *  kill_immunizer;       /*  9192     8 */
	char                       scramble[21];         /*  9200    21 */
	/* --- cacheline 144 boundary (9216 bytes) was 5 bytes ago --- */
	bool                       slave_thread;         /*  9221     1 */
	uchar                      password;             /*  9222     1 */
	bool                       m_is_fatal_error;     /*  9223     1 */
	bool                       transaction_rollback_request; /*  9224     1 */
	bool                       is_fatal_sub_stmt_error; /*  9225     1 */
	bool                       query_start_usec_used; /*  9226     1 */
	bool                       rand_used;            /*  9227     1 */
	bool                       time_zone_used;       /*  9228     1 */
	bool                       in_lock_tables;       /*  9229     1 */
	bool                       is_slave_error;       /*  9230     1 */
	bool                       thread_specific_used; /*  9231     1 */
	bool                       charset_is_system_charset; /*  9232     1 */
	bool                       charset_is_collation_connection; /*  9233     1 */
	bool                       charset_is_character_set_filesystem; /*  9234     1 */
	bool                       enable_slow_log;      /*  9235     1 */
	bool                       derived_tables_processing; /*  9236     1 */
	bool                       parsing_system_view;  /*  9237     1 */

	/* XXX 2 bytes hole, try to pack */

	class sp_rcontext *        sp_runtime_ctx;       /*  9240     8 */
	class sp_cache *           sp_proc_cache;        /*  9248     8 */
	class sp_cache *           sp_func_cache;        /*  9256     8 */
	uint                       query_name_consts;    /*  9264     4 */

	/* XXX 4 bytes hole, try to pack */

	class LOG_INFO *           current_linfo;        /*  9272     8 */
	/* --- cacheline 145 boundary (9280 bytes) --- */
	ulonglong                  current_connect_time; /*  9280     8 */
	ulonglong                  last_global_update_time; /*  9288     8 */
	double                     busy_time;            /*  9296     8 */
	double                     diff_total_busy_time; /*  9304     8 */
	double                     cpu_time;             /*  9312     8 */
	double                     diff_total_cpu_time;  /*  9320     8 */
	ulonglong                  bytes_received;       /*  9328     8 */
	ulonglong                  diff_total_bytes_received; /*  9336     8 */
	/* --- cacheline 146 boundary (9344 bytes) --- */
	ulonglong                  bytes_sent;           /*  9344     8 */
	ulonglong                  diff_total_bytes_sent; /*  9352     8 */
	ulonglong                  binlog_bytes_written; /*  9360     8 */
	ulonglong                  diff_total_binlog_bytes_written; /*  9368     8 */
	ha_rows                    diff_total_sent_rows; /*  9376     8 */
	ha_rows                    diff_total_updated_rows; /*  9384     8 */
	ha_rows                    diff_total_read_rows; /*  9392     8 */
	ulonglong                  diff_select_commands; /*  9400     8 */
	/* --- cacheline 147 boundary (9408 bytes) --- */
	ulonglong                  diff_update_commands; /*  9408     8 */
	ulonglong                  diff_other_commands;  /*  9416     8 */
	ulonglong                  diff_commit_trans;    /*  9424     8 */
	ulonglong                  diff_rollback_trans;  /*  9432     8 */
	ulonglong                  diff_denied_connections; /*  9440     8 */
	ulonglong                  diff_lost_connections; /*  9448     8 */
	ulonglong                  diff_access_denied_errors; /*  9456     8 */
	ulonglong                  diff_empty_queries;   /*  9464     8 */
	/* --- cacheline 148 boundary (9472 bytes) --- */
	ulonglong                  query_delay_millis;   /*  9472     8 */
	union {
		bool               bool_value;           /*  9480     1 */
		long int           long_value;           /*  9480     8 */
		ulong              ulong_value;          /*  9480     8 */
		ulonglong          ulonglong_value;      /*  9480     8 */
		double             double_value;         /*  9480     8 */
	} sys_var_tmp;                                   /*  9480     8 */
	struct {
		bool               do_union;             /*  9488     1 */
		bool               unioned_events;       /*  9489     1 */
		bool               unioned_events_trans; /*  9490     1 */

		/* XXX 5 bytes hole, try to pack */

		query_id_t         first_query_id;       /*  9496     8 */
	} binlog_evt_union;                              /*  9488    16 */
	class Parser_state *       m_parser_state;       /*  9504     8 */
	class Locked_tables_list  locked_tables_list;    /*  9512   136 */
	/* --- cacheline 150 boundary (9600 bytes) was 48 bytes ago --- */
	class partition_info *     work_part_info;       /*  9648     8 */
	class Plugin_array        audit_class_plugins;   /*  9656    32 */
	/* --- cacheline 151 boundary (9664 bytes) was 24 bytes ago --- */
	class Prealloced_array<long unsigned int, 11> audit_class_mask; /*  9688    96 */
	/* --- cacheline 152 boundary (9728 bytes) was 56 bytes ago --- */
	bool                       m_enable_plugins;     /*  9784     1 */
	bool                       m_audited;            /*  9785     1 */
	void THD(class THD *, bool);

	virtual void ~THD(class THD *, int);

	void release_resources(class THD *);

	bool release_resources_done(const class THD  *);

	bool                       m_release_resources_done; /*  9786     1 */
	bool                       cleanup_done;         /*  9787     1 */

	/* XXX 4 bytes hole, try to pack */
	void cleanup(class THD *);

	void init(class THD *);

	void init_query_mem_roots(class THD *);

	void cleanup_connection(class THD *);

	void reset_stats(class THD *);

	void reset_diff_stats(class THD *);

	void update_stats(class THD *, bool);

	void cleanup_after_query(class THD *);

	void store_globals(class THD *);

	void restore_globals(class THD *);

	void set_active_vio(class THD *, class Vio *);

	void set_ssl(class THD *, class Vio *);

	void clear_active_vio(class THD *);

	void set_clone_vio(class THD *, class Vio *);

	void clear_clone_vio(class THD *);

	bool check_clone_vio(class THD *);

	void shutdown_clone_vio(class THD *);

	enum enum_vio_type get_vio_type(const class THD  *);

	void shutdown_active_vio(class THD *);

	void awake(class THD *, enum killed_state);

	void disconnect(class THD *, bool);

	int binlog_query(class THD *, enum enum_binlog_query_type, const char  *, size_t, bool, bool, bool, int);

	virtual void enter_cond(class THD *, class mysql_cond_t *, class mysql_mutex_t *, const PSI_stage_info  *, PSI_stage_info *, const char  *, const char  *, int);

	virtual void exit_cond(class THD *, const PSI_stage_info  *, const char  *, const char  *, int);

	virtual int is_killed(const class THD  *);

	virtual bool might_have_commit_order_waiters(const class THD  *);

	virtual class THD * get_thd(class THD *);

	virtual void notify_shared_lock(class THD *, class MDL_context_owner *, bool);

	virtual bool notify_hton_pre_acquire_exclusive(class THD *, const class MDL_key  *, bool *);

	virtual void notify_hton_post_release_exclusive(class THD *, const class MDL_key  *);

	virtual uint get_rand_seed(const class THD  *);

	bool is_strict_mode(const class THD  *);

	const class CHARSET_INFO  * collation(class THD *);

	class Time_zone * time_zone(class THD *);

	time_t query_start_in_secs(const class THD  *);

	ulonglong query_start_in_usecs(const class THD  *);

	class timeval query_start_timeval_trunc(class THD *, uint);

	void set_time(class THD *);

	void set_time(class THD *, const class timeval  *);

	void get_time(const class THD  *, class QUERY_START_TIME_INFO *);

	void set_time(class THD *, const class QUERY_START_TIME_INFO  &);

	void set_time_after_lock(class THD *);

	bool is_fsp_truncate_mode(const class THD  *);

	ulonglong current_utime(void);

	void update_slow_query_status(class THD *);

	ulonglong found_rows(const class THD  *);

	void update_previous_found_rows(class THD *);

	bool in_multi_stmt_transaction_mode(const class THD  *);

	bool in_active_multi_stmt_transaction(const class THD  *);

	bool fill_information_schema_tables(const class THD  *);

	bool convert_string(class THD *, LEX_STRING *, const class CHARSET_INFO  *, const char  *, size_t, const class CHARSET_INFO  *, bool);

	int send_explain_fields(class THD *, class Query_result *);

	void clear_error(class THD *);

	bool is_classic_protocol(const class THD  *);

	virtual bool is_connected(class THD *);

	void fatal_error(class THD *);

	bool is_fatal_error(const class THD  *);

	bool is_error(const class THD  *);

	class Diagnostics_area * get_stmt_da(class THD *);

	const class Diagnostics_area  * get_stmt_da(const class THD  *);

	const class Diagnostics_area  * get_stacked_da(const class THD  *);

	class Diagnostics_area * get_parser_da(class THD *);

	class Diagnostics_area * get_query_rewrite_plugin_da(class THD *);

	void push_diagnostics_area(class THD *, class Diagnostics_area *, bool);

	void pop_diagnostics_area(class THD *);

	void push_protocol(class THD *, class Protocol *);

	void pop_protocol(class THD *);

	const class CHARSET_INFO  * charset(const class THD  *);

	void update_charset(class THD *);

	void change_item_tree(class THD *, class Item * *, class Item *);

	void nocheck_register_item_tree_change(class THD *, class Item * *, class Item *);

	void rollback_item_tree_changes(class THD *);

	void end_statement(class THD *);

	void send_kill_message(const class THD  *);

	void reset_n_backup_open_tables_state(class THD *, class Open_tables_backup *, uint);

	void restore_backup_open_tables_state(class THD *, class Open_tables_backup *);

	void reset_sub_statement_state(class THD *, class Sub_statement_state *, uint);

	void restore_sub_statement_state(class THD *, class Sub_statement_state *);

	void begin_attachable_ro_transaction(class THD *);

	void begin_attachable_rw_transaction(class THD *);

	void end_attachable_transaction(class THD *);

	bool is_attachable_ro_transaction_active(const class THD  *);

	bool is_attachable_transaction_active(const class THD  *);

	bool is_attachable_rw_transaction_active(const class THD  *);

	void set_current_stmt_binlog_format_row_if_mixed(class THD *);

	void set_current_stmt_binlog_format_row(class THD *);

	void clear_current_stmt_binlog_format_row(class THD *);

	void reset_current_stmt_binlog_format_row(class THD *);

	void set_original_commit_timestamp_for_slave_thread(class THD *);

	class Gtid_set * get_gtid_next_list(class THD *);

	const class Gtid_set  * get_gtid_next_list_const(const class THD  *);

	bool is_binlog_cache_empty(const class THD  *, bool);


	/* --- cacheline 153 boundary (9792 bytes) --- */
	struct Gtid                owned_gtid;           /*  9792    16 */

	/* Bitfield combined with previous fields */

	static const int                  OWNED_SIDNO_GTID_SET = 18446744073709551615; /*     0     0 */
	static const int                  OWNED_SIDNO_ANONYMOUS = 18446744073709551614; /*     0     0 */
	rpl_sid                    owned_sid;            /*  9808    16 */
	typedef struct bitset<5> Se_GTID_flagset;

	Se_GTID_flagset            m_se_gtid_flags;      /*  9824     8 */
	void pin_gtid(class THD *);

	void unpin_gtid(class THD *);

	bool is_one_phase_commit(class THD *);

	void set_log_reset(class THD *);

	void clear_log_reset(class THD *);

	bool is_log_reset(const class THD  *);

	void set_gtid_persisted_by_se(class THD *);

	void request_persist_gtid_by_se(class THD *);

	void reset_gtid_persisted_by_se(class THD *);

	bool se_persists_gtid(const class THD  *);

	bool se_persists_gtid_explicit(const class THD  *);

	bool is_extrenal_xa(const class THD  *);

	class Rpl_thd_context     rpl_thd_ctx;           /*  9832    88 */

	/* XXX last struct has 4 bytes of padding */
	void clear_owned_gtids(class THD *);

	bool owned_gtid_is_empty(class THD *);


	/* --- cacheline 155 boundary (9920 bytes) --- */
	bool                       skip_gtid_rollback;   /*  9920     1 */
	bool                       is_commit_in_middle_of_statement; /*  9921     1 */
	bool                       has_gtid_consistency_violation; /*  9922     1 */

	/* XXX 5 bytes hole, try to pack */
	const LEX_CSTRING  & db(const class THD  *);

	bool set_db(class THD *, const LEX_CSTRING  &);

	void reset_db(class THD *, const LEX_CSTRING  &);

	bool copy_db_to(const class THD  *, const char  * *, size_t *);

	bool copy_db_to(const class THD  *, char * *, size_t *);


	class thd_scheduler       event_scheduler;       /*  9928     8 */
	class Resource_group_ctx * resource_group_ctx(class THD *);

	void set_psi(class THD *, PSI_thread *);

	PSI_thread * get_psi(const class THD  *);

	struct atomic<PSI_thread*> m_psi;                /*  9936     8 */
	const class Internal_error_handler  * get_internal_handler(const class THD  *);

	void push_internal_handler(class THD *, class Internal_error_handler *);

	bool handle_condition(class THD *, uint, const char  *, enum enum_severity_level *, const char  *);

	class Internal_error_handler * pop_internal_handler(class THD *);

	class Opt_trace_context   opt_trace;             /*  9944    16 */

	/* XXX last struct has 4 bytes of padding */
	void raise_error(class THD *, uint);

	void raise_error_printf(class THD *, uint, ...);

	void raise_warning(class THD *, uint);

	void raise_warning_printf(class THD *, uint, ...);

	void raise_note(class THD *, uint);

	void raise_note_printf(class THD *, uint, ...);

	class Sql_condition * raise_condition(class THD *, uint, const char  *, enum enum_severity_level, const char  *, bool);

	void set_command(class THD *, enum enum_server_command);

	enum enum_server_command get_command(const class THD  *);

	void debug_assert_query_locked(const class THD  *);

	const LEX_CSTRING  & query(const class THD  *);

	const class String  normalized_query(class THD *);

	void set_query_for_display(class THD *, const char  *, size_t);

	void reset_query_for_display(class THD *);

	bool safe_to_display(const class THD  *);

	void set_safe_display(class THD *, bool);

	void set_query(class THD *, const char  *, size_t);

	void set_query(class THD *, LEX_CSTRING);

	void reset_query(class THD *);

	void swap_rewritten_query(class THD *, class String &);

	const class String  & rewritten_query(const class THD  *);

	void reset_rewritten_query(class THD *);

	void set_query_id(class THD *, query_id_t);

	void set_open_tables(class THD *, class TABLE *);

	void set_is_killable(class THD *, bool);

	void enter_locked_tables_mode(class THD *, enum enum_locked_tables_mode);

	void leave_locked_tables_mode(class THD *);

	int decide_logging_format(class THD *, class TABLE_LIST *);

	bool is_dml_gtid_compatible(class THD *, bool, bool, bool);

	bool is_ddl_gtid_compatible(class THD *);

	void binlog_invoker(class THD *);

	bool need_binlog_invoker(const class THD  *);

	void get_definer(class THD *, class LEX_USER *);

	void set_invoker(class THD *, const LEX_STRING  *, const LEX_STRING  *);

	LEX_CSTRING get_invoker_user(const class THD  *);

	LEX_CSTRING get_invoker_host(const class THD  *);

	bool has_invoker(const class THD  *);

	void mark_transaction_to_rollback(class THD *, bool);


	class Internal_error_handler * m_internal_handler; /*  9960     8 */
	struct MEM_ROOT            main_mem_root;        /*  9968    80 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 157 boundary (10048 bytes) --- */
	class Diagnostics_area    main_da;               /* 10048   736 */
	/* --- cacheline 168 boundary (10752 bytes) was 32 bytes ago --- */
	class Diagnostics_area    m_parser_da;           /* 10784   736 */
	/* --- cacheline 180 boundary (11520 bytes) --- */
	class Diagnostics_area    m_query_rewrite_plugin_da; /* 11520   736 */
	/* --- cacheline 191 boundary (12224 bytes) was 32 bytes ago --- */
	class Diagnostics_area *   m_query_rewrite_plugin_da_ptr; /* 12256     8 */
	class Diagnostics_area *   m_stmt_da;            /* 12264     8 */
	bool                       m_binlog_invoker;     /* 12272     1 */

	/* XXX 7 bytes hole, try to pack */

	LEX_CSTRING                m_invoker_user;       /* 12280    16 */
	/* --- cacheline 192 boundary (12288 bytes) was 8 bytes ago --- */
	LEX_CSTRING                m_invoker_host;       /* 12296    16 */
	class Cost_model_server   m_cost_model;          /* 12312     0 */

	/* XXX 24 bytes hole, try to pack */
	void init_cost_model(class THD *);

	const class Cost_model_server  * cost_model(const class THD  *);


	class Session_tracker     session_tracker;       /* 12336    40 */
	/* --- cacheline 193 boundary (12352 bytes) was 24 bytes ago --- */
	class Session_sysvar_resource_manager session_sysvar_res_mgr; /* 12376    64 */
	void syntax_error(class THD *);

	void syntax_error(class THD *, const char  *, ...);

	void syntax_error(class THD *, int, ...);

	void syntax_error_at(class THD *, const class YYLTYPE  &);

	void syntax_error_at(class THD *, const class YYLTYPE  &, const char  *, ...);

	void syntax_error_at(class THD *, const class YYLTYPE  &, int, ...);

	void vsyntax_error_at(class THD *, const class YYLTYPE  &, const char  *, class typedef __va_list_tag __va_list_tag *);

	void vsyntax_error_at(class THD *, const char  *, const char  *, class typedef __va_list_tag __va_list_tag *);

	bool send_result_metadata(class THD *, const class mem_root_deque<Item*>  &, uint);

	bool send_result_set_row(class THD *, const class mem_root_deque<Item*>  &);

	void send_statement_status(class THD *);

	/* --- cacheline 194 boundary (12416 bytes) was 24 bytes ago --- */
	bool                       duplicate_slave_id;   /* 12440     1 */
	void claim_memory_ownership(class THD *, bool);

	bool is_a_srv_session(const class THD  *);

	void mark_as_srv_session(class THD *);

	const class st_plugin_int  * get_plugin(const class THD  *);

	void set_plugin(class THD *, const class st_plugin_int  *);

	bool is_plugin_fake_ddl(const class THD  *);

	void mark_plugin_fake_ddl(class THD *, bool);

	bool                       is_a_srv_session_thd; /* 12441     1 */

	/* XXX 6 bytes hole, try to pack */

	const class st_plugin_int  * m_plugin;           /* 12448     8 */
	bool                       m_is_plugin_fake_ddl; /* 12456     1 */
	bool                       waiting_for_disk_space; /* 12457     1 */

	/* XXX 2 bytes hole, try to pack */
	void set_waiting_for_disk_space(class THD *, bool);

	bool is_waiting_for_disk_space(const class THD  *);

	bool sql_parser(class THD *);

	void set_secondary_engine_optimization(class THD *, enum Secondary_engine_optimization);

	enum Secondary_engine_optimization secondary_engine_optimization(const class THD  *);

	bool is_secondary_storage_engine_eligible(const class THD  *);


	enum Secondary_engine_optimization m_secondary_engine_optimization; /* 12460     4 */
	void cleanup_after_parse_error(class THD *);

	struct atomic<bool>        m_is_system_user __attribute__((__aligned__(1))); /* 12464     1 */

	/* XXX 7 bytes hole, try to pack */
	bool is_system_user(class THD *);

	void set_system_user(class THD *, bool);


	class Transactional_ddl_context m_transactional_ddl; /* 12472    80 */
	/* --- cacheline 196 boundary (12544 bytes) was 8 bytes ago --- */
	bool                       m_inside_system_variable_global_update; /* 12552     1 */

	/* XXX 7 bytes hole, try to pack */

	class PS_PARAM *           bind_parameter_values; /* 12560     8 */
	long unsigned int          bind_parameter_values_count; /* 12568     8 */
	void copy_table_access_properties(class THD *, class THD *);

	class Attachable_trx_rw : public Attachable_trx {
	public:

		/* class Attachable_trx      <ancestor>; */      /*     0  1288 */
		virtual bool is_read_only(const class Attachable_trx_rw  *);

		void Attachable_trx_rw(class Attachable_trx_rw *, class THD *);

		void Attachable_trx_rw(class Attachable_trx_rw *, const class Attachable_trx_rw  &);

		class Attachable_trx_rw & operator=(class Attachable_trx_rw *, const class Attachable_trx_rw  &);

		virtual void ~Attachable_trx_rw(class Attachable_trx_rw *, int);

		/* vtable has 1 entries: {
		   [2] = is_read_only((null)), 
		} */
		/* size: 1288, cachelines: 21, members: 1 */
		/* last cacheline: 8 bytes */

		/* BRAIN FART ALERT! 1288 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 10304 bits */
	};

	/* tag__fprintf: const_type tag not supported! */;

	/* vtable has 10 entries: {
	   [2] = enter_cond((null)), 
	   [3] = exit_cond((null)), 
	   [4] = is_killed((null)), 
	   [6] = might_have_commit_order_waiters((null)), 
	   [7] = get_thd((null)), 
	   [8] = notify_shared_lock((null)), 
	   [9] = notify_hton_pre_acquire_exclusive((null)), 
	   [10] = notify_hton_post_release_exclusive((null)), 
	   [11] = get_rand_seed((null)), 
	   [5] = is_connected((null)), 
	} */
	/* size: 12576, cachelines: 197, members: 267, static members: 3 */
	/* sum members: 12272, holes: 32, sum holes: 184 */
	/* paddings: 10, sum paddings: 40 */
	/* forced alignments: 3 */
	/* last cacheline: 32 bytes */

	/* BRAIN FART ALERT! 12576 bytes != 12272 (member bytes) + 0 (member bits) + 184 (byte holes) + 0 (bit holes), diff = 960 bits */
} __attribute__((__aligned__(8)));
struct PSI_thread_attrs_v3 {
	long long unsigned int     m_thread_internal_id; /*     0     8 */
	long unsigned int          m_processlist_id;     /*     8     8 */
	long long unsigned int     m_thread_os_id;       /*    16     8 */
	void *                     m_user_data;          /*    24     8 */
	char                       m_username[96];       /*    32    96 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	size_t                     m_username_length;    /*   128     8 */
	char                       m_hostname[255];      /*   136   255 */

	/* XXX 1 byte hole, try to pack */

	/* --- cacheline 6 boundary (384 bytes) was 8 bytes ago --- */
	size_t                     m_hostname_length;    /*   392     8 */
	char                       m_groupname[192];     /*   400   192 */
	/* --- cacheline 9 boundary (576 bytes) was 16 bytes ago --- */
	size_t                     m_groupname_length;   /*   592     8 */
	struct sockaddr_storage    m_sock_addr;          /*   600   128 */
	/* --- cacheline 11 boundary (704 bytes) was 24 bytes ago --- */
	socklen_t                  m_sock_addr_length;   /*   728     4 */
	bool                       m_system_thread;      /*   732     1 */

	/* size: 736, cachelines: 12, members: 13 */
	/* sum members: 732, holes: 1, sum holes: 1 */
	/* padding: 3 */
	/* last cacheline: 32 bytes */
};
struct PSI_notification_v3 {
	PSI_notification_cb_v3     thread_create;        /*     0     8 */
	PSI_notification_cb_v3     thread_destroy;       /*     8     8 */
	PSI_notification_cb_v3     session_connect;      /*    16     8 */
	PSI_notification_cb_v3     session_disconnect;   /*    24     8 */
	PSI_notification_cb_v3     session_change_user;  /*    32     8 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
struct PSI_transaction_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     m_class;              /*     8     8 */
	class PSI_thread *         m_thread;             /*    16     8 */
	long long unsigned int     m_timer_start;        /*    24     8 */
	long long unsigned int     (*m_timer)(void);     /*    32     8 */
	void *                     m_transaction;        /*    40     8 */
	bool                       m_read_only;          /*    48     1 */
	bool                       m_autocommit;         /*    49     1 */

	/* XXX 6 bytes hole, try to pack */

	long unsigned int          m_statement_count;    /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	long unsigned int          m_savepoint_count;    /*    64     8 */
	long unsigned int          m_rollback_to_savepoint_count; /*    72     8 */
	long unsigned int          m_release_savepoint_count; /*    80     8 */

	/* size: 88, cachelines: 2, members: 12 */
	/* sum members: 78, holes: 2, sum holes: 10 */
	/* last cacheline: 24 bytes */
};
struct PSI_stage_service_v1 {
	register_stage_v1_t        register_stage;       /*     0     8 */
	start_stage_v1_t           start_stage;          /*     8     8 */
	get_current_stage_progress_v1_t get_current_stage_progress; /*    16     8 */
	end_stage_v1_t             end_stage;            /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct PSI_statement_service_v2 {
	register_statement_v1_t    register_statement;   /*     0     8 */
	get_thread_statement_locker_v1_t get_thread_statement_locker; /*     8     8 */
	refine_statement_v1_t      refine_statement;     /*    16     8 */
	start_statement_v1_t       start_statement;      /*    24     8 */
	set_statement_text_v1_t    set_statement_text;   /*    32     8 */
	set_statement_query_id_t   set_statement_query_id; /*    40     8 */
	set_statement_lock_time_t  set_statement_lock_time; /*    48     8 */
	set_statement_rows_sent_t  set_statement_rows_sent; /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	set_statement_rows_examined_t set_statement_rows_examined; /*    64     8 */
	inc_statement_created_tmp_disk_tables_t inc_statement_created_tmp_disk_tables; /*    72     8 */
	inc_statement_created_tmp_tables_t inc_statement_created_tmp_tables; /*    80     8 */
	inc_statement_select_full_join_t inc_statement_select_full_join; /*    88     8 */
	inc_statement_select_full_range_join_t inc_statement_select_full_range_join; /*    96     8 */
	inc_statement_select_range_t inc_statement_select_range; /*   104     8 */
	inc_statement_select_range_check_t inc_statement_select_range_check; /*   112     8 */
	inc_statement_select_scan_t inc_statement_select_scan; /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	inc_statement_sort_merge_passes_t inc_statement_sort_merge_passes; /*   128     8 */
	inc_statement_sort_range_t inc_statement_sort_range; /*   136     8 */
	inc_statement_sort_rows_t  inc_statement_sort_rows; /*   144     8 */
	inc_statement_sort_scan_t  inc_statement_sort_scan; /*   152     8 */
	set_statement_no_index_used_t set_statement_no_index_used; /*   160     8 */
	set_statement_no_good_index_used_t set_statement_no_good_index_used; /*   168     8 */
	end_statement_v1_t         end_statement;        /*   176     8 */
	create_prepared_stmt_v1_t  create_prepared_stmt; /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	destroy_prepared_stmt_v1_t destroy_prepared_stmt; /*   192     8 */
	reprepare_prepared_stmt_v1_t reprepare_prepared_stmt; /*   200     8 */
	execute_prepared_stmt_v1_t execute_prepared_stmt; /*   208     8 */
	set_prepared_stmt_text_v1_t set_prepared_stmt_text; /*   216     8 */
	digest_start_v1_t          digest_start;         /*   224     8 */
	digest_end_v1_t            digest_end;           /*   232     8 */
	get_sp_share_v1_t          get_sp_share;         /*   240     8 */
	release_sp_share_v1_t      release_sp_share;     /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	start_sp_v1_t              start_sp;             /*   256     8 */
	end_sp_v1_t                end_sp;               /*   264     8 */
	drop_sp_v1_t               drop_sp;              /*   272     8 */

	/* size: 280, cachelines: 5, members: 35 */
	/* last cacheline: 24 bytes */
};
struct PSI_thread_service_v4 {
	register_thread_v1_t       register_thread;      /*     0     8 */
	spawn_thread_v1_t          spawn_thread;         /*     8     8 */
	new_thread_v1_t            new_thread;           /*    16     8 */
	set_thread_id_v1_t         set_thread_id;        /*    24     8 */
	get_current_thread_internal_id_v2_t get_current_thread_internal_id; /*    32     8 */
	get_thread_internal_id_v2_t get_thread_internal_id; /*    40     8 */
	get_thread_by_id_v2_t      get_thread_by_id;     /*    48     8 */
	set_thread_THD_v1_t        set_thread_THD;       /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	set_thread_os_id_v1_t      set_thread_os_id;     /*    64     8 */
	get_thread_v1_t            get_thread;           /*    72     8 */
	set_thread_user_v1_t       set_thread_user;      /*    80     8 */
	set_thread_account_v1_t    set_thread_account;   /*    88     8 */
	set_thread_db_v1_t         set_thread_db;        /*    96     8 */
	set_thread_command_v1_t    set_thread_command;   /*   104     8 */
	set_connection_type_v1_t   set_connection_type;  /*   112     8 */
	set_thread_start_time_v1_t set_thread_start_time; /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	set_thread_start_time_usec_v4_t set_thread_start_time_usec; /*   128     8 */
	set_thread_rows_sent_v4_t  set_thread_rows_sent; /*   136     8 */
	set_thread_rows_examined_v4_t set_thread_rows_examined; /*   144     8 */
	set_thread_info_v1_t       set_thread_info;      /*   152     8 */
	set_thread_resource_group_v1_t set_thread_resource_group; /*   160     8 */
	set_thread_resource_group_by_id_v1_t set_thread_resource_group_by_id; /*   168     8 */
	set_thread_v1_t            set_thread;           /*   176     8 */
	set_thread_peer_port_v4_t  set_thread_peer_port; /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	aggregate_thread_status_v2_t aggregate_thread_status; /*   192     8 */
	delete_current_thread_v1_t delete_current_thread; /*   200     8 */
	delete_thread_v1_t         delete_thread;        /*   208     8 */
	set_thread_connect_attrs_v1_t set_thread_connect_attrs; /*   216     8 */
	get_current_thread_event_id_v2_t get_current_thread_event_id; /*   224     8 */
	get_thread_event_id_v2_t   get_thread_event_id;  /*   232     8 */
	get_thread_system_attrs_v3_t get_thread_system_attrs; /*   240     8 */
	get_thread_system_attrs_by_id_v3_t get_thread_system_attrs_by_id; /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	register_notification_v3_t register_notification; /*   256     8 */
	unregister_notification_v1_t unregister_notification; /*   264     8 */
	notify_session_connect_v1_t notify_session_connect; /*   272     8 */
	notify_session_disconnect_v1_t notify_session_disconnect; /*   280     8 */
	notify_session_change_user_v1_t notify_session_change_user; /*   288     8 */

	/* size: 296, cachelines: 5, members: 37 */
	/* last cacheline: 40 bytes */
};
struct my_thread_scheduler_service {
	int                        (*connection_handler_set)(class Connection_handler_functions *, class THD_event_functions *); /*     0     8 */
	int                        (*connection_handler_reset)(void); /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
struct THD_event_functions {
	void                       (*thd_wait_begin)(class THD *, int); /*     0     8 */
	void                       (*thd_wait_end)(class THD *); /*     8     8 */
	void                       (*post_kill_notification)(class THD *); /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
struct NET {
	class Vio *                vio;                  /*     0     8 */
	unsigned char *            buff;                 /*     8     8 */
	unsigned char *            buff_end;             /*    16     8 */
	unsigned char *            write_pos;            /*    24     8 */
	unsigned char *            read_pos;             /*    32     8 */
	my_socket                  fd;                   /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	long unsigned int          remain_in_buf;        /*    48     8 */
	long unsigned int          length;               /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	long unsigned int          buf_length;           /*    64     8 */
	long unsigned int          where_b;              /*    72     8 */
	long unsigned int          max_packet;           /*    80     8 */
	long unsigned int          max_packet_size;      /*    88     8 */
	unsigned int               pkt_nr;               /*    96     4 */
	unsigned int               compress_pkt_nr;      /*   100     4 */
	unsigned int               write_timeout;        /*   104     4 */
	unsigned int               read_timeout;         /*   108     4 */
	unsigned int               retry_count;          /*   112     4 */
	int                        fcntl;                /*   116     4 */
	unsigned int *             return_status;        /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	unsigned char              reading_or_writing;   /*   128     1 */
	unsigned char              save_char;            /*   129     1 */
	bool                       compress;             /*   130     1 */

	/* XXX 1 byte hole, try to pack */

	unsigned int               last_errno;           /*   132     4 */
	unsigned char              error;                /*   136     1 */
	char                       last_error[512];      /*   137   512 */
	/* --- cacheline 10 boundary (640 bytes) was 9 bytes ago --- */
	char                       sqlstate[6];          /*   649     6 */

	/* XXX 1 byte hole, try to pack */

	void *                     extension;            /*   656     8 */

	/* size: 664, cachelines: 11, members: 27 */
	/* sum members: 658, holes: 3, sum holes: 6 */
	/* last cacheline: 24 bytes */
};
struct Vio {
	struct MYSQL_SOCKET        mysql_socket;         /*     0    16 */
	bool                       localhost;            /*    16     1 */

	/* XXX 3 bytes hole, try to pack */

	enum enum_vio_type         type;                 /*    20     4 */
	int                        read_timeout;         /*    24     4 */
	int                        write_timeout;        /*    28     4 */
	int                        retry_count;          /*    32     4 */
	bool                       inactive;             /*    36     1 */
	bool                       force_skip_proxy;     /*    37     1 */

	/* XXX 2 bytes hole, try to pack */

	struct sockaddr_storage    local;                /*    40   128 */
	/* --- cacheline 2 boundary (128 bytes) was 40 bytes ago --- */
	struct sockaddr_storage    remote;               /*   168   128 */
	/* --- cacheline 4 boundary (256 bytes) was 40 bytes ago --- */
	size_t                     addrLen;              /*   296     8 */
	char *                     read_buffer;          /*   304     8 */
	char *                     read_pos;             /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	char *                     read_end;             /*   320     8 */
	my_thread_t                thread_id;            /*   328     8 */
	sigset_t                   signal_mask;          /*   336   128 */
	/* --- cacheline 7 boundary (448 bytes) was 16 bytes ago --- */
	struct atomic_flag         poll_shutdown_flag;   /*   464     1 */
	char                       network_namespace[256]; /*   465   256 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 11 boundary (704 bytes) was 24 bytes ago --- */
	void                       (*viodelete)(class Vio *); /*   728     8 */
	int                        (*vioerrno)(class Vio *); /*   736     8 */
	size_t                     (*read)(class Vio *, uchar *, size_t); /*   744     8 */
	size_t                     (*write)(class Vio *, const uchar  *, size_t); /*   752     8 */
	int                        (*timeout)(class Vio *, uint, bool); /*   760     8 */
	/* --- cacheline 12 boundary (768 bytes) --- */
	int                        (*viokeepalive)(class Vio *, bool); /*   768     8 */
	int                        (*fastsend)(class Vio *); /*   776     8 */
	bool                       (*peer_addr)(class Vio *, char *, uint16 *, size_t); /*   784     8 */
	void                       (*in_addr)(class Vio *, class sockaddr_storage *); /*   792     8 */
	bool                       (*should_retry)(class Vio *); /*   800     8 */
	bool                       (*was_timeout)(class Vio *); /*   808     8 */
	int                        (*vioshutdown)(class Vio *, int); /*   816     8 */
	int                        (*viocancel)(class Vio *, int); /*   824     8 */
	/* --- cacheline 13 boundary (832 bytes) --- */
	bool                       (*is_connected)(class Vio *); /*   832     8 */
	bool                       (*has_data)(class Vio *); /*   840     8 */
	int                        (*io_wait)(class Vio *, enum enum_vio_io_event, int); /*   848     8 */
	bool                       (*connect)(class Vio *, class sockaddr *, socklen_t, int); /*   856     8 */
	void *                     ssl_arg;              /*   864     8 */
	class PSI_socket_locker *  m_psi_read_locker;    /*   872     8 */
	PSI_socket_locker_state    m_psi_read_state;     /*   880    80 */
	/* --- cacheline 15 boundary (960 bytes) --- */
	class PSI_socket_locker *  m_psi_write_locker;   /*   960     8 */
	PSI_socket_locker_state    m_psi_write_state;    /*   968    80 */
	/* --- cacheline 16 boundary (1024 bytes) was 24 bytes ago --- */
	bool                       (*is_blocking)(class Vio *); /*  1048     8 */
	int                        (*set_blocking)(class Vio *, bool); /*  1056     8 */
	int                        (*set_blocking_flag)(class Vio *, bool); /*  1064     8 */
	bool                       is_blocking_flag;     /*  1072     1 */
private:

	void Vio(class Vio *, uint);

	void ~Vio(class Vio *, int);

	void Vio(class Vio *, const class Vio  &);

	class Vio & operator=(class Vio *, const class Vio  &);

	class Vio & operator=(class Vio *, );


	/* size: 1080, cachelines: 17, members: 44 */
	/* sum members: 1061, holes: 3, sum holes: 12 */
	/* padding: 7 */
	/* last cacheline: 56 bytes */
};
struct rand_struct {
	long unsigned int          seed1;                /*     0     8 */
	long unsigned int          seed2;                /*     8     8 */
	long unsigned int          max_value;            /*    16     8 */
	double                     max_value_dbl;        /*    24     8 */

	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
struct UDF_ARGS {
	unsigned int               arg_count;            /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	enum Item_result *         arg_type;             /*     8     8 */
	char * *                   args;                 /*    16     8 */
	long unsigned int *        lengths;              /*    24     8 */
	char *                     maybe_null;           /*    32     8 */
	char * *                   attributes;           /*    40     8 */
	long unsigned int *        attribute_lengths;    /*    48     8 */
	void *                     extension;            /*    56     8 */

	/* size: 64, cachelines: 1, members: 8 */
	/* sum members: 60, holes: 1, sum holes: 4 */
};
struct UDF_INIT {
	bool                       maybe_null;           /*     0     1 */

	/* XXX 3 bytes hole, try to pack */

	unsigned int               decimals;             /*     4     4 */
	long unsigned int          max_length;           /*     8     8 */
	char *                     ptr;                  /*    16     8 */
	bool                       const_item;           /*    24     1 */

	/* XXX 7 bytes hole, try to pack */

	void *                     extension;            /*    32     8 */

	/* size: 40, cachelines: 1, members: 6 */
	/* sum members: 30, holes: 2, sum holes: 10 */
	/* last cacheline: 40 bytes */
};
struct compression_attributes {
	char                       compress_algorithm[32]; /*     0    32 */
	unsigned int               compress_level;       /*    32     4 */
	bool                       compression_optional; /*    36     1 */
	void compression_attributes(class compression_attributes *);


	/* size: 40, cachelines: 1, members: 3 */
	/* padding: 3 */
	/* last cacheline: 40 bytes */
};
struct NET_SERVER {
	before_header_callback_fn  m_before_header;      /*     0     8 */
	after_header_callback_fn   m_after_header;       /*     8     8 */
	void *                     m_user_data;          /*    16     8 */
	struct compression_attributes compression;       /*    24    40 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) --- */
	mysql_compress_context     compress_ctx;         /*    64    32 */
	long unsigned int          max_interval_packet;  /*    96     8 */
	long long unsigned int     net_buffer_shrink_time; /*   104     8 */
	void NET_SERVER(class NET_SERVER *);


	/* size: 112, cachelines: 2, members: 7 */
	/* paddings: 1, sum paddings: 3 */
	/* last cacheline: 48 bytes */
};
struct user_conn {
	char *                     user;                 /*     0     8 */
	char *                     host;                 /*     8     8 */
	ulonglong                  reset_utime;          /*    16     8 */
	size_t                     len;                  /*    24     8 */
	uint                       connections;          /*    32     4 */
	uint                       conn_per_hour;        /*    36     4 */
	uint                       updates;              /*    40     4 */
	uint                       questions;            /*    44     4 */
	USER_RESOURCES             user_resources;       /*    48    20 */

	/* size: 72, cachelines: 2, members: 9 */
	/* padding: 4 */
	/* last cacheline: 8 bytes */
};
class Security_context {
public:

	void Security_context(class Security_context *, class THD *);

	void ~Security_context(class Security_context *, int);

	void Security_context(class Security_context *, const class Security_context  &);

	class Security_context & operator=(class Security_context *, const class Security_context  &);

	void skip_grants(class Security_context *, const char  *, const char  *);

	bool is_skip_grants_user(class Security_context *);

	LEX_CSTRING user(const class Security_context  *);

	void set_user_ptr(class Security_context *, const char  *, size_t);

	void assign_user(class Security_context *, const char  *, size_t);

	class pair<bool, bool> has_global_grant(class Security_context *, const char  *, size_t);

	class pair<bool, bool> has_global_grant(class Security_context *, const class Auth_id  &, const string  &, bool);

	bool can_operate_with(class Security_context *, const class Auth_id  &, const string  &, bool, bool, bool);

	int activate_role(class Security_context *, LEX_CSTRING, LEX_CSTRING, bool);

	void clear_active_roles(class Security_context *);

	List_of_auth_id_refs * get_active_roles(class Security_context *);

	size_t get_num_active_roles(const class Security_context  *);

	void get_active_roles(class Security_context *, class THD *, class List<LEX_USER> &);

	void checkout_access_maps(class Security_context *);

	ulong db_acl(const class Security_context  *, LEX_CSTRING, bool);

	ulong procedure_acl(class Security_context *, LEX_CSTRING, LEX_CSTRING);

	ulong function_acl(class Security_context *, LEX_CSTRING, LEX_CSTRING);

	ulong table_acl(class Security_context *, LEX_CSTRING, LEX_CSTRING);

	class Grant_table_aggregate table_and_column_acls(class Security_context *, LEX_CSTRING, LEX_CSTRING);

	bool has_with_admin_acl(class Security_context *, const LEX_CSTRING  &, const LEX_CSTRING  &);

	bool any_sp_acl(class Security_context *, const LEX_CSTRING  &);

	bool any_table_acl(class Security_context *, const LEX_CSTRING  &);

	bool is_table_blocked(class Security_context *, ulong, const class TABLE  *);

	bool has_column_access(class Security_context *, ulong, const class TABLE  *, class vector<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::__cxx11::basi);

	LEX_CSTRING host(const class Security_context  *);

	void set_host_ptr(class Security_context *, const char  *, size_t);

	void assign_host(class Security_context *, const char  *, size_t);

	LEX_CSTRING ip(const class Security_context  *);

	void set_ip_ptr(class Security_context *, const char  *, int);

	void assign_ip(class Security_context *, const char  *, int);

	LEX_CSTRING host_or_ip(const class Security_context  *);

	void set_host_or_ip_ptr(class Security_context *);

	void set_host_or_ip_ptr(class Security_context *, const char  *, int);

	LEX_CSTRING external_user(const class Security_context  *);

	void set_external_user_ptr(class Security_context *, const char  *, int);

	void assign_external_user(class Security_context *, const char  *, int);

	LEX_CSTRING priv_user(const class Security_context  *);

	void assign_priv_user(class Security_context *, const char  *, size_t);

	LEX_CSTRING proxy_user(const class Security_context  *);

	void assign_proxy_user(class Security_context *, const char  *, size_t);

	LEX_CSTRING priv_host(const class Security_context  *);

	void assign_priv_host(class Security_context *, const char  *, size_t);

	const char  * priv_host_name(const class Security_context  *);

	ulong master_access(const class Security_context  *);

	ulong master_access(const class Security_context  *, const string  &);

	const class Restrictions  restrictions(const class Security_context  *);

	void set_master_access(class Security_context *, ulong);

	void set_master_access(class Security_context *, ulong, const class Restrictions  &);

	bool has_account_assigned(const class Security_context  *);

	bool check_access(class Security_context *, ulong, const string  &, bool);

	ulong current_db_access(const class Security_context  *);

	void cache_current_db_access(class Security_context *, ulong);

	bool password_expired(const class Security_context  *);

	void set_password_expired(class Security_context *, bool);

	bool change_security_context(class Security_context *, class THD *, const LEX_CSTRING  &, const LEX_CSTRING  &, const char  *, class Security_context * *, bool);

	void restore_security_context(class Security_context *, class THD *, class Security_context *);

	bool user_matches(class Security_context *, class Security_context *);

	void logout(class Security_context *);

	bool account_is_locked(class Security_context *);

	void lock_account(class Security_context *, bool);

	void set_drop_policy(class Security_context *, const class function<void(Security_context*)>  &);

	void add_as_local_temp_privs(class Security_context *, const class vector<std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::allocator<std::__cxx11);

	bool check_in_local_temp_privs(class Security_context *, const string  &);

	bool has_drop_policy(class Security_context *);

	bool has_executed_drop_policy(class Security_context *);

	void execute_drop_policy(class Security_context *);

	bool is_access_restricted_on_db(const class Security_context  *, ulong, const string  &);

	void clear_db_restrictions(class Security_context *);

	void set_thd(class Security_context *, class THD *);

	class THD * get_thd(class Security_context *);

	void init(class Security_context *);

	void destroy(class Security_context *);

	void copy_security_ctx(class Security_context *, const class Security_context  &);

	ulong filter_access(const class Security_context  *, ulong, const string  &);

	void init_restrictions(class Security_context *, const class Restrictions  &);

	class pair<bool, bool> fetch_global_grant(class Security_context *, const class ACL_USER  &, const string  &, bool);

	bool has_table_access(class Security_context *, ulong, class TABLE_LIST *);

	class String              m_user;                /*     0    32 */

	/* XXX last struct has 3 bytes of padding */

	class String              m_host;                /*    32    32 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) --- */
	class String              m_ip;                  /*    64    32 */

	/* XXX last struct has 3 bytes of padding */

	class String              m_host_or_ip;          /*    96    32 */

	/* XXX last struct has 3 bytes of padding */

	/* --- cacheline 2 boundary (128 bytes) --- */
	class String              m_external_user;       /*   128    32 */

	/* XXX last struct has 3 bytes of padding */

	char                       m_priv_user[96];      /*   160    96 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	size_t                     m_priv_user_length;   /*   256     8 */
	char                       m_proxy_user[357];    /*   264   357 */

	/* XXX 3 bytes hole, try to pack */

	/* --- cacheline 9 boundary (576 bytes) was 48 bytes ago --- */
	size_t                     m_proxy_user_length;  /*   624     8 */
	char                       m_priv_host[256];     /*   632   256 */
	/* --- cacheline 13 boundary (832 bytes) was 56 bytes ago --- */
	size_t                     m_priv_host_length;   /*   888     8 */
	/* --- cacheline 14 boundary (896 bytes) --- */
	ulong                      m_master_access;      /*   896     8 */
	ulong                      m_db_access;          /*   904     8 */
	bool                       m_password_expired;   /*   912     1 */

	/* XXX 7 bytes hole, try to pack */

	List_of_auth_id_refs       m_active_roles;       /*   920    24 */
	class Acl_map *            m_acl_map;            /*   944     8 */
	int                        m_map_checkout_count; /*   952     4 */
	bool                       m_is_locked;          /*   956     1 */
	bool                       m_is_skip_grants_user; /*   957     1 */
	bool                       m_executed_drop_policy; /*   958     1 */
	bool                       m_has_drop_policy;    /*   959     1 */
	/* --- cacheline 15 boundary (960 bytes) --- */
	class unique_ptr<std::function<void(Security_context*)>, std::default_delete<std::function<void(Security_context*)> > > m_drop_policy; /*   960     8 */
	class Restrictions        m_restrictions;        /*   968    64 */

	/* XXX last struct has 64 bytes of padding */

	/* --- cacheline 16 boundary (1024 bytes) was 8 bytes ago --- */
	class THD *                m_thd;                /*  1032     8 */

	/* size: 1040, cachelines: 17, members: 24 */
	/* sum members: 1030, holes: 2, sum holes: 10 */
	/* paddings: 6, sum paddings: 79 */
	/* last cacheline: 16 bytes */
};
class Auth_id {
public:

	void Auth_id(class Auth_id *);

	void Auth_id(class Auth_id *, const char  *, size_t, const char  *, size_t);

	void Auth_id(class Auth_id *, const Auth_id_ref  &);

	void Auth_id(class Auth_id *, const LEX_CSTRING  &, const LEX_CSTRING  &);

	void Auth_id(class Auth_id *, const string  &, const string  &);

	void Auth_id(class Auth_id *, const class LEX_USER  *);

	void Auth_id(class Auth_id *, const class ACL_USER  *);

	void ~Auth_id(class Auth_id *, int);

	void Auth_id(class Auth_id *, const class Auth_id  &);

	class Auth_id & operator=(class Auth_id *, const class Auth_id  &);

	bool operator<(const class Auth_id  *, const class Auth_id  &);

	void auth_str(const class Auth_id  *, string *);

	string auth_str(const class Auth_id  *);

	const string  & user(const class Auth_id  *);

	const string  & host(const class Auth_id  *);

	void create_key(class Auth_id *);

	string                     m_user;               /*     0    32 */
	string                     m_host;               /*    32    32 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	string                     m_key;                /*    64    32 */

	/* size: 96, cachelines: 2, members: 3 */
	/* last cacheline: 32 bytes */
};
struct LEX_USER {
	LEX_CSTRING                user;                 /*     0    16 */
	LEX_CSTRING                host;                 /*    16    16 */
	LEX_CSTRING                plugin;               /*    32    16 */
	LEX_CSTRING                auth;                 /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	LEX_CSTRING                current_auth;         /*    64    16 */
	bool                       uses_identified_by_clause; /*    80     1 */
	bool                       uses_identified_with_clause; /*    81     1 */
	bool                       uses_authentication_string_clause; /*    82     1 */
	bool                       uses_replace_clause;  /*    83     1 */
	bool                       retain_current_password; /*    84     1 */
	bool                       discard_old_password; /*    85     1 */
	bool                       has_password_generator; /*    86     1 */

	/* XXX 1 byte hole, try to pack */

	struct LEX_ALTER           alter_status;         /*    88    44 */
	class LEX_USER * alloc(class THD *, LEX_STRING *, LEX_STRING *);

	class LEX_USER * init(class LEX_USER *, class THD *, LEX_STRING *, LEX_STRING *);


	/* size: 136, cachelines: 3, members: 13 */
	/* sum members: 131, holes: 1, sum holes: 1 */
	/* padding: 4 */
	/* last cacheline: 8 bytes */
};
struct rw_pr_lock_t {
	native_mutex_t             lock;                 /*     0    40 */
	native_cond_t              no_active_readers;    /*    40    48 */
	/* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
	unsigned int               active_readers;       /*    88     4 */
	unsigned int               writers_waiting_readers; /*    92     4 */
	bool                       active_writer;        /*    96     1 */

	/* XXX 7 bytes hole, try to pack */

	my_thread_t                writer_thread;        /*   104     8 */

	/* size: 112, cachelines: 2, members: 6 */
	/* sum members: 105, holes: 1, sum holes: 7 */
	/* last cacheline: 48 bytes */
};
struct mysql_rwlock_t {
	native_rw_lock_t           m_rwlock;             /*     0    56 */
	class PSI_rwlock *         m_psi;                /*    56     8 */

	/* size: 64, cachelines: 1, members: 2 */
};
struct PSI_rwlock : PSI_instr {
	/* struct PSI_instr           <ancestor>; */     /*     0     1 */

	/* size: 1, cachelines: 1, members: 1 */
	/* last cacheline: 1 bytes */

	/* BRAIN FART ALERT! 1 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 8 bits */
};
struct mysql_prlock_t {
	struct rw_pr_lock_t        m_prlock;             /*     0   112 */
	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	class PSI_rwlock *         m_psi;                /*   112     8 */

	/* size: 120, cachelines: 2, members: 2 */
	/* last cacheline: 56 bytes */
};
struct PSI_rwlock_info_v1 {
	PSI_rwlock_key *           m_key;                /*     0     8 */
	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */
	int                        m_volatility;         /*    20     4 */
	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct PSI_rwlock_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */
	enum PSI_rwlock_operation  m_operation;          /*     4     4 */
	class PSI_rwlock *         m_rwlock;             /*     8     8 */
	class PSI_thread *         m_thread;             /*    16     8 */
	long long unsigned int     m_timer_start;        /*    24     8 */
	long long unsigned int     (*m_timer)(void);     /*    32     8 */
	void *                     m_wait;               /*    40     8 */

	/* size: 48, cachelines: 1, members: 7 */
	/* last cacheline: 48 bytes */
};
struct PSI_rwlock_service_v2 {
	register_rwlock_v1_t       register_rwlock;      /*     0     8 */
	init_rwlock_v1_t           init_rwlock;          /*     8     8 */
	destroy_rwlock_v1_t        destroy_rwlock;       /*    16     8 */
	start_rwlock_rdwait_v1_t   start_rwlock_rdwait;  /*    24     8 */
	end_rwlock_rdwait_v1_t     end_rwlock_rdwait;    /*    32     8 */
	start_rwlock_wrwait_v1_t   start_rwlock_wrwait;  /*    40     8 */
	end_rwlock_wrwait_v1_t     end_rwlock_wrwait;    /*    48     8 */
	unlock_rwlock_v2_t         unlock_rwlock;        /*    56     8 */

	/* size: 64, cachelines: 1, members: 8 */
};
class Restrictions {
public:

	void Restrictions(class Restrictions *);

	void Restrictions(class Restrictions *, const class Restrictions  &);

	void Restrictions(class Restrictions *, );

	class Restrictions & operator=(class Restrictions *, const class Restrictions  &);

	class Restrictions & operator=(class Restrictions *, );

	bool has_more_db_restrictions(class Restrictions *, const class Restrictions  &, ulong);

	void ~Restrictions(class Restrictions *, int);

	const class DB_restrictions  & db(const class Restrictions  *);

	void set_db(class Restrictions *, const class DB_restrictions  &);

	void clear_db(class Restrictions *);

	bool is_empty(const class Restrictions  *);

	class DB_restrictions     m_db_restrictions;     /*     0     0 */

	/* size: 64, cachelines: 1, members: 1 */
	/* padding: 64 */
};
class Simple_cstring {
	const char  *              m_str;                /*     0     8 */
	size_t                     m_length;             /*     8     8 */
public:

	void set(class Simple_cstring *, const char  *, size_t);

	void Simple_cstring(class Simple_cstring *);

	void Simple_cstring(class Simple_cstring *, const char  *, size_t);

	void Simple_cstring(class Simple_cstring *, LEX_STRING);

	void Simple_cstring(class Simple_cstring *, LEX_CSTRING);

	void reset(class Simple_cstring *);

	void set(class Simple_cstring *, const char  *);

	const char  * ptr(const class Simple_cstring  *);

	bool is_set(const class Simple_cstring  *);

	size_t length(const class Simple_cstring  *);

	bool eq_bin(const class Simple_cstring  *, class Simple_cstring);

	void strcpy(const class Simple_cstring  *, char *);


	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
class String {
	char *                     m_ptr;                /*     0     8 */
	size_t                     m_length;             /*     8     8 */
	const class CHARSET_INFO  * m_charset;           /*    16     8 */
	uint32                     m_alloced_length;     /*    24     4 */
	bool                       m_is_alloced;         /*    28     1 */
public:

	void String(class String *);

	void String(class String *, size_t);

	void String(class String *, const char  *, const class CHARSET_INFO  *);

	void String(class String *, const char  *, size_t, const class CHARSET_INFO  *);

	void String(class String *, char *, size_t, const class CHARSET_INFO  *);

	void String(class String *, const class String  &);

	void String(class String *, );

	void * operator new(size_t, class MEM_ROOT *, const class nothrow_t  &);

	void operator delete(void *, size_t);

	void operator delete(void *, class MEM_ROOT *, const class nothrow_t  &);

	void ~String(class String *, int);

	void set_charset(class String *, const class CHARSET_INFO  *);

	const class CHARSET_INFO  * charset(const class String  *);

	size_t length(const class String  *);

	size_t alloced_length(const class String  *);

	const char  & operator[](const class String  *, size_t);

	char & operator[](class String *, size_t);

	void length(class String *, size_t);

	bool is_empty(const class String  *);

	void mark_as_const(class String *);

	const char  * ptr(const class String  *);

	char * ptr(class String *);

	char * c_ptr(class String *);

	char * c_ptr_quick(class String *);

	char * c_ptr_safe(class String *);

	LEX_STRING lex_string(class String *);

	LEX_CSTRING lex_cstring(const class String  *);

	void set(class String *, class String &, size_t, size_t);

	void set(class String *, char *, size_t, const class CHARSET_INFO  *);

	void set(class String *, const char  *, size_t, const class CHARSET_INFO  *);

	bool set_ascii(class String *, const char  *, size_t);

	void set_quick(class String *, char *, size_t, const class CHARSET_INFO  *);

	bool set_int(class String *, longlong, bool, const class CHARSET_INFO  *);

	bool set(class String *, longlong, const class CHARSET_INFO  *);

	bool set(class String *, ulonglong, const class CHARSET_INFO  *);

	bool set_real(class String *, double, uint, const class CHARSET_INFO  *);

	void chop(class String *);

	void mem_claim(class String *, bool);

	void mem_free(class String *);

	bool alloc(class String *, size_t);

	bool real_alloc(class String *, size_t);

	bool mem_realloc(class String *, size_t, bool);

	size_t next_realloc_exp_size(class String *, size_t);

	bool mem_realloc_exp(class String *, size_t);

	void shrink(class String *, size_t);

	bool is_alloced(const class String  *);

	class String & operator=(class String *, const class String  &);

	class String & operator=(class String *, );

	void takeover(class String *, class String &);

	bool copy(class String *);

	bool copy(class String *, const class String  &);

	bool copy(class String *, const char  *, size_t, const class CHARSET_INFO  *);

	bool needs_conversion(size_t, const class CHARSET_INFO  *, const class CHARSET_INFO  *, size_t *);

	bool needs_conversion(const class String  *, const class CHARSET_INFO  *);

	bool is_valid_string(const class String  *, const class CHARSET_INFO  *);

	bool needs_conversion_on_storage(size_t, const class CHARSET_INFO  *, const class CHARSET_INFO  *);

	bool copy_aligned(class String *, const char  *, size_t, size_t, const class CHARSET_INFO  *);

	bool set_or_copy_aligned(class String *, const char  *, size_t, const class CHARSET_INFO  *);

	bool copy(class String *, const char  *, size_t, const class CHARSET_INFO  *, const class CHARSET_INFO  *, uint *);

	bool append(class String *, const class String  &);

	bool append(class String *, const char  *);

	bool append(class String *, LEX_STRING *);

	bool append(class String *, class Simple_cstring);

	bool append(class String *, const char  *, size_t);

	bool append(class String *, const char  *, size_t, const class CHARSET_INFO  *);

	bool append_ulonglong(class String *, ulonglong);

	bool append_longlong(class String *, longlong);

	bool append_with_prefill(class String *, const char  *, size_t, size_t, char);

	bool append_parenthesized(class String *, int64_t);

	int strstr(const class String  *, const class String  &, size_t);

	int strrstr(const class String  *, const class String  &, size_t);

	class String substr(const class String  *, int, int);

	bool replace(class String *, size_t, size_t, const char  *, size_t);

	bool replace(class String *, size_t, size_t, const class String  &);

	bool append(class String *, char);

	bool fill(class String *, size_t, char);

	size_t numchars(const class String  *);

	size_t charpos(const class String  *, size_t, size_t);

	bool reserve(class String *, size_t);

	bool reserve(class String *, size_t, size_t);

	char * prep_append(class String *, size_t, size_t);

	bool append(class String *, const char  *, size_t, size_t);

	void print(const class String  *, class String *);

	void swap(class String *, class String &);

	bool uses_buffer_owned_by(const class String  *, const class String  *);

	bool is_ascii(const class String  *);

	char * dup(const class String  *, class MEM_ROOT *);


	/* size: 32, cachelines: 1, members: 5 */
	/* padding: 3 */
	/* last cacheline: 32 bytes */
};
class List<LEX_USER> : public base_list {
public:

	/* class base_list           <ancestor>; */      /*     0    24 */

	/* XXX last struct has 4 bytes of padding */
	void List(class List<LEX_USER> *);

	void List(class List<LEX_USER> *, const class List<LEX_USER>  &);

	class List<LEX_USER> & operator=(class List<LEX_USER> *, const class List<LEX_USER>  &);

	void List(class List<LEX_USER> *, const class List<LEX_USER>  &, class MEM_ROOT *);

	bool push_back(class List<LEX_USER> *, class LEX_USER *);

	bool push_back(class List<LEX_USER> *, class LEX_USER *, class MEM_ROOT *);

	bool push_front(class List<LEX_USER> *, class LEX_USER *);

	bool push_front(class List<LEX_USER> *, class LEX_USER *, class MEM_ROOT *);

	class LEX_USER * head(class List<LEX_USER> *);

	const class LEX_USER  * head(const class List<LEX_USER>  *);

	class LEX_USER * * head_ref(class List<LEX_USER> *);

	class LEX_USER * pop(class List<LEX_USER> *);

	void concat(class List<LEX_USER> *, class List<LEX_USER> *);

	void disjoin(class List<LEX_USER> *, class List<LEX_USER> *);

	void prepend(class List<LEX_USER> *, class List<LEX_USER> *);

	void delete_elements(class List<LEX_USER> *);

	void destroy_elements(class List<LEX_USER> *);

	class LEX_USER * operator[](const class List<LEX_USER>  *, uint);

	void replace(class List<LEX_USER> *, uint, class LEX_USER *);

	bool swap_elts(class List<LEX_USER> *, uint, uint);

	typedef struct List_STL_Iterator<LEX_USER> iterator;

	iterator begin(class List<LEX_USER> *);

	iterator end(class List<LEX_USER> *);

	typedef struct List_STL_Iterator<const LEX_USER> const_iterator;

	const_iterator begin(const class List<LEX_USER>  *);

	const_iterator end(const class List<LEX_USER>  *);

	const_iterator cbegin(const class List<LEX_USER>  *);

	const_iterator cend(const class List<LEX_USER>  *);


	/* size: 24, cachelines: 1, members: 1 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 24 bytes */

	/* BRAIN FART ALERT! 24 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 192 bits */
};
struct TABLE {
	struct {
		class JOIN_TAB *           join_tab;             /*     0     8 */
		class QEP_TAB *            qep_tab;              /*     8     8 */
		enum thr_lock_type         lock_type;            /*    16     4 */
		enum thr_locked_row_action locked_row_action;    /*    20     4 */
		bool                       not_exists_optimize;  /*    24     1 */
		bool                       impossible_range;     /*    25     1 */

		/* size: 32, cachelines: 1, members: 6 */
		/* padding: 6 */
		/* last cacheline: 32 bytes */
	};

	class TABLE_SHARE *        s;                    /*     0     8 */
	class handler *            file;                 /*     8     8 */
	class TABLE *              next;                 /*    16     8 */
	class TABLE *              prev;                 /*    24     8 */
private:

	class TABLE *              cache_next;           /*    32     8 */
	class TABLE * *            cache_prev;           /*    40     8 */
	struct MY_BITMAP           fields_for_functional_indexes; /*    48    32 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	class THD *                in_use;               /*    80     8 */
	class Field * *            field;                /*    88     8 */
	uint                       hidden_field_count;   /*    96     4 */

	/* XXX 4 bytes hole, try to pack */

	uchar *                    record[2];            /*   104    16 */
	uchar *                    write_row_record;     /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	uchar *                    insert_values;        /*   128     8 */
	class Record_buffer       m_record_buffer;       /*   136    40 */

	/* XXX last struct has 7 bytes of padding */

	Key_map                    covering_keys;        /*   176     8 */
	Key_map                    quick_keys;           /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	Key_map                    merge_keys;           /*   192     8 */
	Key_map                    possible_quick_keys;  /*   200     8 */
	Key_map                    keys_in_use_for_query; /*   208     8 */
	Key_map                    keys_in_use_for_group_by; /*   216     8 */
	Key_map                    keys_in_use_for_order_by; /*   224     8 */
	class KEY *                key_info;             /*   232     8 */
	class KEY_PART_INFO *      base_key_parts;       /*   240     8 */
	class Field *              next_number_field;    /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	class Field *              found_next_number_field; /*   256     8 */
	class Field * *            vfield;               /*   264     8 */
	class Field * *            gen_def_fields_ptr;   /*   272     8 */
	class Field *              hash_field;           /*   280     8 */
	class Field *              fts_doc_id_field;     /*   288     8 */
	class Table_trigger_dispatcher * triggers;       /*   296     8 */
	class TABLE_LIST *         pos_in_table_list;    /*   304     8 */
	class TABLE_LIST *         pos_in_locked_tables; /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	class ORDER *              group;                /*   320     8 */
	const char  *              alias;                /*   328     8 */
	uchar *                    null_flags;           /*   336     8 */
	uchar *                    null_flags_saved;     /*   344     8 */
	struct MY_BITMAP           def_read_set;         /*   352    32 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	struct MY_BITMAP           def_write_set;        /*   384    32 */
	struct MY_BITMAP           tmp_set;              /*   416    32 */
	/* --- cacheline 7 boundary (448 bytes) --- */
	struct MY_BITMAP           pack_row_tmp_set;     /*   448    32 */
	struct MY_BITMAP           cond_set;             /*   480    32 */
	/* --- cacheline 8 boundary (512 bytes) --- */
	struct MY_BITMAP           def_fields_set_during_insert; /*   512    32 */
	class MY_BITMAP *          read_set;             /*   544     8 */
	class MY_BITMAP *          write_set;            /*   552     8 */
	class MY_BITMAP *          fields_set_during_insert; /*   560     8 */
	query_id_t                 query_id;             /*   568     8 */
	/* --- cacheline 9 boundary (576 bytes) --- */
	ha_rows                    quick_rows[64];       /*   576   512 */
	/* --- cacheline 17 boundary (1088 bytes) --- */
	key_part_map               const_key_parts[64];  /*  1088   512 */
	/* --- cacheline 25 boundary (1600 bytes) --- */
	uint                       quick_key_parts[64];  /*  1600   256 */
	/* --- cacheline 29 boundary (1856 bytes) --- */
	uint                       quick_n_ranges[64];   /*  1856   256 */
	/* --- cacheline 33 boundary (2112 bytes) --- */
	ha_rows                    quick_condition_rows; /*  2112     8 */
	uint                       lock_position;        /*  2120     4 */
	uint                       lock_data_start;      /*  2124     4 */
	uint                       lock_count;           /*  2128     4 */
	uint                       db_stat;              /*  2132     4 */
	int                        current_lock;         /*  2136     4 */

	/* XXX 4 bytes hole, try to pack */

	Sql_table_check_constraint_list * table_check_constraint_list; /*  2144     8 */
	bool                       nullable;             /*  2152     1 */
	uint8                      m_status;             /*  2153     1 */
	bool                       null_row;             /*  2154     1 */
	bool                       copy_blobs;           /*  2155     1 */
	bool                       force_index;          /*  2156     1 */
	bool                       force_index_order;    /*  2157     1 */
	bool                       force_index_group;    /*  2158     1 */
	bool                       const_table;          /*  2159     1 */
	bool                       no_rows;              /*  2160     1 */
	bool                       key_read;             /*  2161     1 */
	bool                       no_keyread;           /*  2162     1 */
	bool                       no_replicate;         /*  2163     1 */
	bool                       no_cache;             /*  2164     1 */
	bool                       open_by_handler;      /*  2165     1 */
	bool                       autoinc_field_has_explicit_non_null_value; /*  2166     1 */
	bool                       alias_name_used;      /*  2167     1 */
	bool                       get_fields_in_item_tree; /*  2168     1 */
	bool                       m_invalid_dict;       /*  2169     1 */
	bool                       m_invalid_stats;      /*  2170     1 */
	bool                       created;              /*  2171     1 */
	bool                       materialized;         /*  2172     1 */

	/* XXX 3 bytes hole, try to pack */

	/* --- cacheline 34 boundary (2176 bytes) --- */
	struct {
		class JOIN_TAB *   join_tab;             /*  2176     8 */
		class QEP_TAB *    qep_tab;              /*  2184     8 */
		enum thr_lock_type lock_type;            /*  2192     4 */
		enum thr_locked_row_action locked_row_action; /*  2196     4 */
		bool               not_exists_optimize;  /*  2200     1 */
		bool               impossible_range;     /*  2201     1 */
	} reginfo;                                       /*  2176    32 */

	/* XXX last struct has 6 bytes of padding */

	struct MEM_ROOT            mem_root;             /*  2208    80 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 35 boundary (2240 bytes) was 48 bytes ago --- */
	class Blob_mem_storage *   blob_storage;         /*  2288     8 */
	class SortingIterator *    sorting_iterator;     /*  2296     8 */
	/* --- cacheline 36 boundary (2304 bytes) --- */
	class SortingIterator *    duplicate_removal_iterator; /*  2304     8 */
	class Sort_result         unique_result;         /*  2312    40 */
	class partition_info *     part_info;            /*  2352     8 */
	bool                       all_partitions_pruned_away; /*  2360     1 */

	/* XXX 7 bytes hole, try to pack */

	/* --- cacheline 37 boundary (2368 bytes) --- */
	class MDL_ticket *         mdl_ticket;           /*  2368     8 */
	class Cost_model_table    m_cost_model;          /*  2376    24 */
	void reset(class TABLE *);

	void init(class TABLE *, class THD *, class TABLE_LIST *);

	bool init_tmp_table(class TABLE *, class THD *, class TABLE_SHARE *, class MEM_ROOT *, class CHARSET_INFO *, const char  *, class Field * *, uint *, bool);

	bool fill_item_list(const class TABLE  *, class mem_root_deque<Item*> *);

	void reset_item_list(const class TABLE  *, const class mem_root_deque<Item*>  &);

	void clear_column_bitmaps(class TABLE *);

	void prepare_for_position(class TABLE *);

	void mark_column_used(class TABLE *, class Field *, enum enum_mark_columns);

	void mark_columns_used_by_index_no_reset(const class TABLE  *, uint, class MY_BITMAP *, uint);

	void mark_columns_used_by_index(class TABLE *, uint);

	void mark_auto_increment_column(class TABLE *);

	void mark_columns_needed_for_update(class TABLE *, class THD *, bool);

	void mark_columns_needed_for_delete(class TABLE *, class THD *);

	void mark_columns_needed_for_insert(class TABLE *, class THD *);

	void mark_columns_per_binlog_row_image(class TABLE *, class THD *);

	void mark_generated_columns(class TABLE *, bool);

	void mark_gcol_in_maps(class TABLE *, const class Field  *);

	void mark_check_constraint_columns(class TABLE *, bool);

	void column_bitmaps_set(class TABLE *, class MY_BITMAP *, class MY_BITMAP *);

	void column_bitmaps_set_no_signal(class TABLE *, class MY_BITMAP *, class MY_BITMAP *);

	void use_all_columns(class TABLE *);

	void default_column_bitmaps(class TABLE *);

	void invalidate_dict(class TABLE *);

	void invalidate_stats(class TABLE *);

	bool has_invalid_dict(const class TABLE  *);

	bool has_invalid_stats(class TABLE *);

	class Field * * visible_field_ptr(const class TABLE  *);

	uint visible_field_count(const class TABLE  *);

	bool alloc_tmp_keys(class TABLE *, uint, uint, bool);

	bool add_tmp_key(class TABLE *, Field_map *, bool, bool);

	void copy_tmp_key(class TABLE *, int, bool);

	void drop_unused_tmp_keys(class TABLE *, bool);

	void set_keyread(class TABLE *, bool);

	bool index_contains_some_virtual_gcol(const class TABLE  *, uint);

	void update_const_key_parts(class TABLE *, class Item *);

	bool check_read_removal(class TABLE *, uint);

	ptrdiff_t default_values_offset(const class TABLE  *);

	bool has_storage_handler(const class TABLE  *);

	void set_storage_handler(class TABLE *, class handler *);

	bool is_created(const class TABLE  *);

	void set_created(class TABLE *);

	void set_deleted(class TABLE *);

	void set_nullable(class TABLE *);

	bool is_nullable(const class TABLE  *);

	bool has_gcol(const class TABLE  *);

	void set_not_started(class TABLE *);

	bool is_started(const class TABLE  *);

	void set_found_row(class TABLE *);

	void set_no_row(class TABLE *);

	void set_row_status_from_handler(class TABLE *, int);

	void set_null_row(class TABLE *);

	void reset_null_row(class TABLE *);

	void set_updated_row(class TABLE *);

	void set_deleted_row(class TABLE *);

	bool has_row(const class TABLE  *);

	bool has_null_row(const class TABLE  *);

	bool has_updated_row(const class TABLE  *);

	bool has_deleted_row(const class TABLE  *);

	void save_null_flags(class TABLE *);

	void restore_null_flags(class TABLE *);

	bool empty_result_table(class TABLE *);

	void init_cost_model(class TABLE *, const class Cost_model_server  *);

	const class Cost_model_table  * cost_model(const class TABLE  *);

	void refix_value_generator_items(class TABLE *, class THD *);

	void refix_inner_value_generator_items(class TABLE *, class Value_generator *);

	void cleanup_value_generator_items(class TABLE *);

	bool has_compressed_columns(const class TABLE  *);

	bool has_compressed_columns_with_dictionaries(const class TABLE  *);

	void update_compressed_columns_info(class TABLE *, const class List<Create_field>  &);

	void update_covering_prefix_keys(class TABLE *, class Field *, uint16, Key_map *);

	class MY_BITMAP *          m_partial_update_columns; /*  2400     8 */
	class Partial_update_info * m_partial_update_info; /*  2408     8 */
	bool                       should_binlog_drop_if_temp_flag; /*  2416     1 */

	/* XXX 7 bytes hole, try to pack */
	bool has_binary_diff_columns(const class TABLE  *);

	const Binary_diff_vector  * get_binary_diffs(const class TABLE  *, const class Field  *);

	bool mark_column_for_partial_update(class TABLE *, const class Field  *);

	bool is_marked_for_partial_update(const class TABLE  *, const class Field  *);

	bool has_columns_marked_for_partial_update(const class TABLE  *);

	bool setup_partial_update(class TABLE *, bool);

	bool setup_partial_update(class TABLE *);

	bool add_binary_diff(class TABLE *, const class Field  *, size_t, size_t);

	void clear_partial_update_diffs(class TABLE *);

	void cleanup_partial_update(class TABLE *);

	void disable_binary_diffs_for_current_row(class TABLE *, const class Field  *);

	void disable_logical_diffs_for_current_row(const class TABLE  *, const class Field  *);

	class String * get_partial_update_buffer(class TABLE *);

	void add_logical_diff(class TABLE *, const class Field_json  *, const class Json_seekable_path  &, enum enum_json_diff_operation, const class Json_wrapper  *);

	const class Json_diff_vector  * get_logical_diffs(const class TABLE  *, const class Field_json  *);

	bool is_binary_diff_enabled(const class TABLE  *, const class Field  *);

	bool is_logical_diff_enabled(const class TABLE  *, const class Field  *);

	void blobs_need_not_keep_old_value(class TABLE *);

	void set_binlog_drop_if_temp(class TABLE *, bool);

	bool should_binlog_drop_if_temp(const class TABLE  *);

	void set_tmp_dd_table_ptr(class TABLE *, const class Table  *);

	const class Table  * get_tmp_dd_table_ptr(const class TABLE  *);


	const class Table  *       tmp_dd_table_ptr;     /*  2424     8 */

	/* size: 2432, cachelines: 38, members: 92 */
	/* sum members: 2407, holes: 5, sum holes: 25 */
	/* paddings: 3, sum paddings: 17 */
};
struct TABLE_LIST {
	enum {
		OPEN_NORMAL     = 0,
		OPEN_IF_EXISTS  = 1,
		OPEN_FOR_CREATE = 2,
		OPEN_STUB       = 3,
	};

	void TABLE_LIST(class TABLE_LIST *);

	void TABLE_LIST(class TABLE_LIST *, class TABLE *);

	void TABLE_LIST(class TABLE_LIST *, const char  *, const char  *, enum thr_lock_type);

	void TABLE_LIST(class TABLE_LIST *, class TABLE *, const char  *, size_t, const char  *, size_t, const char  *, enum thr_lock_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, const char  *, const char  *, enum thr_lock_type);

	void TABLE_LIST(class TABLE_LIST *, class TABLE *, const char  *);

	void TABLE_LIST(class TABLE_LIST *, class TABLE *, const char  *, enum enum_mdl_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, const char  *, enum thr_lock_type, enum enum_mdl_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, size_t, const char  *, size_t, enum thr_lock_type, enum enum_mdl_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, size_t, const char  *, size_t, enum thr_lock_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, size_t, const char  *, size_t, const char  *, enum enum_mdl_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, size_t, const char  *, size_t, const char  *, enum thr_lock_type, enum enum_mdl_type);

	void TABLE_LIST(class TABLE_LIST *, const char  *, size_t, const char  *, size_t, const char  *, enum thr_lock_type);

	class TABLE_LIST * new_nested_join(class MEM_ROOT *, const char  *, class TABLE_LIST *, class mem_root_deque<TABLE_LIST*> *, class Query_block *);

	class Item * * join_cond_ref(class TABLE_LIST *);

	class Item * join_cond(const class TABLE_LIST  *);

	void set_join_cond(class TABLE_LIST *, class Item *);

	class Item * join_cond_optim(const class TABLE_LIST  *);

	void set_join_cond_optim(class TABLE_LIST *, class Item *);

	class Item * * join_cond_optim_ref(class TABLE_LIST *);

	bool is_sj_nest(const class TABLE_LIST  *);

	bool is_aj_nest(const class TABLE_LIST  *);

	bool is_sj_or_aj_nest(const class TABLE_LIST  *);

	void set_sj_or_aj_nest(class TABLE_LIST *);

	bool merge_underlying_tables(class TABLE_LIST *, class Query_block *);

	void reset(class TABLE_LIST *);

	int view_check_option(const class TABLE_LIST  *, class THD *);

	void cleanup_items(class TABLE_LIST *);

	void print(const class TABLE_LIST  *, const class THD  *, class String *, enum enum_query_type);

	bool check_single_table(class TABLE_LIST *, class TABLE_LIST * *, table_map);

	bool set_insert_values(class TABLE_LIST *, class MEM_ROOT *);

	class TABLE_LIST * first_leaf_for_name_resolution(class TABLE_LIST *);

	class TABLE_LIST * last_leaf_for_name_resolution(class TABLE_LIST *);

	bool is_leaf_for_name_resolution(const class TABLE_LIST  *);

	const class TABLE_LIST  * top_table(const class TABLE_LIST  *);

	class TABLE_LIST * top_table(class TABLE_LIST *);

	bool prepare_check_option(class TABLE_LIST *, class THD *, bool);

	bool merge_where(class TABLE_LIST *, class THD *);

	bool prepare_replace_filter(class TABLE_LIST *, class THD *);

	bool is_view(const class TABLE_LIST  *);

	bool is_derived(const class TABLE_LIST  *);

	bool is_view_or_derived(const class TABLE_LIST  *);

	bool is_table_function(const class TABLE_LIST  *);

	bool is_recursive_reference(const class TABLE_LIST  *);

	bool is_base_table(const class TABLE_LIST  *);

	bool set_recursive_reference(class TABLE_LIST *);

	bool is_internal(const class TABLE_LIST  *);

	bool is_placeholder(const class TABLE_LIST  *);

	bool is_mergeable(const class TABLE_LIST  *);

	bool materializable_is_const(const class TABLE_LIST  *);

	bool is_merged(const class TABLE_LIST  *);

	void set_merged(class TABLE_LIST *);

	bool uses_materialization(const class TABLE_LIST  *);

	void set_uses_materialization(class TABLE_LIST *);

	bool is_updatable(const class TABLE_LIST  *);

	void set_updatable(class TABLE_LIST *);

	bool is_insertable(const class TABLE_LIST  *);

	void set_insertable(class TABLE_LIST *);

	bool is_updated(const class TABLE_LIST  *);

	void set_updated(class TABLE_LIST *);

	bool is_inserted(const class TABLE_LIST  *);

	void set_inserted(class TABLE_LIST *);

	bool is_deleted(const class TABLE_LIST  *);

	void set_deleted(class TABLE_LIST *);

	void set_fulltext_searched(class TABLE_LIST *);

	bool is_fulltext_searched(const class TABLE_LIST  *);

	void set_readonly(class TABLE_LIST *);

	bool is_multiple_tables(const class TABLE_LIST  *);

	uint leaf_tables_count(const class TABLE_LIST  *);

	class TABLE_LIST * first_leaf_table(class TABLE_LIST *);

	class TABLE_LIST * any_outer_leaf_table(class TABLE_LIST *);

	void set_view_query(class TABLE_LIST *, class LEX *);

	class LEX * view_query(const class TABLE_LIST  *);

	void set_derived_query_expression(class TABLE_LIST *, class Query_expression *);

	class Query_expression * derived_query_expression(const class TABLE_LIST  *);

	bool resolve_derived(class TABLE_LIST *, class THD *, bool);

	bool optimize_derived(class TABLE_LIST *, class THD *);

	bool create_materialized_table(class TABLE_LIST *, class THD *);

	bool materialize_derived(class TABLE_LIST *, class THD *);

	bool can_push_condition_to_derived(class TABLE_LIST *, class THD *);

	class Item * get_derived_expr(class TABLE_LIST *, uint);

	class Item * get_clone_for_derived_expr(class TABLE_LIST *, class THD *, class Item *, class Name_resolution_context *);

	void cleanup_derived(class TABLE_LIST *, class THD *);

	bool prepare_security(class TABLE_LIST *, class THD *);

	class Security_context * find_view_security_context(class TABLE_LIST *, class THD *);

	bool prepare_view_security_context(class TABLE_LIST *, class THD *);

	bool process_index_hints(class TABLE_LIST *, const class THD  *, class TABLE *);

	bool is_table_ref_id_equal(const class TABLE_LIST  *, class TABLE_SHARE *);

	void set_table_ref_id(class TABLE_LIST *, class TABLE_SHARE *);

	void set_table_ref_id(class TABLE_LIST *, enum enum_table_ref_type, ulonglong);

	uint query_block_id(const class TABLE_LIST  *);

	uint query_block_id_for_explain(const class TABLE_LIST  *);

	const char  * get_db_name(const class TABLE_LIST  *);

	const char  * get_table_name(const class TABLE_LIST  *);

	int fetch_number_of_rows(class TABLE_LIST *);

	bool update_derived_keys(class TABLE_LIST *, class THD *, class Field *, class Item * *, uint, bool *);

	bool generate_keys(class TABLE_LIST *);

	bool setup_materialized_derived(class TABLE_LIST *, class THD *);

	bool setup_materialized_derived_tmp_table(class TABLE_LIST *, class THD *);

	bool setup_table_function(class TABLE_LIST *, class THD *);

	bool create_field_translation(class TABLE_LIST *, class THD *);

	class TABLE_LIST * outer_join_nest(const class TABLE_LIST  *);

	bool is_inner_table_of_outer_join(const class TABLE_LIST  *);

	const class TABLE_LIST  * updatable_base_table(const class TABLE_LIST  *);

	class TABLE_LIST * updatable_base_table(class TABLE_LIST *);

	void add_join_natural(class TABLE_LIST *, class TABLE_LIST *);

	void set_privileges(class TABLE_LIST *, ulong);

	bool save_properties(class TABLE_LIST *);

	void restore_properties(class TABLE_LIST *);

	class TABLE_LIST *         next_local;           /*     0     8 */
	class TABLE_LIST *         next_global;          /*     8     8 */
	class TABLE_LIST * *       prev_global;          /*    16     8 */
	const char  *              db;                   /*    24     8 */
	const char  *              table_name;           /*    32     8 */
	const char  *              alias;                /*    40     8 */
	LEX_CSTRING                target_tablespace_name; /*    48    16 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	char *                     option;               /*    64     8 */
	class Opt_hints_table *    opt_hints_table;      /*    72     8 */
	class Opt_hints_qb *       opt_hints_qb;         /*    80     8 */
	void set_lock(class TABLE_LIST *, const class Lock_descriptor  &);

	const class Lock_descriptor  & lock_descriptor(const class TABLE_LIST  *);

private:

	uint                       m_tableno;            /*    88     4 */

	/* XXX 4 bytes hole, try to pack */

	table_map                  m_map;                /*    96     8 */
	class Item *               m_join_cond;          /*   104     8 */
	bool                       m_is_sj_or_aj_nest;   /*   112     1 */

	/* XXX 7 bytes hole, try to pack */

	table_map                  sj_inner_tables;      /*   120     8 */
	/* --- cacheline 2 boundary (128 bytes) --- */
	class TABLE_LIST *         natural_join;         /*   128     8 */
	bool                       is_natural_join;      /*   136     1 */

	/* XXX 7 bytes hole, try to pack */

	class List<String> *       join_using_fields;    /*   144     8 */
	class List<Natural_join_column> * join_columns;  /*   152     8 */
	bool                       is_join_columns_complete; /*   160     1 */

	/* XXX 7 bytes hole, try to pack */

	class TABLE_LIST *         next_name_resolution_table; /*   168     8 */
	class List<Index_hint> *   index_hints;          /*   176     8 */
	class TABLE *              table;                /*   184     8 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	class Table_id            table_id;              /*   192     8 */
	class Query_result_union * derived_result;       /*   200     8 */
	class TABLE_LIST *         correspondent_table;  /*   208     8 */
	class Table_function *     table_function;       /*   216     8 */
	class AccessPath *         access_path_for_derived; /*   224     8 */
	class Query_expression *   derived;              /*   232     8 */
	class Common_table_expr *  m_common_table_expr;  /*   240     8 */
	const Create_col_name_list  * m_derived_column_names; /*   248     8 */
	/* --- cacheline 4 boundary (256 bytes) --- */
	class ST_SCHEMA_TABLE *    schema_table;         /*   256     8 */
	class Query_block *        schema_query_block;   /*   264     8 */
	bool                       schema_table_reformed; /*   272     1 */

	/* XXX 7 bytes hole, try to pack */

	class Temp_table_param *   schema_table_param;   /*   280     8 */
	class Query_block *        query_block;          /*   288     8 */
	class LEX *                view;                 /*   296     8 */
	class Field_translator *   field_translation;    /*   304     8 */
	class Field_translator *   field_translation_end; /*   312     8 */
	/* --- cacheline 5 boundary (320 bytes) --- */
	class TABLE_LIST *         merge_underlying_list; /*   320     8 */
	class mem_root_deque<TABLE_LIST*> * view_tables; /*   328     8 */
	class TABLE_LIST *         belong_to_view;       /*   336     8 */
	class TABLE_LIST *         referencing_view;     /*   344     8 */
	class TABLE_LIST *         parent_l;             /*   352     8 */
	class Security_context *   security_ctx;         /*   360     8 */
	class Security_context *   view_sctx;            /*   368     8 */
	class TABLE_LIST *         next_leaf;            /*   376     8 */
	/* --- cacheline 6 boundary (384 bytes) --- */
	class Item *               derived_where_cond;   /*   384     8 */
	class Item *               check_option;         /*   392     8 */
	class Item *               replace_filter;       /*   400     8 */
	LEX_STRING                 select_stmt;          /*   408    16 */
	LEX_STRING                 source;               /*   424    16 */
	LEX_STRING                 timestamp;            /*   440    16 */
	/* --- cacheline 7 boundary (448 bytes) was 8 bytes ago --- */
	struct LEX_USER            definer;              /*   456   136 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 9 boundary (576 bytes) was 16 bytes ago --- */
	ulonglong                  updatable_view;       /*   592     8 */
	ulonglong                  algorithm;            /*   600     8 */
	ulonglong                  view_suid;            /*   608     8 */
	ulonglong                  with_check;           /*   616     8 */
	class Name_resolution_context * m_merged_derived_context; /*   624     8 */
	enum enum_view_algorithm   effective_algorithm;  /*   632     4 */
	struct Lock_descriptor     m_lock_descriptor;    /*   636     8 */

	/* XXX 4 bytes hole, try to pack */

	/* --- cacheline 10 boundary (640 bytes) was 8 bytes ago --- */
	struct GRANT_INFO          grant;                /*   648    56 */
	/* --- cacheline 11 boundary (704 bytes) --- */
	bool                       outer_join;           /*   704     1 */
	bool                       join_order_swapped;   /*   705     1 */

	/* XXX 2 bytes hole, try to pack */

	uint                       shared;               /*   708     4 */
	size_t                     db_length;            /*   712     8 */
	size_t                     table_name_length;    /*   720     8 */
	bool                       m_updatable;          /*   728     1 */
	bool                       m_insertable;         /*   729     1 */
	bool                       m_updated;            /*   730     1 */
	bool                       m_inserted;           /*   731     1 */
	bool                       m_deleted;            /*   732     1 */
	bool                       m_fulltext_searched;  /*   733     1 */
	bool                       straight;             /*   734     1 */
	bool                       updating;             /*   735     1 */
	bool                       ignore_leaves;        /*   736     1 */

	/* XXX 7 bytes hole, try to pack */

	table_map                  dep_tables;           /*   744     8 */
	table_map                  join_cond_dep_tables; /*   752     8 */
	class NESTED_JOIN *        nested_join;          /*   760     8 */
	/* --- cacheline 12 boundary (768 bytes) --- */
	class TABLE_LIST *         embedding;            /*   768     8 */
	class mem_root_deque<TABLE_LIST*> * join_list;   /*   776     8 */
	bool                       cacheable_table;      /*   784     1 */

	/* XXX 3 bytes hole, try to pack */

	enum enum_open_type        open_type;            /*   788     4 */
	bool                       contain_auto_increment; /*   792     1 */
	bool                       check_option_processed; /*   793     1 */
	bool                       replace_filter_processed; /*   794     1 */

	/* XXX 1 byte hole, try to pack */

	enum enum_table_type       required_type;        /*   796     4 */
	char                       timestamp_buffer[20]; /*   800    20 */
	bool                       prelocking_placeholder; /*   820     1 */

	/* XXX 3 bytes hole, try to pack */

	enum {
		OPEN_NORMAL     = 0,
		OPEN_IF_EXISTS  = 1,
		OPEN_FOR_CREATE = 2,
		OPEN_STUB       = 3,
	} open_strategy;                                 /*   824     4 */
	bool                       internal_tmp_table;   /*   828     1 */
	bool                       is_alias;             /*   829     1 */
	bool                       is_fqtn;              /*   830     1 */
	bool                       m_was_scalar_subquery; /*   831     1 */
	/* --- cacheline 13 boundary (832 bytes) --- */
	class View_creation_ctx *  view_creation_ctx;    /*   832     8 */
	LEX_CSTRING                view_client_cs_name;  /*   840    16 */
	LEX_CSTRING                view_connection_cl_name; /*   856    16 */
	LEX_STRING                 view_body_utf8;       /*   872    16 */
	bool                       is_system_view;       /*   888     1 */
	bool                       is_dd_ctx_table;      /*   889     1 */

	/* XXX 6 bytes hole, try to pack */

	/* --- cacheline 14 boundary (896 bytes) --- */
	class List<Derived_key>   derived_key_list;      /*   896    24 */
	uint8                      trg_event_map;        /*   920     1 */

	/* XXX 3 bytes hole, try to pack */

	uint                       i_s_requested_object; /*   924     4 */
	bool                       has_db_lookup_value;  /*   928     1 */
	bool                       has_table_lookup_value; /*   929     1 */

	/* XXX 2 bytes hole, try to pack */

	uint                       table_open_method;    /*   932     4 */
	bool                       schema_table_filled;  /*   936     1 */

	/* XXX 7 bytes hole, try to pack */

	class MDL_request         mdl_request;           /*   944   448 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 21 boundary (1344 bytes) was 48 bytes ago --- */
	bool                       view_no_explain;      /*  1392     1 */

	/* XXX 7 bytes hole, try to pack */

	class List<String> *       partition_names;      /*  1400     8 */
	void set_tableno(class TABLE_LIST *, uint);

	uint tableno(const class TABLE_LIST  *);

	table_map map(const class TABLE_LIST  *);

	class Common_table_expr * common_table_expr(const class TABLE_LIST  *);

	void set_common_table_expr(class TABLE_LIST *, class Common_table_expr *);

	const Create_col_name_list  * derived_column_names(const class TABLE_LIST  *);

	void set_derived_column_names(class TABLE_LIST *, const Create_col_name_list  *);

	/* --- cacheline 22 boundary (1408 bytes) --- */
	class Item *               m_join_cond_optim;    /*  1408     8 */
	class COND_EQUAL *         cond_equal;           /*  1416     8 */
	bool                       optimized_away;       /*  1424     1 */
	bool                       derived_keys_ready;   /*  1425     1 */
	bool                       m_is_recursive_reference; /*  1426     1 */

	/* XXX 1 byte hole, try to pack */

	enum enum_table_ref_type   m_table_ref_type;     /*  1428     4 */
	ulonglong                  m_table_ref_version;  /*  1432     8 */
	Key_map                    covering_keys_saved;  /*  1440     8 */
	Key_map                    merge_keys_saved;     /*  1448     8 */
	Key_map                    keys_in_use_for_query_saved; /*  1456     8 */
	Key_map                    keys_in_use_for_group_by_saved; /*  1464     8 */
	/* --- cacheline 23 boundary (1472 bytes) --- */
	Key_map                    keys_in_use_for_order_by_saved; /*  1472     8 */
	bool                       nullable_saved;       /*  1480     1 */
	bool                       force_index_saved;    /*  1481     1 */
	bool                       force_index_order_saved; /*  1482     1 */
	bool                       force_index_group_saved; /*  1483     1 */

	/* XXX 4 bytes hole, try to pack */

	struct MY_BITMAP           lock_partitions_saved; /*  1488    32 */
	struct MY_BITMAP           read_set_saved;       /*  1520    32 */
	/* --- cacheline 24 boundary (1536 bytes) was 16 bytes ago --- */
	struct MY_BITMAP           write_set_saved;      /*  1552    32 */
	my_bitmap_map              read_set_small[2];    /*  1584     8 */
	my_bitmap_map              write_set_small[2];   /*  1592     8 */

	/* size: 1600, cachelines: 25, members: 131 */
	/* sum members: 1518, holes: 18, sum holes: 82 */
	/* paddings: 2, sum paddings: 8 */
};
struct My_free_functor {
	void operator()(const class My_free_functor  *, void *, size_t);


	/* size: 1, cachelines: 0, members: 0 */
	/* padding: 1 */
	/* last cacheline: 1 bytes */
};
class Stateless_allocator<char, dd::String_type_alloc, My_free_functor> {
public:

	void Stateless_allocator(class Stateless_allocator<char, dd::String_type_alloc, My_free_functor> *);

	typedef char * pointer;

	pointer address(const class Stateless_allocator<char, dd::String_type_alloc, My_free_functor>  *, reference);

	typedef char & reference;

	typedef const char  * const_pointer;

	const_pointer address(const class Stateless_allocator<char, dd::String_type_alloc, My_free_functor>  *, const_reference);

	typedef const char  & const_reference;

	pointer allocate(class Stateless_allocator<char, dd::String_type_alloc, My_free_functor> *, size_type, const_pointer);

	typedef size_t size_type;

	void deallocate(class Stateless_allocator<char, dd::String_type_alloc, My_free_functor> *, pointer, size_type);

	void destroy(class Stateless_allocator<char, dd::String_type_alloc, My_free_functor> *, pointer);

	size_type max_size(const class Stateless_allocator<char, dd::String_type_alloc, My_free_functor>  *);

	typedef char value_type;

	struct rebind<char> {
		typedef struct Stateless_allocator<char, dd::String_type_alloc, My_free_functor> other;


		/* size: 1, cachelines: 0, members: 0 */
		/* padding: 1 */
		/* last cacheline: 1 bytes */
	};


	/* size: 1, cachelines: 0, members: 0 */
	/* padding: 1 */
	/* last cacheline: 1 bytes */
};
class Discrete_interval {
	ulonglong                  interval_min;         /*     0     8 */
	ulonglong                  interval_values;      /*     8     8 */
	ulonglong                  interval_max;         /*    16     8 */
public:

	class Discrete_interval *  next;                 /*    24     8 */
	bool in_range(const class Discrete_interval  *, ulonglong);

	void replace(class Discrete_interval *, ulonglong, ulonglong, ulonglong);

	void Discrete_interval(class Discrete_interval *, ulonglong, ulonglong, ulonglong);

	void Discrete_interval(class Discrete_interval *);

	ulonglong minimum(const class Discrete_interval  *);

	ulonglong values(const class Discrete_interval  *);

	ulonglong maximum(const class Discrete_interval  *);

	bool merge_if_contiguous(class Discrete_interval *, ulonglong, ulonglong, ulonglong);


	/* size: 32, cachelines: 1, members: 4 */
	/* last cacheline: 32 bytes */
};
class Discrete_intervals_list {
	class Discrete_interval   first_interval;        /*     0    32 */
	class Discrete_interval *  head;                 /*    32     8 */
	class Discrete_interval *  tail;                 /*    40     8 */
	class Discrete_interval *  current;              /*    48     8 */
	uint                       elements;             /*    56     4 */
	void operator=(class Discrete_intervals_list *, class Discrete_intervals_list &);

	bool append(class Discrete_intervals_list *, class Discrete_interval *);

	void copy_shallow(class Discrete_intervals_list *, const class Discrete_intervals_list  *);

	void Discrete_intervals_list(class Discrete_intervals_list *, const class Discrete_intervals_list  &);

public:

	void Discrete_intervals_list(class Discrete_intervals_list *);

	void clear(class Discrete_intervals_list *);

	void swap(class Discrete_intervals_list *, class Discrete_intervals_list *);

	const class Discrete_interval  * get_next(class Discrete_intervals_list *);

	void ~Discrete_intervals_list(class Discrete_intervals_list *, int);

	bool append(class Discrete_intervals_list *, ulonglong, ulonglong, ulonglong);

	ulonglong minimum(const class Discrete_intervals_list  *);

	ulonglong maximum(const class Discrete_intervals_list  *);

	uint nb_elements(const class Discrete_intervals_list  *);


	/* size: 64, cachelines: 1, members: 5 */
	/* padding: 4 */
};
class Locked_tables_list {
	struct MDL_ticket_pair {
		class MDL_ticket *         m_src;                /*     0     8 */
		class MDL_ticket *         m_dst;                /*     8     8 */

		/* size: 16, cachelines: 1, members: 2 */
		/* last cacheline: 16 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	struct MEM_ROOT            m_locked_tables_root; /*     0    80 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	class TABLE_LIST *         m_locked_tables;      /*    80     8 */
	class TABLE_LIST * *       m_locked_tables_last; /*    88     8 */
	class TABLE * *            m_reopen_array;       /*    96     8 */
	size_t                     m_locked_tables_count; /*   104     8 */
	typedef struct vector<Locked_tables_list::MDL_ticket_pair, std::allocator<Locked_tables_list::MDL_ticket_pair> > MDL_ticket_pairs;

	MDL_ticket_pairs           m_rename_tablespace_mdls; /*   112    24 */
public:

	void Locked_tables_list(class Locked_tables_list *);

	void unlock_locked_tables(class Locked_tables_list *, class THD *);

	void ~Locked_tables_list(class Locked_tables_list *, int);

	bool init_locked_tables(class Locked_tables_list *, class THD *);

	class TABLE_LIST * locked_tables(const class Locked_tables_list  *);

	void unlink_from_list(class Locked_tables_list *, const class THD  *, class TABLE_LIST *, bool);

	void unlink_all_closed_tables(class Locked_tables_list *, class THD *, class MYSQL_LOCK *, size_t);

	bool reopen_tables(class Locked_tables_list *, class THD *);

	void rename_locked_table(class Locked_tables_list *, class TABLE_LIST *, const char  *, const char  *, class MDL_ticket *);

	void add_rename_tablespace_mdls(class Locked_tables_list *, class MDL_ticket *, class MDL_ticket *);

	void adjust_renamed_tablespace_mdls(class Locked_tables_list *, class MDL_context *);

	void discard_renamed_tablespace_mdls(class Locked_tables_list *);


	/* size: 136, cachelines: 3, members: 6 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 8 bytes */
};
struct MYSQL_LOCK {
	class TABLE * *            table;                /*     0     8 */
	uint                       table_count;          /*     8     4 */
	uint                       lock_count;           /*    12     4 */
	class THR_LOCK_DATA * *    locks;                /*    16     8 */

	/* size: 24, cachelines: 1, members: 4 */
	/* last cacheline: 24 bytes */
};
class MDL_context {
public:

	void MDL_context(class MDL_context *);

	void destroy(class MDL_context *);

	bool try_acquire_lock(class MDL_context *, class MDL_request *);

	bool acquire_lock(class MDL_context *, class MDL_request *, Timeout_type);

	bool acquire_locks(class MDL_context *, MDL_request_list *, Timeout_type);

	bool upgrade_shared_lock(class MDL_context *, class MDL_ticket *, enum enum_mdl_type, Timeout_type);

	bool clone_ticket(class MDL_context *, class MDL_request *);

	bool clone_tickets(class MDL_context *, const class MDL_context  *, enum enum_mdl_duration);

	void release_all_locks_for_name(class MDL_context *, class MDL_ticket *);

	void release_locks(class MDL_context *, class MDL_release_locks_visitor *);

	void release_lock(class MDL_context *, class MDL_ticket *);

	bool owns_equal_or_stronger_lock(class MDL_context *, const class MDL_key  *, enum enum_mdl_type);

	bool owns_equal_or_stronger_lock(class MDL_context *, enum enum_mdl_namespace, const char  *, const char  *, enum enum_mdl_type);

	bool find_lock_owner(class MDL_context *, const class MDL_key  *, class MDL_context_visitor *);

	bool has_lock(class MDL_context *, const class MDL_savepoint  &, class MDL_ticket *);

	bool has_locks(const class MDL_context  *);

	bool has_locks(const class MDL_context  *, enum enum_mdl_namespace);

	bool has_locks_waited_for(const class MDL_context  *);

	class MDL_savepoint mdl_savepoint(class MDL_context *);

	void set_explicit_duration_for_all_locks(class MDL_context *);

	void set_transaction_duration_for_all_locks(class MDL_context *);

	void set_lock_duration(class MDL_context *, class MDL_ticket *, enum enum_mdl_duration);

	void release_statement_locks(class MDL_context *);

	void release_transactional_locks(class MDL_context *);

	void rollback_to_savepoint(class MDL_context *, const class MDL_savepoint  &);

	class MDL_context_owner * get_owner(const class MDL_context  *);

	uint get_deadlock_weight(const class MDL_context  *);

	void init(class MDL_context *, class MDL_context_owner *);

	void set_needs_thr_lock_abort(class MDL_context *, bool);

	bool get_needs_thr_lock_abort(const class MDL_context  *);

	void set_force_dml_deadlock_weight(class MDL_context *, bool);

	uint get_random(class MDL_context *);

	class THD * get_thd(const class MDL_context  *);

	class MDL_wait            m_wait;                /*     0   112 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 1 boundary (64 bytes) was 48 bytes ago --- */
	class MDL_ticket_store    m_ticket_store;        /*   112    80 */
	/* --- cacheline 3 boundary (192 bytes) --- */
	class MDL_context_owner *  m_owner;              /*   192     8 */
	bool                       m_needs_thr_lock_abort; /*   200     1 */
	bool                       m_force_dml_deadlock_weight; /*   201     1 */

	/* XXX 6 bytes hole, try to pack */

	struct mysql_prlock_t      m_LOCK_waiting_for;   /*   208   120 */
	/* --- cacheline 5 boundary (320 bytes) was 8 bytes ago --- */
	class MDL_wait_for_subgraph * m_waiting_for;     /*   328     8 */
	class LF_PINS *            m_pins;               /*   336     8 */
	uint                       m_rand_state;         /*   344     4 */
	class MDL_ticket * find_ticket(class MDL_context *, class MDL_request *, enum enum_mdl_duration *);

	void release_locks_stored_before(class MDL_context *, enum enum_mdl_duration, class MDL_ticket *);

	void release_lock(class MDL_context *, enum enum_mdl_duration, class MDL_ticket *);

	bool try_acquire_lock_impl(class MDL_context *, class MDL_request *, class MDL_ticket * *);

	void materialize_fast_path_locks(class MDL_context *);

	bool fix_pins(class MDL_context *);

	void find_deadlock(class MDL_context *);

	bool visit_subgraph(class MDL_context *, class MDL_wait_for_graph_visitor *);

	void will_wait_for(class MDL_context *, class MDL_wait_for_subgraph *);

	void done_waiting_for(class MDL_context *);

	void lock_deadlock_victim(class MDL_context *);

	void unlock_deadlock_victim(class MDL_context *);

	void MDL_context(class MDL_context *, const class MDL_context  &);

	class MDL_context & operator=(class MDL_context *, class MDL_context &);

	void ~MDL_context(class MDL_context *, int);


	/* size: 352, cachelines: 6, members: 9 */
	/* sum members: 342, holes: 1, sum holes: 6 */
	/* padding: 4 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 32 bytes */
};
struct PSI_metadata_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	class PSI_metadata_lock *  m_metadata_lock;      /*     8     8 */
	class PSI_thread *         m_thread;             /*    16     8 */
	long long unsigned int     m_timer_start;        /*    24     8 */
	long long unsigned int     (*m_timer)(void);     /*    32     8 */
	void *                     m_wait;               /*    40     8 */

	/* size: 48, cachelines: 1, members: 6 */
	/* sum members: 44, holes: 1, sum holes: 4 */
	/* last cacheline: 48 bytes */
};
struct MDL_key {
	enum enum_mdl_namespace {
		GLOBAL            = 0,
		BACKUP_LOCK       = 1,
		TABLESPACE        = 2,
		SCHEMA            = 3,
		TABLE             = 4,
		FUNCTION          = 5,
		PROCEDURE         = 6,
		TRIGGER           = 7,
		EVENT             = 8,
		COMMIT            = 9,
		USER_LEVEL_LOCK   = 10,
		LOCKING_SERVICE   = 11,
		SRID              = 12,
		ACL_CACHE         = 13,
		COLUMN_STATISTICS = 14,
		RESOURCE_GROUPS   = 15,
		FOREIGN_KEY       = 16,
		CHECK_CONSTRAINT  = 17,
		BACKUP_TABLES     = 18,
		NAMESPACE_END     = 19,
	};

	/* tag__fprintf: const_type tag not supported! */;

	void init_psi_keys(void);

	const uchar  * ptr(const class MDL_key  *);

	uint length(const class MDL_key  *);

	const char  * db_name(const class MDL_key  *);

	uint db_name_length(const class MDL_key  *);

	const char  * name(const class MDL_key  *);

	uint name_length(const class MDL_key  *);

	const char  * col_name(const class MDL_key  *);

	uint col_name_length(const class MDL_key  *);

	enum enum_mdl_namespace mdl_namespace(const class MDL_key  *);

	void mdl_key_init(class MDL_key *, enum enum_mdl_namespace, const char  *, const char  *);

	void mdl_key_init(class MDL_key *, enum enum_mdl_namespace, const char  *, const char  *, const char  *);

	void mdl_key_init(class MDL_key *, enum enum_mdl_namespace, const char  *, const char  *, size_t, const char  *);

	void mdl_key_init(class MDL_key *, enum enum_mdl_namespace, const char  *, size_t, size_t);

	void mdl_key_init(class MDL_key *, const class MDL_key  *);

	void reset(class MDL_key *);

	bool is_equal(const class MDL_key  *, const class MDL_key  *);

	int cmp(const class MDL_key  *, const class MDL_key  *);

	void MDL_key(class MDL_key *, const class MDL_key  &);

	class MDL_key & operator=(class MDL_key *, const class MDL_key  &);

	void MDL_key(class MDL_key *, enum enum_mdl_namespace, const char  *, const char  *);

	void MDL_key(class MDL_key *);

	const PSI_stage_info  * get_wait_state_name(const class MDL_key  *);

private:

	bool use_normalized_object_name(const class MDL_key  *);

	uint16                     m_length;             /*     0     2 */
	uint16                     m_db_name_length;     /*     2     2 */
	uint16                     m_object_name_length; /*     4     2 */
	char                       m_ptr[387];           /*     6   387 */

	/* Bitfield combined with previous fields */

	static PSI_stage_info             m_namespace_to_wait_state_name[19]; /*     0     0 */

	/* size: 394, cachelines: 7, members: 4, static members: 1 */
	/* padding: 1 */
	/* last cacheline: 10 bytes */
};
class I_P_List_null_counter {
protected:

	void reset(class I_P_List_null_counter *);

	void inc(class I_P_List_null_counter *);

	void dec(class I_P_List_null_counter *);

	void swap(class I_P_List_null_counter *, class I_P_List_null_counter &);


	/* size: 1, cachelines: 0, members: 0 */
	/* padding: 1 */
	/* last cacheline: 1 bytes */
};
class I_P_List_counter {
	uint                       m_counter;            /*     0     4 */
protected:

	void I_P_List_counter(class I_P_List_counter *);

	void reset(class I_P_List_counter *);

	void inc(class I_P_List_counter *);

	void dec(class I_P_List_counter *);

	void swap(class I_P_List_counter *, class I_P_List_counter &);

public:

	uint elements(const class I_P_List_counter  *);


	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
class MDL_request {
public:

	enum enum_mdl_type         type;                 /*     0     4 */
	enum enum_mdl_duration     duration;             /*     4     4 */
	class MDL_request *        next_in_list;         /*     8     8 */
	class MDL_request * *      prev_in_list;         /*    16     8 */
	class MDL_ticket *         ticket;               /*    24     8 */
	struct MDL_key             key;                  /*    32   394 */

	/* XXX last struct has 1 byte of padding */
	/* XXX 6 bytes hole, try to pack */

	/* --- cacheline 6 boundary (384 bytes) was 48 bytes ago --- */
	const char  *              m_src_file;           /*   432     8 */
	uint                       m_src_line;           /*   440     4 */
	void * operator new(size_t, class MEM_ROOT *, const class nothrow_t  &);

	void operator delete(void *, class MEM_ROOT *, const class nothrow_t  &);

	void init_with_source(class MDL_request *, enum enum_mdl_namespace, const char  *, const char  *, enum enum_mdl_type, enum enum_mdl_duration, const char  *, uint);

	void init_by_key_with_source(class MDL_request *, const class MDL_key  *, enum enum_mdl_type, enum enum_mdl_duration, const char  *, uint);

	void init_by_part_key_with_source(class MDL_request *, enum enum_mdl_namespace, const char  *, size_t, size_t, enum enum_mdl_type, enum enum_mdl_duration, const char  *, uint);

	void set_type(class MDL_request *, enum enum_mdl_type);

	bool is_write_lock_request(const class MDL_request  *);

	bool is_ddl_or_lock_tables_lock_request(const class MDL_request  *);

	void MDL_request(class MDL_request *);

	void MDL_request(class MDL_request *, const class MDL_request  &);

	void MDL_request(class MDL_request *, );

	class MDL_request & operator=(class MDL_request *, );


	/* size: 448, cachelines: 7, members: 8 */
	/* sum members: 438, holes: 1, sum holes: 6 */
	/* padding: 4 */
	/* paddings: 1, sum paddings: 1 */
};
class MDL_ticket_store {
	struct MDL_ticket_handle {
		enum enum_mdl_duration     m_dur;                /*     0     4 */

		/* XXX 4 bytes hole, try to pack */

		class MDL_ticket *         m_ticket;             /*     8     8 */
		void MDL_ticket_handle(class MDL_ticket_handle *);

		void MDL_ticket_handle(class MDL_ticket_handle *, class MDL_ticket *, enum enum_mdl_duration);


		/* size: 16, cachelines: 1, members: 2 */
		/* sum members: 12, holes: 1, sum holes: 4 */
		/* last cacheline: 16 bytes */
	};

	struct Duration {
		Ticket_p_list              m_ticket_list;        /*     0     8 */
		class MDL_ticket *         m_mat_front;          /*     8     8 */

		/* size: 16, cachelines: 1, members: 2 */
		/* last cacheline: 16 bytes */
	};

	typedef struct I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_null_counter, I_P_List_no_push_back<MDL_ticket> > Ticket_p_list;

	struct Hash {
		size_t operator()(const class Hash  *, const class MDL_key  *);


		/* size: 1, cachelines: 0, members: 0 */
		/* padding: 1 */
		/* last cacheline: 1 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	struct Key_equal {
		bool operator()(const class Key_equal  *, const class MDL_key  *, const class MDL_key  *);


		/* size: 1, cachelines: 0, members: 0 */
		/* padding: 1 */
		/* last cacheline: 1 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	struct Duration            m_durations[3];       /*     0    48 */
	const size_t               THRESHOLD;            /*    48     8 */
	const size_t               INITIAL_BUCKET_COUNT; /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	size_t                     m_count;              /*    64     8 */
	class unique_ptr<std::unordered_multimap<const MDL_key*, MDL_ticket_store::MDL_ticket_handle, MDL_ticket_store::Hash, MDL_ticket_store::Key_equal, std::allocator<std::pair<const MDL_key* const, MDL_ticket_store::MDL_ticket_handle> > >, std::default_delete<std::unordered_multimap<const MDL_key*, MDL_ticket_store::MDL_ticket_handle, MDL_ticket_store::Hash, MDL_ticket_store::Key_equal, std::allocator<std::pair<const MDL_key* const, MDL_ticket_store::MDL_ticket_handle> > > > > m_map; /*    72     8 */
	class MDL_ticket_handle find_in_lists(const class MDL_ticket_store  *, const class MDL_request  &);

	class MDL_ticket_handle find_in_hash(const class MDL_ticket_store  *, const class MDL_request  &);

public:

	void MDL_ticket_store(class MDL_ticket_store *);

	bool is_empty(const class MDL_ticket_store  *);

	bool is_empty(const class MDL_ticket_store  *, int);

	class MDL_ticket * front(class MDL_ticket_store *, int);

	void push_front(class MDL_ticket_store *, enum enum_mdl_duration, class MDL_ticket *);

	void remove(class MDL_ticket_store *, enum enum_mdl_duration, class MDL_ticket *);

	typedef Iterator List_iterator;

	List_iterator list_iterator(const class MDL_ticket_store  *, int);

	void move_all_to_explicit_duration(class MDL_ticket_store *);

	void move_explicit_to_transaction_duration(class MDL_ticket_store *);

	class MDL_ticket_handle find(const class MDL_ticket_store  *, const class MDL_request  &);

	void set_materialized(class MDL_ticket_store *);

	class MDL_ticket * materialized_front(class MDL_ticket_store *, int);

	void ~MDL_ticket_store(class MDL_ticket_store *, int);


	/* size: 80, cachelines: 2, members: 5 */
	/* last cacheline: 16 bytes */
};
class I_P_List_no_push_back<MDL_ticket> {
protected:

	void I_P_List_no_push_back(class I_P_List_no_push_back<MDL_ticket> *, class MDL_ticket * *);

	void set_last(class I_P_List_no_push_back<MDL_ticket> *, class MDL_ticket * *);

	void swap(class I_P_List_no_push_back<MDL_ticket> *, class I_P_List_no_push_back<MDL_ticket> &);


	/* size: 1, cachelines: 0, members: 0 */
	/* padding: 1 */
	/* last cacheline: 1 bytes */
};
class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_null_counter, I_P_List_no_push_back<MDL_ticket> > : public I_P_List_null_counter, public I_P_List_no_push_back<MDL_ticket> {
public:

	/* class I_P_List_null_counter <ancestor>; */    /*     0     0 */

	/* XXX last struct has 1 byte of padding */

	/* class I_P_List_no_push_back<MDL_ticket> <ancestor>; */ /*     0     0 */

	/* XXX last struct has 1 byte of padding */

	class MDL_ticket *         m_first;              /*     0     8 */
	void I_P_List(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n);

	void clear(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n);

	bool is_empty(const class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_);

	void push_front(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n, class MDL_ticket *);

	void push_back(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n, class MDL_ticket *);

	void insert_after(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n, class MDL_ticket *, class MDL_ticket *);

	void remove(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n, class MDL_ticket *);

	class MDL_ticket * front(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n);

	const class MDL_ticket  * front(const class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_);

	class MDL_ticket * pop_front(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n);

	void swap(class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n, class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_n);

	typedef struct I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_null_counter, I_P_List_no_push_back<MDL_ticket> > > Iterator;


	/* size: 8, cachelines: 1, members: 3 */
	/* paddings: 2, sum paddings: 2 */
	/* last cacheline: 8 bytes */
};
struct I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context> {
	class MDL_ticket * * next_ptr(class MDL_ticket *);

	const class MDL_ticket  * const * next_ptr(const class MDL_ticket  *);

	class MDL_ticket * * * prev_ptr(class MDL_ticket *);


	/* size: 1, cachelines: 0, members: 0 */
	/* padding: 1 */
	/* last cacheline: 1 bytes */
};
class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_List_null_counter, I_P_List_no_push_back<MDL_ticket> > > {
	const class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_ list; /*     0     8 */
	class MDL_ticket *         current;              /*     8     8 */
public:

	void I_P_List_iterator(class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket, const class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_);

	void I_P_List_iterator(class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket, const class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_, class MDL_ticket *);

	void init(class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket, const class I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket::prev_in_context>, I_P_);

	class MDL_ticket * operator++(class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket, int);

	class MDL_ticket * operator++(class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket);

	void rewind(class I_P_List_iterator<MDL_ticket, I_P_List<MDL_ticket, I_P_List_adapter<MDL_ticket, &MDL_ticket::next_in_context, &MDL_ticket);


	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
class MDL_savepoint {
public:

	void MDL_savepoint(class MDL_savepoint *);

	void MDL_savepoint(class MDL_savepoint *, class MDL_ticket *, class MDL_ticket *);

	class MDL_ticket *         m_stmt_ticket;        /*     0     8 */
	class MDL_ticket *         m_trans_ticket;       /*     8     8 */

	/* size: 16, cachelines: 1, members: 2 */
	/* last cacheline: 16 bytes */
};
class MDL_wait {
	enum enum_wait_status {
		WS_EMPTY = 0,
		GRANTED  = 1,
		VICTIM   = 2,
		TIMEOUT  = 3,
		KILLED   = 4,
	};

public:

	void MDL_wait(class MDL_wait *);

	void ~MDL_wait(class MDL_wait *, int);

	bool set_status(class MDL_wait *, enum enum_wait_status);

	enum enum_wait_status get_status(class MDL_wait *);

	void reset_status(class MDL_wait *);

	enum enum_wait_status timed_wait(class MDL_wait *, class MDL_context_owner *, class timespec *, bool, const PSI_stage_info  *);

	struct mysql_mutex_t       m_LOCK_wait_status;   /*     0    48 */
	struct mysql_cond_t        m_COND_wait_status;   /*    48    56 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	enum enum_wait_status      m_wait_status;        /*   104     4 */

	/* size: 112, cachelines: 2, members: 3 */
	/* padding: 4 */
	/* last cacheline: 48 bytes */
};
class MDL_context_owner {
public:

	void MDL_context_owner(class MDL_context_owner *, const class MDL_context_owner  &);

	void MDL_context_owner(class MDL_context_owner *);

	class MDL_context_owner & operator=(class MDL_context_owner *, const class MDL_context_owner  &);

	int ()(void) * *           _vptr.MDL_context_owner; /*     0     8 */
	virtual void ~MDL_context_owner(class MDL_context_owner *, int);

	virtual void enter_cond(class MDL_context_owner *, class mysql_cond_t *, class mysql_mutex_t *, const PSI_stage_info  *, PSI_stage_info *, const char  *, const char  *, int);

	virtual void exit_cond(class MDL_context_owner *, const PSI_stage_info  *, const char  *, const char  *, int);

	virtual int is_killed(const class MDL_context_owner  *);

	virtual bool is_connected(class MDL_context_owner *);

	virtual bool might_have_commit_order_waiters(const class MDL_context_owner  *);

	virtual class THD * get_thd(class MDL_context_owner *);

	virtual void notify_shared_lock(class MDL_context_owner *, class MDL_context_owner *, bool);

	virtual bool notify_hton_pre_acquire_exclusive(class MDL_context_owner *, const class MDL_key  *, bool *);

	virtual void notify_hton_post_release_exclusive(class MDL_context_owner *, const class MDL_key  *);

	virtual uint get_rand_seed(const class MDL_context_owner  *);

	/* vtable has 10 entries: {
	   [2] = enter_cond((null)), 
	   [3] = exit_cond((null)), 
	   [4] = is_killed((null)), 
	   [5] = is_connected((null)), 
	   [6] = might_have_commit_order_waiters((null)), 
	   [7] = get_thd((null)), 
	   [8] = notify_shared_lock((null)), 
	   [9] = notify_hton_pre_acquire_exclusive((null)), 
	   [10] = notify_hton_post_release_exclusive((null)), 
	   [11] = get_rand_seed((null)), 
	} */
	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
class MDL_context_visitor {
public:

	void MDL_context_visitor(class MDL_context_visitor *, const class MDL_context_visitor  &);

	void MDL_context_visitor(class MDL_context_visitor *);

	int ()(void) * *           _vptr.MDL_context_visitor; /*     0     8 */
	virtual void ~MDL_context_visitor(class MDL_context_visitor *, int);

	virtual void visit_context(class MDL_context_visitor *, const class MDL_context  *);

	/* vtable has 1 entries: {
	   [2] = visit_context((null)), 
	} */
	/* size: 8, cachelines: 1, members: 1 */
	/* last cacheline: 8 bytes */
};
struct LF_PINS {
	struct atomic<void*>       pin[4];               /*     0    32 */
	class LF_PINBOX *          pinbox;               /*    32     8 */
	void *                     purgatory;            /*    40     8 */
	uint64                     purgatory_count;      /*    48     8 */
	struct atomic<long unsigned int> link __attribute__((__aligned__(8))); /*    56     8 */

	/* size: 64, cachelines: 1, members: 5 */
	/* forced alignments: 1 */
} __attribute__((__aligned__(8)));
class Cost_model_table {
public:

	void Cost_model_table(class Cost_model_table *);

	void init(class Cost_model_table *, const class Cost_model_server  *, const class TABLE  *);

	double row_evaluate_cost(const class Cost_model_table  *, double);

	double key_compare_cost(const class Cost_model_table  *, double);

	double io_block_read_cost(const class Cost_model_table  *, double);

	double buffer_block_read_cost(const class Cost_model_table  *, double);

	double page_read_cost(const class Cost_model_table  *, double);

	double page_read_cost_index(const class Cost_model_table  *, uint, double);

	double disk_seek_base_cost(const class Cost_model_table  *);

	double disk_seek_prop_cost(const class Cost_model_table  *);

	double disk_seek_cost(const class Cost_model_table  *, double);

protected:

	const class Cost_model_server  * m_cost_model_server; /*     0     8 */
	const class SE_cost_constants  * m_se_cost_constants; /*     8     8 */
	const class TABLE  *       m_table;              /*    16     8 */

	/* size: 24, cachelines: 1, members: 3 */
	/* last cacheline: 24 bytes */
};
class Prealloced_array<Opt_trace_stmt*, 16> {
	struct External {
		class Opt_trace_stmt * *   m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		class Opt_trace_stmt *     m_buff[16];           /*     0   128 */
	};

	static const bool                 Has_trivial_destructor = 1; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	class Opt_trace_stmt * * buffer(class Prealloced_array<Opt_trace_stmt*, 16> *);

	class Opt_trace_stmt * const * buffer(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	void set_size(class Prealloced_array<Opt_trace_stmt*, 16> *, size_t);

	void adjust_size(class Prealloced_array<Opt_trace_stmt*, 16> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, const class Prealloced_array<Opt_trace_stmt*, 16>  &);

	void Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, );

	void Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, PSI_memory_key, const_iterator, const_iterator);

	typedef class Opt_trace_stmt * const * const_iterator;

	void Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, class initializer_list<Opt_trace_stmt*>);

	class Prealloced_array<Opt_trace_stmt*, 16> & operator=(class Prealloced_array<Opt_trace_stmt*, 16> *, const class Prealloced_array<Opt_trace_stmt*, 16>  &);

	class Prealloced_array<Opt_trace_stmt*, 16> & operator=(class Prealloced_array<Opt_trace_stmt*, 16> *, );

	void ~Prealloced_array(class Prealloced_array<Opt_trace_stmt*, 16> *, int);

	size_t capacity(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	size_t element_size(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	bool empty(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	size_t size(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	class Opt_trace_stmt * & at(class Prealloced_array<Opt_trace_stmt*, 16> *, size_t);

	class Opt_trace_stmt * const & at(const class Prealloced_array<Opt_trace_stmt*, 16>  *, size_t);

	class Opt_trace_stmt * & operator[](class Prealloced_array<Opt_trace_stmt*, 16> *, size_t);

	class Opt_trace_stmt * const & operator[](const class Prealloced_array<Opt_trace_stmt*, 16>  *, size_t);

	class Opt_trace_stmt * & back(class Prealloced_array<Opt_trace_stmt*, 16> *);

	class Opt_trace_stmt * const & back(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	class Opt_trace_stmt * & front(class Prealloced_array<Opt_trace_stmt*, 16> *);

	class Opt_trace_stmt * const & front(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	typedef class Opt_trace_stmt * * iterator;

	iterator begin(class Prealloced_array<Opt_trace_stmt*, 16> *);

	iterator end(class Prealloced_array<Opt_trace_stmt*, 16> *);

	const_iterator begin(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	const_iterator end(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	const_iterator cbegin(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	const_iterator cend(const class Prealloced_array<Opt_trace_stmt*, 16>  *);

	bool assign_at(class Prealloced_array<Opt_trace_stmt*, 16> *, size_t, const value_type  &);

	typedef class Opt_trace_stmt * value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<Opt_trace_stmt*, 16> *, size_t);

	bool push_back(class Prealloced_array<Opt_trace_stmt*, 16> *, class Opt_trace_stmt * const &);

	bool push_back(class Prealloced_array<Opt_trace_stmt*, 16> *, );

	void pop_back(class Prealloced_array<Opt_trace_stmt*, 16> *);

	iterator insert(class Prealloced_array<Opt_trace_stmt*, 16> *, const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<Opt_trace_stmt*, 16> *, const_iterator, );

	class pair<Opt_trace_stmt**, bool> insert_unique(class Prealloced_array<Opt_trace_stmt*, 16> *, const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<Opt_trace_stmt*, 16> *, const value_type  &);

	size_type count_unique(const class Prealloced_array<Opt_trace_stmt*, 16>  *, const value_type  &);

	iterator erase(class Prealloced_array<Opt_trace_stmt*, 16> *, const_iterator);

	iterator erase(class Prealloced_array<Opt_trace_stmt*, 16> *, size_t);

	void erase_at_end(class Prealloced_array<Opt_trace_stmt*, 16> *, const_iterator);

	iterator erase(class Prealloced_array<Opt_trace_stmt*, 16> *, const_iterator, const_iterator);

	void swap(class Prealloced_array<Opt_trace_stmt*, 16> *, class Prealloced_array<Opt_trace_stmt*, 16> &);

	void shrink_to_fit(class Prealloced_array<Opt_trace_stmt*, 16> *);

	void resize(class Prealloced_array<Opt_trace_stmt*, 16> *, size_t, class Opt_trace_stmt * const &);

	void clear(class Prealloced_array<Opt_trace_stmt*, 16> *);

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		class Opt_trace_stmt * m_buff[16];       /*     8   128 */
	};                                               /*     8   128 */

	/* size: 136, cachelines: 3, members: 3, static members: 2 */
	/* last cacheline: 8 bytes */
};
class Opt_trace_context {
	enum feature_value {
		GREEDY_SEARCH      = 1,
		RANGE_OPTIMIZER    = 2,
		DYNAMIC_RANGE      = 4,
		REPEATED_SUBSELECT = 8,
		MISC               = 128,
	};

	/* tag__fprintf: const_type tag not supported! */;

	class Opt_trace_context_impl {
	public:

		void Opt_trace_context_impl(class Opt_trace_context_impl *);

		void disable_I_S_for_this_and_children(class Opt_trace_context_impl *);

		void restore_I_S(class Opt_trace_context_impl *);

		class Opt_trace_stmt *     current_stmt_in_gen;  /*     0     8 */
		Opt_trace_stmt_array       stack_of_current_stmts; /*     8   136 */
		/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
		Opt_trace_stmt_array       all_stmts_for_I_S;    /*   144   136 */
		/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
		Opt_trace_stmt_array       all_stmts_to_del;     /*   280   136 */
		/* --- cacheline 6 boundary (384 bytes) was 32 bytes ago --- */
		bool                       end_marker;           /*   416     1 */
		bool                       one_line;             /*   417     1 */

		/* XXX 2 bytes hole, try to pack */

		enum feature_value         features;             /*   420     4 */
		long int                   offset;               /*   424     8 */
		long int                   limit;                /*   432     8 */
		size_t                     max_mem_size;         /*   440     8 */
		/* --- cacheline 7 boundary (448 bytes) --- */
		long int                   since_offset_0;       /*   448     8 */

		/* size: 456, cachelines: 8, members: 11 */
		/* sum members: 454, holes: 1, sum holes: 2 */
		/* last cacheline: 8 bytes */
	};

public:

	void Opt_trace_context(class Opt_trace_context *);

	void ~Opt_trace_context(class Opt_trace_context *, int);

	bool start(class Opt_trace_context *, bool, bool, bool, bool, long int, long int, ulong, ulonglong);

	void end(class Opt_trace_context *);

	bool is_started(const class Opt_trace_context  *);

	bool support_I_S(const class Opt_trace_context  *);

	void set_query(class Opt_trace_context *, const char  *, size_t, const class CHARSET_INFO  *);

	void reset(class Opt_trace_context *);

	bool get_end_marker(const class Opt_trace_context  *);

	bool get_one_line(const class Opt_trace_context  *);

	static const char  *              flag_names[0]; /*     0     0 */
	static const char  *              feature_names[0]; /*     0     0 */
	void missing_privilege(class Opt_trace_context *);

	static const enum feature_value   default_features; /*     0     0 */
	bool feature_enabled(const class Opt_trace_context  *, enum feature_value);

	class Opt_trace_stmt * get_current_stmt_in_gen(class Opt_trace_context *);

	const class Opt_trace_stmt  * get_next_stmt_for_I_S(const class Opt_trace_context  *, long int *);

	void disable_I_S_for_this_and_children(class Opt_trace_context *);

	void restore_I_S(class Opt_trace_context *);

	class Opt_trace_context_impl * pimpl;            /*     0     8 */
	int                        I_S_disabled;         /*     8     4 */
	void purge_stmts(class Opt_trace_context *, bool);

	size_t allowed_mem_size_for_current_stmt(const class Opt_trace_context  *);

	void Opt_trace_context(class Opt_trace_context *, const class Opt_trace_context  &);

	class Opt_trace_context & operator=(class Opt_trace_context *, const class Opt_trace_context  &);


	/* size: 16, cachelines: 1, members: 2, static members: 3 */
	/* padding: 4 */
	/* last cacheline: 16 bytes */
};
struct PSI_cond_info_v1 {
	PSI_cond_key *             m_key;                /*     0     8 */
	const char  *              m_name;               /*     8     8 */
	unsigned int               m_flags;              /*    16     4 */
	int                        m_volatility;         /*    20     4 */
	const char  *              m_documentation;      /*    24     8 */

	/* size: 32, cachelines: 1, members: 5 */
	/* last cacheline: 32 bytes */
};
struct PSI_cond_locker_state_v1 {
	unsigned int               m_flags;              /*     0     4 */
	enum PSI_cond_operation    m_operation;          /*     4     4 */
	class PSI_cond *           m_cond;               /*     8     8 */
	class PSI_mutex *          m_mutex;              /*    16     8 */
	class PSI_thread *         m_thread;             /*    24     8 */
	long long unsigned int     m_timer_start;        /*    32     8 */
	long long unsigned int     (*m_timer)(void);     /*    40     8 */
	void *                     m_wait;               /*    48     8 */

	/* size: 56, cachelines: 1, members: 8 */
	/* last cacheline: 56 bytes */
};
struct PSI_cond_service_v1 {
	register_cond_v1_t         register_cond;        /*     0     8 */
	init_cond_v1_t             init_cond;            /*     8     8 */
	destroy_cond_v1_t          destroy_cond;         /*    16     8 */
	signal_cond_v1_t           signal_cond;          /*    24     8 */
	broadcast_cond_v1_t        broadcast_cond;       /*    32     8 */
	start_cond_wait_v1_t       start_cond_wait;      /*    40     8 */
	end_cond_wait_v1_t         end_cond_wait;        /*    48     8 */

	/* size: 56, cachelines: 1, members: 7 */
	/* last cacheline: 56 bytes */
};
class Checkable_rwlock {
public:

	void Checkable_rwlock(class Checkable_rwlock *, PSI_rwlock_key);

	void ~Checkable_rwlock(class Checkable_rwlock *, int);

	void rdlock(class Checkable_rwlock *);

	void wrlock(class Checkable_rwlock *);

	void unlock(class Checkable_rwlock *);

	bool is_wrlock(class Checkable_rwlock *);

	int trywrlock(class Checkable_rwlock *);

	int tryrdlock(class Checkable_rwlock *);

	void assert_some_lock(const class Checkable_rwlock  *);

	void assert_some_rdlock(const class Checkable_rwlock  *);

	void assert_some_wrlock(const class Checkable_rwlock  *);

	void assert_no_wrlock(const class Checkable_rwlock  *);

	void assert_no_rdlock(const class Checkable_rwlock  *);

	void assert_no_lock(const class Checkable_rwlock  *);

	bool                       m_is_write_lock;      /*     0     1 */

	/* XXX 7 bytes hole, try to pack */

	struct mysql_rwlock_t      m_rwlock;             /*     8    64 */

	/* size: 72, cachelines: 2, members: 2 */
	/* sum members: 65, holes: 1, sum holes: 7 */
	/* last cacheline: 8 bytes */
};
class Gtid_mode {
	enum value_type {
		OFF            = 0,
		DEFAULT        = 0,
		OFF_PERMISSIVE = 1,
		ON_PERMISSIVE  = 2,
		ON             = 3,
	};

	struct atomic<int>         m_atomic_mode __attribute__((__aligned__(4))); /*     0     4 */
public:

	void Gtid_mode(class Gtid_mode *);

	static ulong                      sysvar_mode;   /*     0     0 */
	static const char  *              names[0];      /*     0     0 */
	static class Checkable_rwlock    lock;           /*     0     0 */
	void set(class Gtid_mode *, enum value_type);

	enum value_type get(const class Gtid_mode  *);

	class pair<bool, Gtid_mode::value_type> from_string(string);

	const char  * to_string(enum value_type);


	/* size: 4, cachelines: 1, members: 1, static members: 3 */
	/* forced alignments: 1 */
	/* last cacheline: 4 bytes */
} __attribute__((__aligned__(4)));
class Sid_map {
	struct Node {
		rpl_sidno                  sidno;                /*     0     4 */
		rpl_sid                    sid;                  /*     4    16 */

		/* size: 20, cachelines: 1, members: 2 */
		/* last cacheline: 20 bytes */
	};

public:

	void Sid_map(class Sid_map *, class Checkable_rwlock *);

	void ~Sid_map(class Sid_map *, int);

	enum enum_return_status clear(class Sid_map *);

	rpl_sidno add_sid(class Sid_map *, const rpl_sid  &);

	rpl_sidno sid_to_sidno(const class Sid_map  *, const rpl_sid  &);

	const rpl_sid  & sidno_to_sid(const class Sid_map  *, rpl_sidno, bool);

	rpl_sidno get_sorted_sidno(const class Sid_map  *, rpl_sidno);

	rpl_sidno get_max_sidno(const class Sid_map  *);

	class Checkable_rwlock * get_sid_lock(const class Sid_map  *);

	enum enum_return_status copy(class Sid_map *, class Sid_map *);

	const uchar  * sid_map_get_key(const uchar  *, size_t *);

	enum enum_return_status add_node(class Sid_map *, rpl_sidno, const rpl_sid  &);

	class Checkable_rwlock *   sid_lock;             /*     0     8 */
	class Prealloced_array<Sid_map::Node*, 8> _sidno_to_sid; /*     8    72 */
	/* --- cacheline 1 boundary (64 bytes) was 16 bytes ago --- */
	class malloc_unordered_map<binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter>, binary_log::Hash_Uuid, std::equal_to<binary_log::Uuid> > _sid_to_sidno; /*    80    64 */
	/* --- cacheline 2 boundary (128 bytes) was 16 bytes ago --- */
	class Prealloced_array<int, 8> _sorted;          /*   144    40 */

	/* size: 184, cachelines: 3, members: 4 */
	/* last cacheline: 56 bytes */
};
class Prealloced_array<Sid_map::Node*, 8> {
	struct External {
		class Node * *             m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		class Node *               m_buff[8];            /*     0    64 */
	};

	static const bool                 Has_trivial_destructor; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<Sid_map::Node*, 8>  *);

	class Node * * buffer(class Prealloced_array<Sid_map::Node*, 8> *);

	class Node * const * buffer(const class Prealloced_array<Sid_map::Node*, 8>  *);

	void set_size(class Prealloced_array<Sid_map::Node*, 8> *, size_t);

	void adjust_size(class Prealloced_array<Sid_map::Node*, 8> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, const class Prealloced_array<Sid_map::Node*, 8>  &);

	void Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, );

	void Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, PSI_memory_key, const_iterator, const_iterator);

	typedef class Node * const * const_iterator;

	void Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, class initializer_list<Sid_map::Node*>);

	class Prealloced_array<Sid_map::Node*, 8> & operator=(class Prealloced_array<Sid_map::Node*, 8> *, const class Prealloced_array<Sid_map::Node*, 8>  &);

	class Prealloced_array<Sid_map::Node*, 8> & operator=(class Prealloced_array<Sid_map::Node*, 8> *, );

	void ~Prealloced_array(class Prealloced_array<Sid_map::Node*, 8> *, int);

	size_t capacity(const class Prealloced_array<Sid_map::Node*, 8>  *);

	size_t element_size(const class Prealloced_array<Sid_map::Node*, 8>  *);

	bool empty(const class Prealloced_array<Sid_map::Node*, 8>  *);

	size_t size(const class Prealloced_array<Sid_map::Node*, 8>  *);

	class Node * & at(class Prealloced_array<Sid_map::Node*, 8> *, size_t);

	class Node * const & at(const class Prealloced_array<Sid_map::Node*, 8>  *, size_t);

	class Node * & operator[](class Prealloced_array<Sid_map::Node*, 8> *, size_t);

	class Node * const & operator[](const class Prealloced_array<Sid_map::Node*, 8>  *, size_t);

	class Node * & back(class Prealloced_array<Sid_map::Node*, 8> *);

	class Node * const & back(const class Prealloced_array<Sid_map::Node*, 8>  *);

	class Node * & front(class Prealloced_array<Sid_map::Node*, 8> *);

	class Node * const & front(const class Prealloced_array<Sid_map::Node*, 8>  *);

	typedef class Node * * iterator;

	iterator begin(class Prealloced_array<Sid_map::Node*, 8> *);

	iterator end(class Prealloced_array<Sid_map::Node*, 8> *);

	const_iterator begin(const class Prealloced_array<Sid_map::Node*, 8>  *);

	const_iterator end(const class Prealloced_array<Sid_map::Node*, 8>  *);

	const_iterator cbegin(const class Prealloced_array<Sid_map::Node*, 8>  *);

	const_iterator cend(const class Prealloced_array<Sid_map::Node*, 8>  *);

	bool assign_at(class Prealloced_array<Sid_map::Node*, 8> *, size_t, const value_type  &);

	typedef class Node * value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<Sid_map::Node*, 8> *, size_t);

	bool push_back(class Prealloced_array<Sid_map::Node*, 8> *, class Node * const &);

	bool push_back(class Prealloced_array<Sid_map::Node*, 8> *, );

	void pop_back(class Prealloced_array<Sid_map::Node*, 8> *);

	iterator insert(class Prealloced_array<Sid_map::Node*, 8> *, const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<Sid_map::Node*, 8> *, const_iterator, );

	class pair<Sid_map::Node**, bool> insert_unique(class Prealloced_array<Sid_map::Node*, 8> *, const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<Sid_map::Node*, 8> *, const value_type  &);

	size_type count_unique(const class Prealloced_array<Sid_map::Node*, 8>  *, const value_type  &);

	iterator erase(class Prealloced_array<Sid_map::Node*, 8> *, const_iterator);

	iterator erase(class Prealloced_array<Sid_map::Node*, 8> *, size_t);

	void erase_at_end(class Prealloced_array<Sid_map::Node*, 8> *, const_iterator);

	iterator erase(class Prealloced_array<Sid_map::Node*, 8> *, const_iterator, const_iterator);

	void swap(class Prealloced_array<Sid_map::Node*, 8> *, class Prealloced_array<Sid_map::Node*, 8> &);

	void shrink_to_fit(class Prealloced_array<Sid_map::Node*, 8> *);

	void resize(class Prealloced_array<Sid_map::Node*, 8> *, size_t, class Node * const &);

	void clear(class Prealloced_array<Sid_map::Node*, 8> *);

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		class Node *       m_buff[8];            /*     8    64 */
	};                                               /*     8    64 */

	/* size: 72, cachelines: 2, members: 3, static members: 2 */
	/* last cacheline: 8 bytes */
};
class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > {
	PSI_memory_key             m_key;                /*     0     4 */
	typedef class pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > * pointer;

public:

	pointer address(const class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > >  *, reference);

	typedef class pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > & reference;

	typedef const class pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >  * const_pointer;

	const_pointer address(const class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > >  *, const_reference);

	typedef const class pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >  & const_reference;

	void Malloc_allocator(class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > *, PSI_memory_key);

	pointer allocate(class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > *, size_type, const_pointer);

	typedef size_t size_type;

	void deallocate(class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > *, pointer, size_type);

	void destroy(class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > *, pointer);

	size_type max_size(const class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > >  *);

	PSI_memory_key psi_key(const class Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > >  *);


	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >, true> > {
	PSI_memory_key             m_key;                /*     0     4 */
	typedef class _Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >, true> * pointer;

public:

	pointer address(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free, reference);

	typedef class _Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >, true> & reference;

	typedef const class _Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >, true>  * const_pointer;

	const_pointer address(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free, const_reference);

	typedef const class _Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >, true>  & const_reference;

	void Malloc_allocator(class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_delet, PSI_memory_key);

	pointer allocate(class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_delet, size_type, const_pointer);

	typedef size_t size_type;

	void deallocate(class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_delet, pointer, size_type);

	void destroy(class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_delet, pointer);

	size_type max_size(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free);

	PSI_memory_key psi_key(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free);

	typedef struct _Hash_node<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> >, true> value_type;


	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
class Malloc_allocator<std::__detail::_Hash_node_base*> {
	PSI_memory_key             m_key;                /*     0     4 */
	typedef class _Hash_node_base * * pointer;

public:

	pointer address(const class Malloc_allocator<std::__detail::_Hash_node_base*>  *, reference);

	typedef class _Hash_node_base * & reference;

	typedef class _Hash_node_base * const * const_pointer;

	const_pointer address(const class Malloc_allocator<std::__detail::_Hash_node_base*>  *, const_reference);

	typedef class _Hash_node_base * const & const_reference;

	void Malloc_allocator(class Malloc_allocator<std::__detail::_Hash_node_base*> *, PSI_memory_key);

	pointer allocate(class Malloc_allocator<std::__detail::_Hash_node_base*> *, size_type, const_pointer);

	typedef size_t size_type;

	void deallocate(class Malloc_allocator<std::__detail::_Hash_node_base*> *, pointer, size_type);

	void destroy(class Malloc_allocator<std::__detail::_Hash_node_base*> *, pointer);

	size_type max_size(const class Malloc_allocator<std::__detail::_Hash_node_base*>  *);

	PSI_memory_key psi_key(const class Malloc_allocator<std::__detail::_Hash_node_base*>  *);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char>, Sroutine_hash_entry*>, true> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>,);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char>, Prepared_statement*>, true> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>,);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<long unsigned int const, std::unique_ptr<Prepared_statement> >, false> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<long unsigned int const, std::unique_ptr<Prepared_statement, s);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<char** const, std::unique_ptr<char, My_free_deleter> >, false> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<char** const, std::unique_ptr<char, My_free_deleter> >, false>);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char>, User_level_lock*>, true> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>,);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char>, std::unique_ptr<TABLE_LIST, My_free_deleter> >, true> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>,);

	void Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char>, std::unique_ptr<user_var_entry, void (*)(user_var_entry*)> >, true> >(class Malloc_allocator<std::__detail::_Hash_node_base*> *, const class Malloc_allocator<std::__detail::_Hash_node<std::pair<const std::__cxx11::basic_string<char, std::char_traits<char>,);


	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
class malloc_unordered_map<binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter>, binary_log::Hash_Uuid, std::equal_to<binary_log::Uuid> > : public unordered_map<binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter>, binary_log::Hash_Uuid, std::equal_to<binary_log::Uuid>, Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > > {
public:

	/* class unordered_map<binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter>, binary_log::Hash_Uuid, std::equal_to<binary_log::Uuid>, Malloc_allocator<std::pair<const binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter> > > > <ancestor>; */ /*     0    64 */
	void malloc_unordered_map(class malloc_unordered_map<binary_log::Uuid, std::unique_ptr<Sid_map::Node, My_free_deleter>, binary_log::Hash_Uuid, std::equal, PSI_memory_key);


	/* size: 64, cachelines: 1, members: 1 */

	/* BRAIN FART ALERT! 64 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 512 bits */
};
class Prealloced_array<int, 8> {
	struct External {
		int *                      m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		int                        m_buff[8];            /*     0    32 */
	};

	static const bool                 Has_trivial_destructor; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<int, 8>  *);

	int * buffer(class Prealloced_array<int, 8> *);

	const int  * buffer(const class Prealloced_array<int, 8>  *);

	void set_size(class Prealloced_array<int, 8> *, size_t);

	void adjust_size(class Prealloced_array<int, 8> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<int, 8> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<int, 8> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<int, 8> *, const class Prealloced_array<int, 8>  &);

	void Prealloced_array(class Prealloced_array<int, 8> *, );

	void Prealloced_array(class Prealloced_array<int, 8> *, PSI_memory_key, const_iterator, const_iterator);

	typedef const int  * const_iterator;

	void Prealloced_array(class Prealloced_array<int, 8> *, class initializer_list<int>);

	class Prealloced_array<int, 8> & operator=(class Prealloced_array<int, 8> *, const class Prealloced_array<int, 8>  &);

	class Prealloced_array<int, 8> & operator=(class Prealloced_array<int, 8> *, );

	void ~Prealloced_array(class Prealloced_array<int, 8> *, int);

	size_t capacity(const class Prealloced_array<int, 8>  *);

	size_t element_size(const class Prealloced_array<int, 8>  *);

	bool empty(const class Prealloced_array<int, 8>  *);

	size_t size(const class Prealloced_array<int, 8>  *);

	int & at(class Prealloced_array<int, 8> *, size_t);

	const int  & at(const class Prealloced_array<int, 8>  *, size_t);

	int & operator[](class Prealloced_array<int, 8> *, size_t);

	const int  & operator[](const class Prealloced_array<int, 8>  *, size_t);

	int & back(class Prealloced_array<int, 8> *);

	const int  & back(const class Prealloced_array<int, 8>  *);

	int & front(class Prealloced_array<int, 8> *);

	const int  & front(const class Prealloced_array<int, 8>  *);

	typedef int * iterator;

	iterator begin(class Prealloced_array<int, 8> *);

	iterator end(class Prealloced_array<int, 8> *);

	const_iterator begin(const class Prealloced_array<int, 8>  *);

	const_iterator end(const class Prealloced_array<int, 8>  *);

	const_iterator cbegin(const class Prealloced_array<int, 8>  *);

	const_iterator cend(const class Prealloced_array<int, 8>  *);

	bool assign_at(class Prealloced_array<int, 8> *, size_t, const value_type  &);

	typedef int value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<int, 8> *, size_t);

	bool push_back(class Prealloced_array<int, 8> *, const int  &);

	bool push_back(class Prealloced_array<int, 8> *, );

	void pop_back(class Prealloced_array<int, 8> *);

	iterator insert(class Prealloced_array<int, 8> *, const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<int, 8> *, const_iterator, );

	class pair<int*, bool> insert_unique(class Prealloced_array<int, 8> *, const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<int, 8> *, const value_type  &);

	size_type count_unique(const class Prealloced_array<int, 8>  *, const value_type  &);

	iterator erase(class Prealloced_array<int, 8> *, const_iterator);

	iterator erase(class Prealloced_array<int, 8> *, size_t);

	void erase_at_end(class Prealloced_array<int, 8> *, const_iterator);

	iterator erase(class Prealloced_array<int, 8> *, const_iterator, const_iterator);

	void swap(class Prealloced_array<int, 8> *, class Prealloced_array<int, 8> &);

	void shrink_to_fit(class Prealloced_array<int, 8> *);

	void resize(class Prealloced_array<int, 8> *, size_t, const int  &);

	void clear(class Prealloced_array<int, 8> *);

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		int                m_buff[8];            /*     8    32 */
	};                                               /*     8    32 */

	/* size: 40, cachelines: 1, members: 3, static members: 2 */
	/* last cacheline: 40 bytes */
};
class Mutex_cond_array {
	struct Mutex_cond {
		struct mysql_mutex_t       mutex;                /*     0    48 */
		struct mysql_cond_t        cond;                 /*    48    56 */

		/* size: 104, cachelines: 2, members: 2 */
		/* last cacheline: 40 bytes */
	};

public:

	void Mutex_cond_array(class Mutex_cond_array *, class Checkable_rwlock *);

	void ~Mutex_cond_array(class Mutex_cond_array *, int);

	void lock(const class Mutex_cond_array  *, int);

	void unlock(const class Mutex_cond_array  *, int);

	void broadcast(const class Mutex_cond_array  *, int);

	void assert_owner(const class Mutex_cond_array  *, int);

	void assert_not_owner(const class Mutex_cond_array  *, int);

	bool wait(const class Mutex_cond_array  *, const class THD  *, int, class timespec *);

	void enter_cond(const class Mutex_cond_array  *, class THD *, int, PSI_stage_info *, PSI_stage_info *);

	int get_max_index(const class Mutex_cond_array  *);

	enum enum_return_status ensure_index(class Mutex_cond_array *, int);

	bool is_thd_killed(const class Mutex_cond_array  *, const class THD  *);

	class Mutex_cond * get_mutex_cond(const class Mutex_cond_array  *, int);

	class Checkable_rwlock *   global_lock;          /*     0     8 */
	class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> m_array; /*     8    72 */

	/* size: 80, cachelines: 2, members: 2 */
	/* last cacheline: 16 bytes */
};
class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> {
	struct External {
		class Mutex_cond * *       m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		class Mutex_cond *         m_buff[8];            /*     0    64 */
	};

	static const bool                 Has_trivial_destructor; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	class Mutex_cond * * buffer(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	class Mutex_cond * const * buffer(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	void set_size(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t);

	void adjust_size(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  &);

	void Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, );

	void Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, PSI_memory_key, const_iterator, const_iterator);

	typedef class Mutex_cond * const * const_iterator;

	void Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, class initializer_list<Mutex_cond_array::Mutex_cond*>);

	class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> & operator=(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  &);

	class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> & operator=(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, );

	void ~Prealloced_array(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, int);

	size_t capacity(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	size_t element_size(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	bool empty(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	size_t size(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	class Mutex_cond * & at(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t);

	class Mutex_cond * const & at(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *, size_t);

	class Mutex_cond * & operator[](class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t);

	class Mutex_cond * const & operator[](const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *, size_t);

	class Mutex_cond * & back(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	class Mutex_cond * const & back(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	class Mutex_cond * & front(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	class Mutex_cond * const & front(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	typedef class Mutex_cond * * iterator;

	iterator begin(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	iterator end(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	const_iterator begin(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	const_iterator end(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	const_iterator cbegin(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	const_iterator cend(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *);

	bool assign_at(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t, const value_type  &);

	typedef class Mutex_cond * value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t);

	bool push_back(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, class Mutex_cond * const &);

	bool push_back(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, );

	void pop_back(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	iterator insert(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const_iterator, );

	class pair<Mutex_cond_array::Mutex_cond**, bool> insert_unique(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const value_type  &);

	size_type count_unique(const class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8>  *, const value_type  &);

	iterator erase(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const_iterator);

	iterator erase(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t);

	void erase_at_end(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const_iterator);

	iterator erase(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, const_iterator, const_iterator);

	void swap(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> &);

	void shrink_to_fit(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	void resize(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *, size_t, class Mutex_cond * const &);

	void clear(class Prealloced_array<Mutex_cond_array::Mutex_cond*, 8> *);

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		class Mutex_cond * m_buff[8];            /*     8    64 */
	};                                               /*     8    64 */

	/* size: 72, cachelines: 2, members: 3, static members: 2 */
	/* last cacheline: 8 bytes */
};
struct Gtid {
	rpl_sidno                  sidno;                /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	rpl_gno                    gno;                  /*     8     8 */
	void clear(class Gtid *);

	void set(class Gtid *, rpl_sidno, rpl_gno);

	bool is_empty(const class Gtid  *);


	/* Bitfield combined with previous fields */

	static const int                  MAX_TEXT_LENGTH = 56; /*     0     0 */
	bool is_valid(const char  *);

	int to_string(const class Gtid  *, const rpl_sid  &, char *);

	int to_string(const class Gtid  *, const class Sid_map  *, char *, bool);

	bool equals(const class Gtid  *, const class Gtid  &);

	enum enum_return_status parse(class Gtid *, class Sid_map *, const char  *);

	void dbug_print(const class Gtid  *, const class Sid_map  *, const char  *, bool);


	/* size: 16, cachelines: 1, members: 2, static members: 1 */
	/* sum members: 12, holes: 1, sum holes: 4 */
	/* last cacheline: 16 bytes */
};
class Gtid_set {
	struct String_format {
		const char  *              begin;                /*     0     8 */
		const char  *              end;                  /*     8     8 */
		const char  *              sid_gno_separator;    /*    16     8 */
		const char  *              gno_start_end_separator; /*    24     8 */
		const char  *              gno_gno_separator;    /*    32     8 */
		const char  *              gno_sid_separator;    /*    40     8 */
		const char  *              empty_set_string;     /*    48     8 */
		const int                  begin_length;         /*    56     4 */
		const int                  end_length;           /*    60     4 */
		/* --- cacheline 1 boundary (64 bytes) --- */
		const int                  sid_gno_separator_length; /*    64     4 */
		const int                  gno_start_end_separator_length; /*    68     4 */
		const int                  gno_gno_separator_length; /*    72     4 */
		const int                  gno_sid_separator_length; /*    76     4 */
		const int                  empty_set_string_length; /*    80     4 */

		/* size: 88, cachelines: 2, members: 14 */
		/* padding: 4 */
		/* last cacheline: 24 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	struct Interval {
		rpl_gno                    start;                /*     0     8 */
		rpl_gno                    end;                  /*     8     8 */
		bool equals(const class Interval  *, const class Interval  &);

		class Interval *           next;                 /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> {
	public:

		void Interval_iterator_base(class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> *, const class Gtid_set  *, rpl_sidno);

		void Interval_iterator_base(class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> *, const class Gtid_set  *);

		void init(class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> *, const class Gtid_set  *, rpl_sidno);

		void next(class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> *);

		const class Interval  * get(const class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*>  *);

	protected:

		const class Interval  * *  p;                    /*     0     8 */

		/* size: 8, cachelines: 1, members: 1 */
		/* last cacheline: 8 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	class Const_interval_iterator : public Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> {
	public:

		/* class Interval_iterator_base<const Gtid_set*, const Gtid_set::Interval*> <ancestor>; */ /*     0     8 */
		void Const_interval_iterator(class Const_interval_iterator *, const class Gtid_set  *, rpl_sidno);

		void Const_interval_iterator(class Const_interval_iterator *, const class Gtid_set  *);


		/* size: 8, cachelines: 1, members: 1 */
		/* last cacheline: 8 bytes */

		/* BRAIN FART ALERT! 8 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 64 bits */
	};

	class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> {
	public:

		void Interval_iterator_base(class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> *, class Gtid_set *, rpl_sidno);

		void Interval_iterator_base(class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> *, class Gtid_set *);

		void init(class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> *, class Gtid_set *, rpl_sidno);

		void next(class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> *);

		class Interval * get(const class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*>  *);

	protected:

		class Interval * *         p;                    /*     0     8 */

		/* size: 8, cachelines: 1, members: 1 */
		/* last cacheline: 8 bytes */
	};

	/* tag__fprintf: const_type tag not supported! */;

	class Interval_iterator : public Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> {
	public:

		/* class Interval_iterator_base<Gtid_set*, Gtid_set::Interval*> <ancestor>; */ /*     0     8 */
		void Interval_iterator(class Interval_iterator *, class Gtid_set *, rpl_sidno);

		void Interval_iterator(class Interval_iterator *, class Gtid_set *);

		void set(class Interval_iterator *, class Interval *);

		void insert(class Interval_iterator *, class Interval *);

		void remove(class Interval_iterator *, class Gtid_set *);


		/* size: 8, cachelines: 1, members: 1 */
		/* last cacheline: 8 bytes */

		/* BRAIN FART ALERT! 8 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 64 bits */
	};

	struct Interval_chunk {
		class Interval_chunk *     next;                 /*     0     8 */
		struct Interval            intervals[1];         /*     8    24 */

		/* size: 32, cachelines: 1, members: 2 */
		/* last cacheline: 32 bytes */
	};

	class Free_intervals_lock {
	public:

		void Free_intervals_lock(class Free_intervals_lock *, class Gtid_set *);

		void lock_if_not_locked(class Free_intervals_lock *);

		void unlock_if_locked(class Free_intervals_lock *);

		void ~Free_intervals_lock(class Free_intervals_lock *, int);

		class Gtid_set *           gtid_set;             /*     0     8 */
		bool                       locked;               /*     8     1 */

		/* size: 16, cachelines: 1, members: 2 */
		/* padding: 7 */
		/* last cacheline: 16 bytes */
	};

public:

	static PSI_mutex_key              key_gtid_executed_free_intervals_mutex; /*     0     0 */
	void Gtid_set(class Gtid_set *, class Sid_map *, class Checkable_rwlock *);

	void Gtid_set(class Gtid_set *, class Sid_map *, const char  *, enum enum_return_status *, class Checkable_rwlock *);

	void init(class Gtid_set *);

	void ~Gtid_set(class Gtid_set *, int);

	void clear(class Gtid_set *);

	void clear_set_and_sid_map(class Gtid_set *);

	void _add_gtid(class Gtid_set *, rpl_sidno, rpl_gno);

	void _remove_gtid(class Gtid_set *, rpl_sidno, rpl_gno);

	void _add_gtid(class Gtid_set *, const class Gtid  &);

	void _remove_gtid(class Gtid_set *, const class Gtid  &);

	enum enum_return_status add_gtid_set(class Gtid_set *, const class Gtid_set  *);

	void remove_gtid_set(class Gtid_set *, const class Gtid_set  *);

	void remove_intervals_for_sidno(class Gtid_set *, class Gtid_set *, rpl_sidno);

	enum enum_return_status add_gtid_text(class Gtid_set *, const char  *, bool *, bool *);

	enum enum_return_status add_gtid_encoding(class Gtid_set *, const uchar  *, size_t, size_t *);

	bool contains_gtid(const class Gtid_set  *, rpl_sidno, rpl_gno);

	bool contains_gtid(const class Gtid_set  *, const class Gtid  &);

	rpl_gno get_last_gno(const class Gtid_set  *, rpl_sidno);

	rpl_sidno get_max_sidno(const class Gtid_set  *);

	enum enum_return_status ensure_sidno(class Gtid_set *, rpl_sidno);

	bool is_subset(const class Gtid_set  *, const class Gtid_set  *);

	bool is_subset_not_equals(const class Gtid_set  *, const class Gtid_set  *);

	bool is_subset_for_sid(const class Gtid_set  *, const class Gtid_set  *, rpl_sidno, rpl_sidno);

	bool is_intersection_nonempty(const class Gtid_set  *, const class Gtid_set  *);

	enum enum_return_status intersection(class Gtid_set *, const class Gtid_set  *, class Gtid_set *);

	bool is_empty(const class Gtid_set  *);

	bool is_size_greater_than_or_equal(const class Gtid_set  *, ulonglong);

	ulonglong get_gtid_count(const class Gtid_set  *, rpl_sidno);

	bool contains_sidno(const class Gtid_set  *, rpl_sidno);

	bool is_valid(const char  *);

	size_t get_string_length(const class Gtid_set  *, const class String_format  *);

	size_t to_string(const class Gtid_set  *, char *, bool, const class String_format  *);

	long int to_string(const class Gtid_set  *, char * *, bool, const class String_format  *);

	void dbug_print(const class Gtid_set  *, const char  *, bool, const class String_format  *);

	void get_gtid_intervals(const class Gtid_set  *, class list<Gtid_interval, std::allocator<Gtid_interval> > *);

	static const struct String_format default_string_format; /*     0     0 */
	static const struct String_format sql_string_format; /*     0     0 */
	static const struct String_format commented_string_format; /*     0     0 */
	class Sid_map * get_sid_map(const class Gtid_set  *);

	void add_interval_memory(class Gtid_set *, int, class Interval *);

	void encode(const class Gtid_set  *, uchar *);

	size_t get_encoded_length(const class Gtid_set  *);

	static const int                  CHUNK_GROW_SIZE = 8; /*     0     0 */
	bool sidno_equals(const class Gtid_set  *, rpl_sidno, const class Gtid_set  *, rpl_sidno);

	bool equals(const class Gtid_set  *, const class Gtid_set  *);

	int get_n_intervals(const class Gtid_set  *, rpl_sidno);

	int get_n_intervals(const class Gtid_set  *);

	void create_new_chunk(class Gtid_set *, int);

	void get_free_interval(class Gtid_set *, class Interval * *);

	void put_free_interval(class Gtid_set *, class Interval *);

	void add_interval_memory_lock_taken(class Gtid_set *, int, class Interval *);

	class Checkable_rwlock *   sid_lock;             /*     0     8 */
	struct mysql_mutex_t       free_intervals_mutex; /*     8    48 */
	void assert_free_intervals_locked(class Gtid_set *);

	void add_gno_interval(class Gtid_set *, class Interval_iterator *, rpl_gno, rpl_gno, class Free_intervals_lock *);

	void remove_gno_interval(class Gtid_set *, class Interval_iterator *, rpl_gno, rpl_gno, class Free_intervals_lock *);

	void add_gno_intervals(class Gtid_set *, rpl_sidno, class Const_interval_iterator, class Free_intervals_lock *);

	void remove_gno_intervals(class Gtid_set *, rpl_sidno, class Const_interval_iterator, class Free_intervals_lock *);

	bool is_interval_subset(class Const_interval_iterator *, class Const_interval_iterator *);

	bool is_interval_intersection_nonempty(class Const_interval_iterator *, class Const_interval_iterator *);

	class Sid_map *            sid_map;              /*    56     8 */
	class Prealloced_array<Gtid_set::Interval*, 8> m_intervals; /*    64    72 */
	/* --- cacheline 2 boundary (128 bytes) was 8 bytes ago --- */
	class Interval *           free_intervals;       /*   136     8 */
	class Interval_chunk *     chunks;               /*   144     8 */
	bool                       has_cached_string_length; /*   152     1 */

	/* XXX 7 bytes hole, try to pack */

	size_t                     cached_string_length; /*   160     8 */
	const class String_format  * cached_string_format; /*   168     8 */

	/* size: 176, cachelines: 3, members: 9, static members: 5 */
	/* sum members: 169, holes: 1, sum holes: 7 */
	/* last cacheline: 48 bytes */
};
class Prealloced_array<Gtid_set::Interval*, 8> {
	struct External {
		class Interval * *         m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		class Interval *           m_buff[8];            /*     0    64 */
	};

	static const bool                 Has_trivial_destructor; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	class Interval * * buffer(class Prealloced_array<Gtid_set::Interval*, 8> *);

	class Interval * const * buffer(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	void set_size(class Prealloced_array<Gtid_set::Interval*, 8> *, size_t);

	void adjust_size(class Prealloced_array<Gtid_set::Interval*, 8> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, const class Prealloced_array<Gtid_set::Interval*, 8>  &);

	void Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, );

	void Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, PSI_memory_key, const_iterator, const_iterator);

	typedef class Interval * const * const_iterator;

	void Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, class initializer_list<Gtid_set::Interval*>);

	class Prealloced_array<Gtid_set::Interval*, 8> & operator=(class Prealloced_array<Gtid_set::Interval*, 8> *, const class Prealloced_array<Gtid_set::Interval*, 8>  &);

	class Prealloced_array<Gtid_set::Interval*, 8> & operator=(class Prealloced_array<Gtid_set::Interval*, 8> *, );

	void ~Prealloced_array(class Prealloced_array<Gtid_set::Interval*, 8> *, int);

	size_t capacity(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	size_t element_size(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	bool empty(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	size_t size(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	class Interval * & at(class Prealloced_array<Gtid_set::Interval*, 8> *, size_t);

	class Interval * const & at(const class Prealloced_array<Gtid_set::Interval*, 8>  *, size_t);

	class Interval * & operator[](class Prealloced_array<Gtid_set::Interval*, 8> *, size_t);

	class Interval * const & operator[](const class Prealloced_array<Gtid_set::Interval*, 8>  *, size_t);

	class Interval * & back(class Prealloced_array<Gtid_set::Interval*, 8> *);

	class Interval * const & back(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	class Interval * & front(class Prealloced_array<Gtid_set::Interval*, 8> *);

	class Interval * const & front(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	typedef class Interval * * iterator;

	iterator begin(class Prealloced_array<Gtid_set::Interval*, 8> *);

	iterator end(class Prealloced_array<Gtid_set::Interval*, 8> *);

	const_iterator begin(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	const_iterator end(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	const_iterator cbegin(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	const_iterator cend(const class Prealloced_array<Gtid_set::Interval*, 8>  *);

	bool assign_at(class Prealloced_array<Gtid_set::Interval*, 8> *, size_t, const value_type  &);

	typedef class Interval * value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<Gtid_set::Interval*, 8> *, size_t);

	bool push_back(class Prealloced_array<Gtid_set::Interval*, 8> *, class Interval * const &);

	bool push_back(class Prealloced_array<Gtid_set::Interval*, 8> *, );

	void pop_back(class Prealloced_array<Gtid_set::Interval*, 8> *);

	iterator insert(class Prealloced_array<Gtid_set::Interval*, 8> *, const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<Gtid_set::Interval*, 8> *, const_iterator, );

	class pair<Gtid_set::Interval**, bool> insert_unique(class Prealloced_array<Gtid_set::Interval*, 8> *, const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<Gtid_set::Interval*, 8> *, const value_type  &);

	size_type count_unique(const class Prealloced_array<Gtid_set::Interval*, 8>  *, const value_type  &);

	iterator erase(class Prealloced_array<Gtid_set::Interval*, 8> *, const_iterator);

	iterator erase(class Prealloced_array<Gtid_set::Interval*, 8> *, size_t);

	void erase_at_end(class Prealloced_array<Gtid_set::Interval*, 8> *, const_iterator);

	iterator erase(class Prealloced_array<Gtid_set::Interval*, 8> *, const_iterator, const_iterator);

	void swap(class Prealloced_array<Gtid_set::Interval*, 8> *, class Prealloced_array<Gtid_set::Interval*, 8> &);

	void shrink_to_fit(class Prealloced_array<Gtid_set::Interval*, 8> *);

	void resize(class Prealloced_array<Gtid_set::Interval*, 8> *, size_t, class Interval * const &);

	void clear(class Prealloced_array<Gtid_set::Interval*, 8> *);

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		class Interval *   m_buff[8];            /*     8    64 */
	};                                               /*     8    64 */

	/* size: 72, cachelines: 2, members: 3, static members: 2 */
	/* last cacheline: 8 bytes */
};
struct Gtid_set_or_null {
	class Gtid_set *           gtid_set;             /*     0     8 */
	bool                       is_non_null;          /*     8     1 */
	class Gtid_set * get_gtid_set(const class Gtid_set_or_null  *);

	class Gtid_set * set_non_null(class Gtid_set_or_null *, class Sid_map *);

	void set_null(class Gtid_set_or_null *);


	/* size: 16, cachelines: 1, members: 2 */
	/* padding: 7 */
	/* last cacheline: 16 bytes */
};
class Owned_gtids {
	struct Node {
		rpl_gno                    gno;                  /*     0     8 */
		my_thread_id               owner;                /*     8     4 */

		/* size: 16, cachelines: 1, members: 2 */
		/* padding: 4 */
		/* last cacheline: 16 bytes */
	};

public:

	void Owned_gtids(class Owned_gtids *, class Checkable_rwlock *);

	void ~Owned_gtids(class Owned_gtids *, int);

	enum enum_return_status add_gtid_owner(class Owned_gtids *, const class Gtid  &, my_thread_id);

	void get_gtids(const class Owned_gtids  *, class Gtid_set &);

	void remove_gtid(class Owned_gtids *, const class Gtid  &, my_thread_id);

	enum enum_return_status ensure_sidno(class Owned_gtids *, rpl_sidno);

	bool is_intersection_nonempty(const class Owned_gtids  *, const class Gtid_set  *);

	bool is_empty(const class Owned_gtids  *);

	rpl_sidno get_max_sidno(const class Owned_gtids  *);

	int to_string(const class Owned_gtids  *, char *);

	size_t get_max_string_length(const class Owned_gtids  *);

	bool thread_owns_anything(const class Owned_gtids  *, my_thread_id);

	void dbug_print(const class Owned_gtids  *, const char  *);

	bool is_owned_by(const class Owned_gtids  *, const class Gtid  &, my_thread_id);

	class Checkable_rwlock *   sid_lock;             /*     0     8 */
	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ get_hash(const class Owned_gtids  *, rpl_sidno);

	bool contains_gtid(const class Owned_gtids  *, const class Gtid  &);

	class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int> >*, 8> sidno_to_hash; /*     8    72 */

	/* size: 80, cachelines: 2, members: 2 */
	/* last cacheline: 16 bytes */
};
class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int> >*, 8> {
	struct External {
		class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ m_array_ptr; /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ m_buff[8]; /*     0    64 */
	};

	static const bool                 Has_trivial_destructor; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ buffer(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ buffer(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	void set_size(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t);

	void adjust_size(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , PSI_memory_key);

	void Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	void Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , );

	void Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , PSI_memory_key, const_iterator, const_iterator);

	typedef class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int> > * const * const_iterator;

	void Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , class initializer_list<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long  operator=(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long  operator=(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , );

	void ~Prealloced_array(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , int);

	size_t capacity(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	size_t element_size(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	bool empty(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	size_t size(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ at(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ at(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash, size_t);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ operator[](class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ operator[](const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash, size_t);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ back(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ back(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ front(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ front(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	typedef class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int> > * * iterator;

	iterator begin(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	iterator end(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	const_iterator begin(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	const_iterator end(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	const_iterator cbegin(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	const_iterator cend(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash);

	bool assign_at(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t, const value_type  &);

	typedef class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int> > * value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t);

	bool push_back(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_);

	bool push_back(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , );

	void pop_back(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	iterator insert(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const_iterator, );

	class pair<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::e insert_unique(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const value_type  &);

	size_type count_unique(const class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash, const value_type  &);

	iterator erase(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const_iterator);

	iterator erase(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t);

	void erase_at_end(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const_iterator);

	iterator erase(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , const_iterator, const_iterator);

	void swap(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	void shrink_to_fit(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	void resize(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long , size_t, class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_);

	void clear(class Prealloced_array<malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long );

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_ m_buff[8]; /*     8    64 */
	};                                               /*     8    64 */

	/* size: 72, cachelines: 2, members: 3, static members: 2 */
	/* last cacheline: 8 bytes */
};
class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int> > : public unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int>, Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > > {
public:

	/* class unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_to<long int>, Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > > <ancestor>; */ /*     0    64 */
	void malloc_unordered_multimap(class malloc_unordered_multimap<long int, std::unique_ptr<Owned_gtids::Node, My_free_deleter>, std::hash<long int>, std::equal_, PSI_memory_key);


	/* size: 64, cachelines: 1, members: 1 */

	/* BRAIN FART ALERT! 64 bytes != 0 (member bytes) + 0 (member bits) + 0 (byte holes) + 0 (bit holes), diff = 512 bits */
};
class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > {
	PSI_memory_key             m_key;                /*     0     4 */
	typedef class pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > * pointer;

public:

	pointer address(const class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > >  *, reference);

	typedef class pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > & reference;

	typedef const class pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >  * const_pointer;

	const_pointer address(const class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > >  *, const_reference);

	typedef const class pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >  & const_reference;

	void Malloc_allocator(class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > *, PSI_memory_key);

	pointer allocate(class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > *, size_type, const_pointer);

	typedef size_t size_type;

	void deallocate(class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > *, pointer, size_type);

	void destroy(class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > > *, pointer);

	size_type max_size(const class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > >  *);

	PSI_memory_key psi_key(const class Malloc_allocator<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> > >  *);


	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >, false> > {
	PSI_memory_key             m_key;                /*     0     4 */
	typedef class _Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >, false> * pointer;

public:

	pointer address(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_del, reference);

	typedef class _Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >, false> & reference;

	typedef const class _Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >, false>  * const_pointer;

	const_pointer address(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_del, const_reference);

	typedef const class _Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >, false>  & const_reference;

	void Malloc_allocator(class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> , PSI_memory_key);

	pointer allocate(class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> , size_type, const_pointer);

	typedef size_t size_type;

	void deallocate(class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> , pointer, size_type);

	void destroy(class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> , pointer);

	size_type max_size(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_del);

	PSI_memory_key psi_key(const class Malloc_allocator<std::__detail::_Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_del);

	typedef struct _Hash_node<std::pair<long int const, std::unique_ptr<Owned_gtids::Node, My_free_deleter> >, false> value_type;


	/* size: 4, cachelines: 1, members: 1 */
	/* last cacheline: 4 bytes */
};
class Prealloced_array<bool, 8> {
	struct External {
		bool *                     m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		bool                       m_buff[8];            /*     0     8 */
	};

	static const bool                 Has_trivial_destructor = 1; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<bool, 8>  *);

	bool * buffer(class Prealloced_array<bool, 8> *);

	const bool  * buffer(const class Prealloced_array<bool, 8>  *);

	void set_size(class Prealloced_array<bool, 8> *, size_t);

	void adjust_size(class Prealloced_array<bool, 8> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<bool, 8> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<bool, 8> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<bool, 8> *, const class Prealloced_array<bool, 8>  &);

	void Prealloced_array(class Prealloced_array<bool, 8> *, );

	void Prealloced_array(class Prealloced_array<bool, 8> *, PSI_memory_key, const_iterator, const_iterator);

	typedef const bool  * const_iterator;

	void Prealloced_array(class Prealloced_array<bool, 8> *, class initializer_list<bool>);

	class Prealloced_array<bool, 8> & operator=(class Prealloced_array<bool, 8> *, const class Prealloced_array<bool, 8>  &);

	class Prealloced_array<bool, 8> & operator=(class Prealloced_array<bool, 8> *, );

	void ~Prealloced_array(class Prealloced_array<bool, 8> *, int);

	size_t capacity(const class Prealloced_array<bool, 8>  *);

	size_t element_size(const class Prealloced_array<bool, 8>  *);

	bool empty(const class Prealloced_array<bool, 8>  *);

	size_t size(const class Prealloced_array<bool, 8>  *);

	bool & at(class Prealloced_array<bool, 8> *, size_t);

	const bool  & at(const class Prealloced_array<bool, 8>  *, size_t);

	bool & operator[](class Prealloced_array<bool, 8> *, size_t);

	const bool  & operator[](const class Prealloced_array<bool, 8>  *, size_t);

	bool & back(class Prealloced_array<bool, 8> *);

	const bool  & back(const class Prealloced_array<bool, 8>  *);

	bool & front(class Prealloced_array<bool, 8> *);

	const bool  & front(const class Prealloced_array<bool, 8>  *);

	typedef bool * iterator;

	iterator begin(class Prealloced_array<bool, 8> *);

	iterator end(class Prealloced_array<bool, 8> *);

	const_iterator begin(const class Prealloced_array<bool, 8>  *);

	const_iterator end(const class Prealloced_array<bool, 8>  *);

	const_iterator cbegin(const class Prealloced_array<bool, 8>  *);

	const_iterator cend(const class Prealloced_array<bool, 8>  *);

	bool assign_at(class Prealloced_array<bool, 8> *, size_t, const value_type  &);

	typedef bool value_type;

	/* tag__fprintf: const_type tag not supported! */;

	bool reserve(class Prealloced_array<bool, 8> *, size_t);

	bool push_back(class Prealloced_array<bool, 8> *, const bool  &);

	bool push_back(class Prealloced_array<bool, 8> *, );

	void pop_back(class Prealloced_array<bool, 8> *);

	iterator insert(class Prealloced_array<bool, 8> *, const_iterator, const value_type  &);

	iterator insert(class Prealloced_array<bool, 8> *, const_iterator, );

	class pair<bool*, bool> insert_unique(class Prealloced_array<bool, 8> *, const value_type  &);

	typedef size_t size_type;

	size_type erase_unique(class Prealloced_array<bool, 8> *, const value_type  &);

	size_type count_unique(const class Prealloced_array<bool, 8>  *, const value_type  &);

	iterator erase(class Prealloced_array<bool, 8> *, const_iterator);

	iterator erase(class Prealloced_array<bool, 8> *, size_t);

	void erase_at_end(class Prealloced_array<bool, 8> *, const_iterator);

	iterator erase(class Prealloced_array<bool, 8> *, const_iterator, const_iterator);

	void swap(class Prealloced_array<bool, 8> *, class Prealloced_array<bool, 8> &);

	void shrink_to_fit(class Prealloced_array<bool, 8> *);

	void resize(class Prealloced_array<bool, 8> *, size_t, const bool  &);

	void clear(class Prealloced_array<bool, 8> *);

	PSI_memory_key             m_psi_key;            /*     0     4 */
	int                        m_inline_size;        /*     4     4 */
	union {
		struct External    m_ext;                /*     8    24 */
		bool               m_buff[8];            /*     8     8 */
	};                                               /*     8    24 */

	/* size: 32, cachelines: 1, members: 3, static members: 2 */
	/* last cacheline: 32 bytes */
};
class Gtid_state {
public:

	void Gtid_state(class Gtid_state *, class Checkable_rwlock *, class Sid_map *);

	int init(class Gtid_state *);

	int clear(class Gtid_state *, class THD *);

	bool is_executed(const class Gtid_state  *, const class Gtid  &);

	bool is_owned(const class Gtid_state  *, const class Gtid  &);

	enum enum_return_status acquire_ownership(class Gtid_state *, class THD *, const class Gtid  &);

	void update_commit_group(class Gtid_state *, class THD *);

	void update_on_commit(class Gtid_state *, class THD *);

	void update_on_rollback(class Gtid_state *, class THD *);

	void acquire_anonymous_ownership(class Gtid_state *);

	void release_anonymous_ownership(class Gtid_state *);

	int32 get_anonymous_ownership_count(class Gtid_state *);

	void begin_automatic_gtid_violating_transaction(class Gtid_state *);

	void end_automatic_gtid_violating_transaction(class Gtid_state *);

	int32 get_automatic_gtid_violating_transaction_count(class Gtid_state *);

	void begin_anonymous_gtid_violating_transaction(class Gtid_state *);

	void end_anonymous_gtid_violating_transaction(class Gtid_state *);

	void end_gtid_violating_transaction(class Gtid_state *, class THD *);

	int32 get_anonymous_gtid_violating_transaction_count(class Gtid_state *);

	void begin_gtid_wait(class Gtid_state *);

	void end_gtid_wait(class Gtid_state *);

	int32 get_gtid_wait_count(class Gtid_state *);

	rpl_gno get_automatic_gno(const class Gtid_state  *, rpl_sidno);

	rpl_gno                    next_free_gno;        /*     0     8 */
	rpl_gno get_last_executed_gno(const class Gtid_state  *, rpl_sidno);

	enum enum_return_status generate_automatic_gtid(class Gtid_state *, class THD *, rpl_sidno, rpl_gno, rpl_sidno *);

	void lock_sidno(class Gtid_state *, rpl_sidno);

	void unlock_sidno(class Gtid_state *, rpl_sidno);

	void broadcast_sidno(class Gtid_state *, rpl_sidno);

	void assert_sidno_lock_owner(const class Gtid_state  *, rpl_sidno);

	bool wait_for_sidno(class Gtid_state *, class THD *, rpl_sidno, class timespec *);

	bool wait_for_gtid(class Gtid_state *, class THD *, const class Gtid  &, class timespec *);

	bool wait_for_gtid_set(class Gtid_state *, class THD *, class Gtid_set *, double);

	void lock_sidnos(class Gtid_state *, const class Gtid_set  *);

	void unlock_sidnos(class Gtid_state *, const class Gtid_set  *);

	void broadcast_sidnos(class Gtid_state *, const class Gtid_set  *);

	enum enum_return_status ensure_sidno(class Gtid_state *);

	enum enum_return_status add_lost_gtids(class Gtid_state *, class Gtid_set *, bool);

	void update_prev_gtids(class Gtid_state *, class Gtid_set *);

	const class Gtid_set  * get_lost_gtids(const class Gtid_state  *);

	const class Gtid_set  * get_executed_gtids(const class Gtid_state  *);

	const class Gtid_set  * get_gtids_only_in_table(const class Gtid_state  *);

	const class Gtid_set  * get_previous_gtids_logged(const class Gtid_state  *);

	const class Owned_gtids  * get_owned_gtids(const class Gtid_state  *);

	rpl_sidno get_server_sidno(const class Gtid_state  *);

	const rpl_sid  & get_server_sid(const class Gtid_state  *);

	void dbug_print(const class Gtid_state  *, const char  *);

	int save(class Gtid_state *, class THD *);

	int save(class Gtid_state *, const class Gtid_set  *);

	int save_gtids_of_last_binlog_into_table(class Gtid_state *);

	int read_gtid_executed_from_table(class Gtid_state *);

	int compress(class Gtid_state *, class THD *);

	int warn_or_err_on_modify_gtid_table(class Gtid_state *, class THD *, class TABLE_LIST *);

	void get_snapshot_gtid_executed(class Gtid_state *, string &);

	void update_gtids_impl(class Gtid_state *, class THD *, bool);

	void unlock_owned_sidnos(class Gtid_state *, const class THD  *);

	void broadcast_owned_sidnos(class Gtid_state *, const class THD  *);

	class Checkable_rwlock *   sid_lock;             /*     8     8 */
	class Sid_map *            sid_map;              /*    16     8 */
	class Mutex_cond_array    sid_locks;             /*    24    80 */
	/* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
	class Gtid_set            lost_gtids;            /*   104   176 */
	/* --- cacheline 4 boundary (256 bytes) was 24 bytes ago --- */
	class Gtid_set            executed_gtids;        /*   280   176 */
	/* --- cacheline 7 boundary (448 bytes) was 8 bytes ago --- */
	class Gtid_set            gtids_only_in_table;   /*   456   176 */
	/* --- cacheline 9 boundary (576 bytes) was 56 bytes ago --- */
	class Gtid_set            previous_gtids_logged; /*   632   176 */
	/* --- cacheline 12 boundary (768 bytes) was 40 bytes ago --- */
	class Owned_gtids         owned_gtids;           /*   808    80 */
	/* --- cacheline 13 boundary (832 bytes) was 56 bytes ago --- */
	rpl_sidno                  server_sidno;         /*   888     4 */
	struct atomic<int>         atomic_anonymous_gtid_count __attribute__((__aligned__(4))); /*   892     4 */
	/* --- cacheline 14 boundary (896 bytes) --- */
	struct atomic<int>         atomic_automatic_gtid_violation_count __attribute__((__aligned__(4))); /*   896     4 */
	struct atomic<int>         atomic_anonymous_gtid_violation_count __attribute__((__aligned__(4))); /*   900     4 */
	struct atomic<int>         atomic_gtid_wait_count __attribute__((__aligned__(4))); /*   904     4 */

	/* XXX 4 bytes hole, try to pack */
	bool update_gtids_impl_check_skip_gtid_rollback(class Gtid_state *, class THD *);

	bool update_gtids_impl_do_nothing(class Gtid_state *, class THD *);

	bool update_gtids_impl_begin(class Gtid_state *, class THD *);

	void update_gtids_impl_own_gtid_set(class Gtid_state *, class THD *, bool);

	void update_gtids_impl_lock_sidno(class Gtid_state *, rpl_sidno);

	void update_gtids_impl_lock_sidnos(class Gtid_state *, class THD *);

	void update_gtids_impl_own_gtid(class Gtid_state *, class THD *, bool);

	void update_gtids_impl_broadcast_and_unlock_sidno(class Gtid_state *, rpl_sidno);

	void update_gtids_impl_broadcast_and_unlock_sidnos(class Gtid_state *);

	void update_gtids_impl_own_anonymous(class Gtid_state *, class THD *, bool *);

	void update_gtids_impl_own_nothing(class Gtid_state *, class THD *);

	void update_gtids_impl_end(class Gtid_state *, class THD *, bool);


	class Prealloced_array<bool, 8> commit_group_sidnos; /*   912    32 */
	enum enum_return_status ensure_commit_group_sidnos(class Gtid_state *, rpl_sidno);


	/* size: 944, cachelines: 15, members: 15 */
	/* sum members: 940, holes: 1, sum holes: 4 */
	/* forced alignments: 4 */
	/* last cacheline: 48 bytes */
} __attribute__((__aligned__(8)));
struct Gtid_specification {
	enum enum_gtid_type        type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	struct Gtid                gtid;                 /*     8    16 */
	void set(class Gtid_specification *, rpl_sidno, rpl_gno);

	void set(class Gtid_specification *, const class Gtid  &);

	void set_automatic(class Gtid_specification *);

	void set_anonymous(class Gtid_specification *);

	void set_not_yet_determined(class Gtid_specification *);

	void set_undefined(class Gtid_specification *);

	bool equals(const class Gtid_specification  *, const class Gtid_specification  &);

	bool equals(const class Gtid_specification  *, const class Gtid  &);

	enum enum_return_status parse(class Gtid_specification *, class Sid_map *, const char  *);

	bool is_valid(const char  *);


	/* Bitfield combined with previous fields */

	static const int                  MAX_TEXT_LENGTH = 56; /*     0     0 */
	int to_string(const class Gtid_specification  *, const class Sid_map  *, char *, bool);

	int to_string(const class Gtid_specification  *, const rpl_sid  *, char *);

	void dbug_print(const class Gtid_specification  *, const char  *, bool);


	/* size: 24, cachelines: 1, members: 2, static members: 1 */
	/* sum members: 20, holes: 1, sum holes: 4 */
	/* last cacheline: 24 bytes */
};
struct st_plugin_int {
	LEX_CSTRING                name;                 /*     0    16 */
	class st_mysql_plugin *    plugin;               /*    16     8 */
	class st_plugin_dl *       plugin_dl;            /*    24     8 */
	uint                       state;                /*    32     4 */
	uint                       ref_count;            /*    36     4 */
	void *                     data;                 /*    40     8 */
	struct MEM_ROOT            mem_root;             /*    48    80 */

	/* XXX last struct has 4 bytes of padding */

	/* --- cacheline 2 boundary (128 bytes) --- */
	class sys_var *            system_vars;          /*   128     8 */
	enum enum_plugin_load_option load_option;        /*   136     4 */

	/* size: 144, cachelines: 3, members: 9 */
	/* padding: 4 */
	/* paddings: 1, sum paddings: 4 */
	/* last cacheline: 16 bytes */
};
struct st_mysql_plugin {
	int                        type;                 /*     0     4 */

	/* XXX 4 bytes hole, try to pack */

	void *                     info;                 /*     8     8 */
	const char  *              name;                 /*    16     8 */
	const char  *              author;               /*    24     8 */
	const char  *              descr;                /*    32     8 */
	int                        license;              /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	int                        (*init)(MYSQL_PLUGIN); /*    48     8 */
	int                        (*check_uninstall)(MYSQL_PLUGIN); /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */
	int                        (*deinit)(MYSQL_PLUGIN); /*    64     8 */
	unsigned int               version;              /*    72     4 */

	/* XXX 4 bytes hole, try to pack */

	class SHOW_VAR *           status_vars;          /*    80     8 */
	class SYS_VAR * *          system_vars;          /*    88     8 */
	void *                     __reserved1;          /*    96     8 */
	long unsigned int          flags;                /*   104     8 */

	/* size: 112, cachelines: 2, members: 14 */
	/* sum members: 100, holes: 3, sum holes: 12 */
	/* last cacheline: 48 bytes */
};
struct st_plugin_dl {
	LEX_STRING                 dl;                   /*     0    16 */
	void *                     handle;               /*    16     8 */
	class st_mysql_plugin *    plugins;              /*    24     8 */
	int                        version;              /*    32     4 */
	uint                       ref_count;            /*    36     4 */

	/* size: 40, cachelines: 1, members: 5 */
	/* last cacheline: 40 bytes */
};
class Prealloced_array<st_plugin_int*, 2> {
	struct External {
		class st_plugin_int * *    m_array_ptr;          /*     0     8 */
		size_t                     m_alloced_size;       /*     8     8 */
		size_t                     m_alloced_capacity;   /*    16     8 */

		/* size: 24, cachelines: 1, members: 3 */
		/* last cacheline: 24 bytes */
	};

	union {
		struct External            m_ext;                /*     0    24 */
		class st_plugin_int *      m_buff[2];            /*     0    16 */
	};

	static const bool                 Has_trivial_destructor = 1; /*     0     0 */
	bool using_inline_buffer(const class Prealloced_array<st_plugin_int*, 2>  *);

	class st_plugin_int * * buffer(class Prealloced_array<st_plugin_int*, 2> *);

	class st_plugin_int * const * buffer(const class Prealloced_array<st_plugin_int*, 2>  *);

	void set_size(class Prealloced_array<st_plugin_int*, 2> *, size_t);

	void adjust_size(class Prealloced_array<st_plugin_int*, 2> *, int);

public:

	static const size_t               initial_capacity; /*     0     0 */
	void Prealloced_array(class Prealloced_array<st_plugin_int*, 2> *, PSI_memory_key);

	void Prealloced_array(class Prealloced_array<st_plugin_int*, 2> *, PSI_memory_key, size_t);

	void Prealloced_array(class Prealloced_array<st_plugin_int*, 2> *, const class Prealloced_array<st_plugin_int*, 2>  &);

	void Prealloced_array(class Prealloced_array<st_plugin_int*, 2> *, );

